#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Manny

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_Manny.ABP_Manny_C.AnimBlueprintGeneratedMutableData
// 0x0007 (0x0008 - 0x0001)
struct ABP_Manny::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Manny::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_Manny::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_Manny::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong size on ABP_Manny::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_Manny::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'ABP_Manny::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");

// ScriptStruct ABP_Manny.ABP_Manny_C.AnimBlueprintGeneratedConstantData
// 0x017F (0x0180 - 0x0001)
struct ABP_Manny::FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_131;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            __BlendSpace_132;                                  // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_133;                                // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_134;                            // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_135;                                // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_136;                            // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_137;                                // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_138;                                 // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_139;                               // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_140;                            // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_141;                                // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_142;                                 // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_143;                                // 0x005C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_144;                               // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_145;                              // 0x0064(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_146;                               // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_147;                            // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_148;                                // 0x00A0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_149;                                // 0x00A1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_150;                                // 0x00A2(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3[0x1];                                       // 0x00A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_151;                                // 0x00A4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_152;                                 // 0x00AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_153;                                // 0x00B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_154;                                // 0x00B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_155;                                 // 0x00C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_156;                              // 0x00C8(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00E8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0168(0x0018)()
};
static_assert(alignof(ABP_Manny::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_Manny::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_Manny::FAnimBlueprintGeneratedConstantData) == 0x000180, "Wrong size on ABP_Manny::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_Manny::FAnimBlueprintGeneratedConstantData, __NameProperty_131) == 0x000004, "Member 'ABP_Manny::FAnimBlueprintGeneratedConstantData::__NameProperty_131' has a wrong offset!");
static_assert(offsetof(ABP_Manny::FAnimBlueprintGeneratedConstantData, __BlendSpace_132) == 0x000010, "Member 'ABP_Manny::FAnimBlueprintGeneratedConstantData::__BlendSpace_132' has a wrong offset!");
static_assert(offsetof(ABP_Manny::FAnimBlueprintGeneratedConstantData, __NameProperty_133) == 0x000018, "Member 'ABP_Manny::FAnimBlueprintGeneratedConstantData::__NameProperty_133' has a wrong offset!");
static_assert(offsetof(ABP_Manny::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_134) == 0x000020, "Member 'ABP_Manny::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_134' has a wrong offset!");
static_assert(offsetof(ABP_Manny::FAnimBlueprintGeneratedConstantData, __NameProperty_135) == 0x000028, "Member 'ABP_Manny::FAnimBlueprintGeneratedConstantData::__NameProperty_135' has a wrong offset!");
static_assert(offsetof(ABP_Manny::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_136) == 0x000030, "Member 'ABP_Manny::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_136' has a wrong offset!");
static_assert(offsetof(ABP_Manny::FAnimBlueprintGeneratedConstantData, __NameProperty_137) == 0x000038, "Member 'ABP_Manny::FAnimBlueprintGeneratedConstantData::__NameProperty_137' has a wrong offset!");
static_assert(offsetof(ABP_Manny::FAnimBlueprintGeneratedConstantData, __IntProperty_138) == 0x000040, "Member 'ABP_Manny::FAnimBlueprintGeneratedConstantData::__IntProperty_138' has a wrong offset!");
static_assert(offsetof(ABP_Manny::FAnimBlueprintGeneratedConstantData, __FloatProperty_139) == 0x000044, "Member 'ABP_Manny::FAnimBlueprintGeneratedConstantData::__FloatProperty_139' has a wrong offset!");
static_assert(offsetof(ABP_Manny::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_140) == 0x000048, "Member 'ABP_Manny::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_140' has a wrong offset!");
static_assert(offsetof(ABP_Manny::FAnimBlueprintGeneratedConstantData, __NameProperty_141) == 0x000050, "Member 'ABP_Manny::FAnimBlueprintGeneratedConstantData::__NameProperty_141' has a wrong offset!");
static_assert(offsetof(ABP_Manny::FAnimBlueprintGeneratedConstantData, __IntProperty_142) == 0x000058, "Member 'ABP_Manny::FAnimBlueprintGeneratedConstantData::__IntProperty_142' has a wrong offset!");
static_assert(offsetof(ABP_Manny::FAnimBlueprintGeneratedConstantData, __BoolProperty_143) == 0x00005C, "Member 'ABP_Manny::FAnimBlueprintGeneratedConstantData::__BoolProperty_143' has a wrong offset!");
static_assert(offsetof(ABP_Manny::FAnimBlueprintGeneratedConstantData, __FloatProperty_144) == 0x000060, "Member 'ABP_Manny::FAnimBlueprintGeneratedConstantData::__FloatProperty_144' has a wrong offset!");
static_assert(offsetof(ABP_Manny::FAnimBlueprintGeneratedConstantData, __StructProperty_145) == 0x000064, "Member 'ABP_Manny::FAnimBlueprintGeneratedConstantData::__StructProperty_145' has a wrong offset!");
static_assert(offsetof(ABP_Manny::FAnimBlueprintGeneratedConstantData, __FloatProperty_146) == 0x000090, "Member 'ABP_Manny::FAnimBlueprintGeneratedConstantData::__FloatProperty_146' has a wrong offset!");
static_assert(offsetof(ABP_Manny::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_147) == 0x000098, "Member 'ABP_Manny::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_147' has a wrong offset!");
static_assert(offsetof(ABP_Manny::FAnimBlueprintGeneratedConstantData, __BoolProperty_148) == 0x0000A0, "Member 'ABP_Manny::FAnimBlueprintGeneratedConstantData::__BoolProperty_148' has a wrong offset!");
static_assert(offsetof(ABP_Manny::FAnimBlueprintGeneratedConstantData, __EnumProperty_149) == 0x0000A1, "Member 'ABP_Manny::FAnimBlueprintGeneratedConstantData::__EnumProperty_149' has a wrong offset!");
static_assert(offsetof(ABP_Manny::FAnimBlueprintGeneratedConstantData, __ByteProperty_150) == 0x0000A2, "Member 'ABP_Manny::FAnimBlueprintGeneratedConstantData::__ByteProperty_150' has a wrong offset!");
static_assert(offsetof(ABP_Manny::FAnimBlueprintGeneratedConstantData, __NameProperty_151) == 0x0000A4, "Member 'ABP_Manny::FAnimBlueprintGeneratedConstantData::__NameProperty_151' has a wrong offset!");
static_assert(offsetof(ABP_Manny::FAnimBlueprintGeneratedConstantData, __IntProperty_152) == 0x0000AC, "Member 'ABP_Manny::FAnimBlueprintGeneratedConstantData::__IntProperty_152' has a wrong offset!");
static_assert(offsetof(ABP_Manny::FAnimBlueprintGeneratedConstantData, __NameProperty_153) == 0x0000B0, "Member 'ABP_Manny::FAnimBlueprintGeneratedConstantData::__NameProperty_153' has a wrong offset!");
static_assert(offsetof(ABP_Manny::FAnimBlueprintGeneratedConstantData, __NameProperty_154) == 0x0000B8, "Member 'ABP_Manny::FAnimBlueprintGeneratedConstantData::__NameProperty_154' has a wrong offset!");
static_assert(offsetof(ABP_Manny::FAnimBlueprintGeneratedConstantData, __IntProperty_155) == 0x0000C0, "Member 'ABP_Manny::FAnimBlueprintGeneratedConstantData::__IntProperty_155' has a wrong offset!");
static_assert(offsetof(ABP_Manny::FAnimBlueprintGeneratedConstantData, __StructProperty_156) == 0x0000C8, "Member 'ABP_Manny::FAnimBlueprintGeneratedConstantData::__StructProperty_156' has a wrong offset!");
static_assert(offsetof(ABP_Manny::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000E8, "Member 'ABP_Manny::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_Manny::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000168, "Member 'ABP_Manny::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

