#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AmmoSlot1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AmmoSlot1.AmmoSlot1_C
// 0x0040 (0x02D0 - 0x0290)
class UAmmoSlot1_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Cannonballbackground;                              // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CannonballCount;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CannonballIcon;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ATrainGusPlayer_C*                      Charref;                                           // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              HitmarkerDis;                                      // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	float HealthBar_Percentage();
	void GetText_0();
	class FText Get_CannonballCount_Text_0();
	void Get_kills(class FText* Result);
	void ExecuteUbergraph_AmmoSlot1(int32 EntryPoint);
	void Construct();
	struct FSlateBrush AmmoDoing();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AmmoSlot1_C">();
	}
	static class UAmmoSlot1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAmmoSlot1_C>();
	}
};
static_assert(alignof(UAmmoSlot1_C) == 0x000008, "Wrong alignment on UAmmoSlot1_C");
static_assert(sizeof(UAmmoSlot1_C) == 0x0002D0, "Wrong size on UAmmoSlot1_C");
static_assert(offsetof(UAmmoSlot1_C, UberGraphFrame) == 0x000290, "Member 'UAmmoSlot1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAmmoSlot1_C, Cannonballbackground) == 0x000298, "Member 'UAmmoSlot1_C::Cannonballbackground' has a wrong offset!");
static_assert(offsetof(UAmmoSlot1_C, CannonballCount) == 0x0002A0, "Member 'UAmmoSlot1_C::CannonballCount' has a wrong offset!");
static_assert(offsetof(UAmmoSlot1_C, CannonballIcon) == 0x0002A8, "Member 'UAmmoSlot1_C::CannonballIcon' has a wrong offset!");
static_assert(offsetof(UAmmoSlot1_C, Image_0) == 0x0002B0, "Member 'UAmmoSlot1_C::Image_0' has a wrong offset!");
static_assert(offsetof(UAmmoSlot1_C, Charref) == 0x0002B8, "Member 'UAmmoSlot1_C::Charref' has a wrong offset!");
static_assert(offsetof(UAmmoSlot1_C, HitmarkerDis) == 0x0002C0, "Member 'UAmmoSlot1_C::HitmarkerDis' has a wrong offset!");

}

