#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AmmoBox_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AmmoBox_BP.AmmoBox_BP_C
// 0x0030 (0x02A8 - 0x0278)
class AAmmoBox_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AmmoSound_Cue;                                     // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Ammobox;                                           // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Little_scale_anim_Alpha_9CCBBB634223F29B9C943C8EB904C569; // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Little_scale_anim__Direction_9CCBBB634223F29B9C943C8EB904C569; // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29D[0x3];                                      // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Little_scale_anim;                                 // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveAnyDamage(float Damage, const class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser);
	void On_Interact(class ATrainGusPlayer_C* User, bool Inside_);
	void Little_scale_anim__UpdateFunc();
	void Little_scale_anim__FinishedFunc();
	void ExecuteUbergraph_AmmoBox_BP(int32 EntryPoint);
	void Cannon_Interact();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AmmoBox_BP_C">();
	}
	static class AAmmoBox_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAmmoBox_BP_C>();
	}
};
static_assert(alignof(AAmmoBox_BP_C) == 0x000008, "Wrong alignment on AAmmoBox_BP_C");
static_assert(sizeof(AAmmoBox_BP_C) == 0x0002A8, "Wrong size on AAmmoBox_BP_C");
static_assert(offsetof(AAmmoBox_BP_C, UberGraphFrame) == 0x000278, "Member 'AAmmoBox_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAmmoBox_BP_C, Box) == 0x000280, "Member 'AAmmoBox_BP_C::Box' has a wrong offset!");
static_assert(offsetof(AAmmoBox_BP_C, AmmoSound_Cue) == 0x000288, "Member 'AAmmoBox_BP_C::AmmoSound_Cue' has a wrong offset!");
static_assert(offsetof(AAmmoBox_BP_C, Ammobox) == 0x000290, "Member 'AAmmoBox_BP_C::Ammobox' has a wrong offset!");
static_assert(offsetof(AAmmoBox_BP_C, Little_scale_anim_Alpha_9CCBBB634223F29B9C943C8EB904C569) == 0x000298, "Member 'AAmmoBox_BP_C::Little_scale_anim_Alpha_9CCBBB634223F29B9C943C8EB904C569' has a wrong offset!");
static_assert(offsetof(AAmmoBox_BP_C, Little_scale_anim__Direction_9CCBBB634223F29B9C943C8EB904C569) == 0x00029C, "Member 'AAmmoBox_BP_C::Little_scale_anim__Direction_9CCBBB634223F29B9C943C8EB904C569' has a wrong offset!");
static_assert(offsetof(AAmmoBox_BP_C, Little_scale_anim) == 0x0002A0, "Member 'AAmmoBox_BP_C::Little_scale_anim' has a wrong offset!");

}

