#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AppearanceMaster

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AppearanceMaster.AppearanceMaster_C.Get_CloseWindow_Visibility_0
// 0x0028 (0x0028 - 0x0000)
struct AppearanceMaster_C_Get_CloseWindow_Visibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AppearanceMaster_C_Get_CloseWindow_Visibility_0) == 0x000008, "Wrong alignment on AppearanceMaster_C_Get_CloseWindow_Visibility_0");
static_assert(sizeof(AppearanceMaster_C_Get_CloseWindow_Visibility_0) == 0x000028, "Wrong size on AppearanceMaster_C_Get_CloseWindow_Visibility_0");
static_assert(offsetof(AppearanceMaster_C_Get_CloseWindow_Visibility_0, ReturnValue) == 0x000000, "Member 'AppearanceMaster_C_Get_CloseWindow_Visibility_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(AppearanceMaster_C_Get_CloseWindow_Visibility_0, Temp_bool_Has_Been_Initd_Variable) == 0x000001, "Member 'AppearanceMaster_C_Get_CloseWindow_Visibility_0::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(AppearanceMaster_C_Get_CloseWindow_Visibility_0, Temp_bool_IsClosed_Variable) == 0x000002, "Member 'AppearanceMaster_C_Get_CloseWindow_Visibility_0::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(AppearanceMaster_C_Get_CloseWindow_Visibility_0, CallFunc_GetCurrentLevelName_ReturnValue) == 0x000008, "Member 'AppearanceMaster_C_Get_CloseWindow_Visibility_0::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AppearanceMaster_C_Get_CloseWindow_Visibility_0, CallFunc_Conv_StringToName_ReturnValue) == 0x000018, "Member 'AppearanceMaster_C_Get_CloseWindow_Visibility_0::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AppearanceMaster_C_Get_CloseWindow_Visibility_0, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000020, "Member 'AppearanceMaster_C_Get_CloseWindow_Visibility_0::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function AppearanceMaster.AppearanceMaster_C.ExecuteUbergraph_AppearanceMaster
// 0x0020 (0x0020 - 0x0000)
struct AppearanceMaster_C_ExecuteUbergraph_AppearanceMaster final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AppearanceMaster_C_ExecuteUbergraph_AppearanceMaster) == 0x000008, "Wrong alignment on AppearanceMaster_C_ExecuteUbergraph_AppearanceMaster");
static_assert(sizeof(AppearanceMaster_C_ExecuteUbergraph_AppearanceMaster) == 0x000020, "Wrong size on AppearanceMaster_C_ExecuteUbergraph_AppearanceMaster");
static_assert(offsetof(AppearanceMaster_C_ExecuteUbergraph_AppearanceMaster, EntryPoint) == 0x000000, "Member 'AppearanceMaster_C_ExecuteUbergraph_AppearanceMaster::EntryPoint' has a wrong offset!");
static_assert(offsetof(AppearanceMaster_C_ExecuteUbergraph_AppearanceMaster, CallFunc_GetPlayerState_ReturnValue) == 0x000008, "Member 'AppearanceMaster_C_ExecuteUbergraph_AppearanceMaster::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(AppearanceMaster_C_ExecuteUbergraph_AppearanceMaster, K2Node_DynamicCast_AsPlayer_State_BP) == 0x000010, "Member 'AppearanceMaster_C_ExecuteUbergraph_AppearanceMaster::K2Node_DynamicCast_AsPlayer_State_BP' has a wrong offset!");
static_assert(offsetof(AppearanceMaster_C_ExecuteUbergraph_AppearanceMaster, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AppearanceMaster_C_ExecuteUbergraph_AppearanceMaster::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

