#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bannana_Barrel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Bannana_Barrel.Bannana_Barrel_C
// 0x0028 (0x02A0 - 0x0278)
class ABannana_Barrel_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Bannana_s_in_barrel;                               // 0x0298(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ReceiveAnyDamage(float Damage, const class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser);
	void On_Interact(class ATrainGusPlayer_C* User, bool Inside_);
	void ExecuteUbergraph_Bannana_Barrel(int32 EntryPoint);
	void Cannon_Interact();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Bannana_Barrel_C">();
	}
	static class ABannana_Barrel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABannana_Barrel_C>();
	}
};
static_assert(alignof(ABannana_Barrel_C) == 0x000008, "Wrong alignment on ABannana_Barrel_C");
static_assert(sizeof(ABannana_Barrel_C) == 0x0002A0, "Wrong size on ABannana_Barrel_C");
static_assert(offsetof(ABannana_Barrel_C, UberGraphFrame) == 0x000278, "Member 'ABannana_Barrel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABannana_Barrel_C, Box) == 0x000280, "Member 'ABannana_Barrel_C::Box' has a wrong offset!");
static_assert(offsetof(ABannana_Barrel_C, StaticMesh) == 0x000288, "Member 'ABannana_Barrel_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABannana_Barrel_C, DefaultSceneRoot) == 0x000290, "Member 'ABannana_Barrel_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABannana_Barrel_C, Bannana_s_in_barrel) == 0x000298, "Member 'ABannana_Barrel_C::Bannana_s_in_barrel' has a wrong offset!");

}

