#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlacklisttextAdd

#include "Basic.hpp"


namespace SDK::Params
{

// Function BlacklisttextAdd.BlacklisttextAdd_C.ExecuteUbergraph_BlacklisttextAdd
// 0x0090 (0x0090 - 0x0000)
struct BlacklisttextAdd_C_ExecuteUbergraph_BlacklisttextAdd final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USavePlayerData_C*                      K2Node_DynamicCast_AsSave_Player_Data;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USavePlayerData_C*                      CallFunc_CreateSaveGameObject_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0078(0x0018)()
};
static_assert(alignof(BlacklisttextAdd_C_ExecuteUbergraph_BlacklisttextAdd) == 0x000008, "Wrong alignment on BlacklisttextAdd_C_ExecuteUbergraph_BlacklisttextAdd");
static_assert(sizeof(BlacklisttextAdd_C_ExecuteUbergraph_BlacklisttextAdd) == 0x000090, "Wrong size on BlacklisttextAdd_C_ExecuteUbergraph_BlacklisttextAdd");
static_assert(offsetof(BlacklisttextAdd_C_ExecuteUbergraph_BlacklisttextAdd, EntryPoint) == 0x000000, "Member 'BlacklisttextAdd_C_ExecuteUbergraph_BlacklisttextAdd::EntryPoint' has a wrong offset!");
static_assert(offsetof(BlacklisttextAdd_C_ExecuteUbergraph_BlacklisttextAdd, CallFunc_LoadGameFromSlot_ReturnValue) == 0x000008, "Member 'BlacklisttextAdd_C_ExecuteUbergraph_BlacklisttextAdd::CallFunc_LoadGameFromSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlacklisttextAdd_C_ExecuteUbergraph_BlacklisttextAdd, K2Node_DynamicCast_AsSave_Player_Data) == 0x000010, "Member 'BlacklisttextAdd_C_ExecuteUbergraph_BlacklisttextAdd::K2Node_DynamicCast_AsSave_Player_Data' has a wrong offset!");
static_assert(offsetof(BlacklisttextAdd_C_ExecuteUbergraph_BlacklisttextAdd, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BlacklisttextAdd_C_ExecuteUbergraph_BlacklisttextAdd::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BlacklisttextAdd_C_ExecuteUbergraph_BlacklisttextAdd, CallFunc_CreateSaveGameObject_ReturnValue) == 0x000020, "Member 'BlacklisttextAdd_C_ExecuteUbergraph_BlacklisttextAdd::CallFunc_CreateSaveGameObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlacklisttextAdd_C_ExecuteUbergraph_BlacklisttextAdd, CallFunc_SaveGameToSlot_ReturnValue) == 0x000028, "Member 'BlacklisttextAdd_C_ExecuteUbergraph_BlacklisttextAdd::CallFunc_SaveGameToSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlacklisttextAdd_C_ExecuteUbergraph_BlacklisttextAdd, CallFunc_Conv_BoolToString_ReturnValue) == 0x000030, "Member 'BlacklisttextAdd_C_ExecuteUbergraph_BlacklisttextAdd::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlacklisttextAdd_C_ExecuteUbergraph_BlacklisttextAdd, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'BlacklisttextAdd_C_ExecuteUbergraph_BlacklisttextAdd::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlacklisttextAdd_C_ExecuteUbergraph_BlacklisttextAdd, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000050, "Member 'BlacklisttextAdd_C_ExecuteUbergraph_BlacklisttextAdd::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BlacklisttextAdd_C_ExecuteUbergraph_BlacklisttextAdd, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'BlacklisttextAdd_C_ExecuteUbergraph_BlacklisttextAdd::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlacklisttextAdd_C_ExecuteUbergraph_BlacklisttextAdd, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000078, "Member 'BlacklisttextAdd_C_ExecuteUbergraph_BlacklisttextAdd::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");

}

