#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlacklisttextAdd

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BlacklisttextAdd.BlacklisttextAdd_C
// 0x0098 (0x0328 - 0x0290)
class UBlacklisttextAdd_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                AddButton;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayerID_text;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayerName_text;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 Name_0;                                            // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 PlayerId;                                          // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	TMap<class FString, class FString>            Blacklist_Local_;                                  // 0x02D0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USaveGame*                              BlackListSaveGame;                                 // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BlacklisttextAdd(int32 EntryPoint);
	void Construct();
	void BndEvt__Blacklisttext_Button_0_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BlacklisttextAdd_C">();
	}
	static class UBlacklisttextAdd_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlacklisttextAdd_C>();
	}
};
static_assert(alignof(UBlacklisttextAdd_C) == 0x000008, "Wrong alignment on UBlacklisttextAdd_C");
static_assert(sizeof(UBlacklisttextAdd_C) == 0x000328, "Wrong size on UBlacklisttextAdd_C");
static_assert(offsetof(UBlacklisttextAdd_C, UberGraphFrame) == 0x000290, "Member 'UBlacklisttextAdd_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBlacklisttextAdd_C, AddButton) == 0x000298, "Member 'UBlacklisttextAdd_C::AddButton' has a wrong offset!");
static_assert(offsetof(UBlacklisttextAdd_C, PlayerID_text) == 0x0002A0, "Member 'UBlacklisttextAdd_C::PlayerID_text' has a wrong offset!");
static_assert(offsetof(UBlacklisttextAdd_C, PlayerName_text) == 0x0002A8, "Member 'UBlacklisttextAdd_C::PlayerName_text' has a wrong offset!");
static_assert(offsetof(UBlacklisttextAdd_C, Name_0) == 0x0002B0, "Member 'UBlacklisttextAdd_C::Name_0' has a wrong offset!");
static_assert(offsetof(UBlacklisttextAdd_C, PlayerId) == 0x0002C0, "Member 'UBlacklisttextAdd_C::PlayerId' has a wrong offset!");
static_assert(offsetof(UBlacklisttextAdd_C, Blacklist_Local_) == 0x0002D0, "Member 'UBlacklisttextAdd_C::Blacklist_Local_' has a wrong offset!");
static_assert(offsetof(UBlacklisttextAdd_C, BlackListSaveGame) == 0x000320, "Member 'UBlacklisttextAdd_C::BlackListSaveGame' has a wrong offset!");

}

