#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlackListMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BlackListMenu.BlackListMenu_C
// 0x0070 (0x0300 - 0x0290)
class UBlackListMenu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UScrollBox*                             BlackListScrollBox;                                // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USaveGame*                              SaveOptions;                                       // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, class FString>            Blacklist;                                         // 0x02B0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BlackListMenu(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BlackListMenu_C">();
	}
	static class UBlackListMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlackListMenu_C>();
	}
};
static_assert(alignof(UBlackListMenu_C) == 0x000008, "Wrong alignment on UBlackListMenu_C");
static_assert(sizeof(UBlackListMenu_C) == 0x000300, "Wrong size on UBlackListMenu_C");
static_assert(offsetof(UBlackListMenu_C, UberGraphFrame) == 0x000290, "Member 'UBlackListMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBlackListMenu_C, BlackListScrollBox) == 0x000298, "Member 'UBlackListMenu_C::BlackListScrollBox' has a wrong offset!");
static_assert(offsetof(UBlackListMenu_C, Image_1) == 0x0002A0, "Member 'UBlackListMenu_C::Image_1' has a wrong offset!");
static_assert(offsetof(UBlackListMenu_C, SaveOptions) == 0x0002A8, "Member 'UBlackListMenu_C::SaveOptions' has a wrong offset!");
static_assert(offsetof(UBlackListMenu_C, Blacklist) == 0x0002B0, "Member 'UBlackListMenu_C::Blacklist' has a wrong offset!");

}

