#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlackListMenu

#include "Basic.hpp"

#include "AdvancedSessions_structs.hpp"


namespace SDK::Params
{

// Function BlackListMenu.BlackListMenu_C.ExecuteUbergraph_BlackListMenu
// 0x00D0 (0x00D0 - 0x0000)
struct BlackListMenu_C_ExecuteUbergraph_BlackListMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlacklisttextAdd_C*                    CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBPUniqueNetId                         CallFunc_GetUniqueNetID_UniqueNetId;               // 0x0018(0x0020)()
	class FString                                 CallFunc_UniqueNetIdToString_String;               // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBPUniqueNetId                         CallFunc_GetUniqueNetID_UniqueNetId_1;             // 0x0088(0x0020)()
	class FString                                 CallFunc_UniqueNetIdToString_String_1;             // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BlackListMenu_C_ExecuteUbergraph_BlackListMenu) == 0x000008, "Wrong alignment on BlackListMenu_C_ExecuteUbergraph_BlackListMenu");
static_assert(sizeof(BlackListMenu_C_ExecuteUbergraph_BlackListMenu) == 0x0000D0, "Wrong size on BlackListMenu_C_ExecuteUbergraph_BlackListMenu");
static_assert(offsetof(BlackListMenu_C_ExecuteUbergraph_BlackListMenu, EntryPoint) == 0x000000, "Member 'BlackListMenu_C_ExecuteUbergraph_BlackListMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(BlackListMenu_C_ExecuteUbergraph_BlackListMenu, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BlackListMenu_C_ExecuteUbergraph_BlackListMenu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlackListMenu_C_ExecuteUbergraph_BlackListMenu, CallFunc_Create_ReturnValue) == 0x000010, "Member 'BlackListMenu_C_ExecuteUbergraph_BlackListMenu::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlackListMenu_C_ExecuteUbergraph_BlackListMenu, CallFunc_GetUniqueNetID_UniqueNetId) == 0x000018, "Member 'BlackListMenu_C_ExecuteUbergraph_BlackListMenu::CallFunc_GetUniqueNetID_UniqueNetId' has a wrong offset!");
static_assert(offsetof(BlackListMenu_C_ExecuteUbergraph_BlackListMenu, CallFunc_UniqueNetIdToString_String) == 0x000038, "Member 'BlackListMenu_C_ExecuteUbergraph_BlackListMenu::CallFunc_UniqueNetIdToString_String' has a wrong offset!");
static_assert(offsetof(BlackListMenu_C_ExecuteUbergraph_BlackListMenu, Temp_int_Array_Index_Variable) == 0x000048, "Member 'BlackListMenu_C_ExecuteUbergraph_BlackListMenu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BlackListMenu_C_ExecuteUbergraph_BlackListMenu, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'BlackListMenu_C_ExecuteUbergraph_BlackListMenu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BlackListMenu_C_ExecuteUbergraph_BlackListMenu, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'BlackListMenu_C_ExecuteUbergraph_BlackListMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlackListMenu_C_ExecuteUbergraph_BlackListMenu, CallFunc_GetGameState_ReturnValue) == 0x000058, "Member 'BlackListMenu_C_ExecuteUbergraph_BlackListMenu::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlackListMenu_C_ExecuteUbergraph_BlackListMenu, CallFunc_AddChild_ReturnValue) == 0x000060, "Member 'BlackListMenu_C_ExecuteUbergraph_BlackListMenu::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlackListMenu_C_ExecuteUbergraph_BlackListMenu, CallFunc_Array_Get_Item) == 0x000068, "Member 'BlackListMenu_C_ExecuteUbergraph_BlackListMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BlackListMenu_C_ExecuteUbergraph_BlackListMenu, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'BlackListMenu_C_ExecuteUbergraph_BlackListMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlackListMenu_C_ExecuteUbergraph_BlackListMenu, CallFunc_GetPlayerController_ReturnValue_1) == 0x000078, "Member 'BlackListMenu_C_ExecuteUbergraph_BlackListMenu::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BlackListMenu_C_ExecuteUbergraph_BlackListMenu, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'BlackListMenu_C_ExecuteUbergraph_BlackListMenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlackListMenu_C_ExecuteUbergraph_BlackListMenu, CallFunc_GetUniqueNetID_UniqueNetId_1) == 0x000088, "Member 'BlackListMenu_C_ExecuteUbergraph_BlackListMenu::CallFunc_GetUniqueNetID_UniqueNetId_1' has a wrong offset!");
static_assert(offsetof(BlackListMenu_C_ExecuteUbergraph_BlackListMenu, CallFunc_UniqueNetIdToString_String_1) == 0x0000A8, "Member 'BlackListMenu_C_ExecuteUbergraph_BlackListMenu::CallFunc_UniqueNetIdToString_String_1' has a wrong offset!");
static_assert(offsetof(BlackListMenu_C_ExecuteUbergraph_BlackListMenu, CallFunc_GetPlayerName_ReturnValue) == 0x0000B8, "Member 'BlackListMenu_C_ExecuteUbergraph_BlackListMenu::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlackListMenu_C_ExecuteUbergraph_BlackListMenu, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x0000C8, "Member 'BlackListMenu_C_ExecuteUbergraph_BlackListMenu::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

}

