#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Blue_Base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Blue_Base.Blue_Base_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct Blue_Base_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Blue_Base_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on Blue_Base_C_ReceiveActorBeginOverlap");
static_assert(sizeof(Blue_Base_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on Blue_Base_C_ReceiveActorBeginOverlap");
static_assert(offsetof(Blue_Base_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'Blue_Base_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function Blue_Base.Blue_Base_C.ExecuteUbergraph_Blue_Base
// 0x00C0 (0x00C0 - 0x0000)
struct Blue_Base_C_ExecuteUbergraph_Blue_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0060)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACTF_Flag_Red_Home_C*                   CallFunc_FinishSpawningActor_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player_1;           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBP_C*                         K2Node_DynamicCast_AsGame_State_BP;                // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Blue_Base_C_ExecuteUbergraph_Blue_Base) == 0x000010, "Wrong alignment on Blue_Base_C_ExecuteUbergraph_Blue_Base");
static_assert(sizeof(Blue_Base_C_ExecuteUbergraph_Blue_Base) == 0x0000C0, "Wrong size on Blue_Base_C_ExecuteUbergraph_Blue_Base");
static_assert(offsetof(Blue_Base_C_ExecuteUbergraph_Blue_Base, EntryPoint) == 0x000000, "Member 'Blue_Base_C_ExecuteUbergraph_Blue_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(Blue_Base_C_ExecuteUbergraph_Blue_Base, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'Blue_Base_C_ExecuteUbergraph_Blue_Base::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Blue_Base_C_ExecuteUbergraph_Blue_Base, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000070, "Member 'Blue_Base_C_ExecuteUbergraph_Blue_Base::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Blue_Base_C_ExecuteUbergraph_Blue_Base, K2Node_Event_OtherActor) == 0x000078, "Member 'Blue_Base_C_ExecuteUbergraph_Blue_Base::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(Blue_Base_C_ExecuteUbergraph_Blue_Base, CallFunc_FinishSpawningActor_ReturnValue) == 0x000080, "Member 'Blue_Base_C_ExecuteUbergraph_Blue_Base::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Blue_Base_C_ExecuteUbergraph_Blue_Base, K2Node_DynamicCast_AsTrain_Gus_Player) == 0x000088, "Member 'Blue_Base_C_ExecuteUbergraph_Blue_Base::K2Node_DynamicCast_AsTrain_Gus_Player' has a wrong offset!");
static_assert(offsetof(Blue_Base_C_ExecuteUbergraph_Blue_Base, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'Blue_Base_C_ExecuteUbergraph_Blue_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Blue_Base_C_ExecuteUbergraph_Blue_Base, K2Node_DynamicCast_AsTrain_Gus_Player_1) == 0x000098, "Member 'Blue_Base_C_ExecuteUbergraph_Blue_Base::K2Node_DynamicCast_AsTrain_Gus_Player_1' has a wrong offset!");
static_assert(offsetof(Blue_Base_C_ExecuteUbergraph_Blue_Base, K2Node_DynamicCast_bSuccess_1) == 0x0000A0, "Member 'Blue_Base_C_ExecuteUbergraph_Blue_Base::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Blue_Base_C_ExecuteUbergraph_Blue_Base, CallFunc_GetGameState_ReturnValue) == 0x0000A8, "Member 'Blue_Base_C_ExecuteUbergraph_Blue_Base::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Blue_Base_C_ExecuteUbergraph_Blue_Base, K2Node_DynamicCast_AsGame_State_BP) == 0x0000B0, "Member 'Blue_Base_C_ExecuteUbergraph_Blue_Base::K2Node_DynamicCast_AsGame_State_BP' has a wrong offset!");
static_assert(offsetof(Blue_Base_C_ExecuteUbergraph_Blue_Base, K2Node_DynamicCast_bSuccess_2) == 0x0000B8, "Member 'Blue_Base_C_ExecuteUbergraph_Blue_Base::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Blue_Base_C_ExecuteUbergraph_Blue_Base, CallFunc_Add_IntInt_ReturnValue) == 0x0000BC, "Member 'Blue_Base_C_ExecuteUbergraph_Blue_Base::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

