#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlunderbombParticleSpawner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BlunderbombParticleSpawner.BlunderbombParticleSpawner_C
// 0x0020 (0x0298 - 0x0278)
class ABlunderbombParticleSpawner_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Explosion_Sound;                                   // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      BlunderbombParticle;                               // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BlunderbombParticleSpawner(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BlunderbombParticleSpawner_C">();
	}
	static class ABlunderbombParticleSpawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABlunderbombParticleSpawner_C>();
	}
};
static_assert(alignof(ABlunderbombParticleSpawner_C) == 0x000008, "Wrong alignment on ABlunderbombParticleSpawner_C");
static_assert(sizeof(ABlunderbombParticleSpawner_C) == 0x000298, "Wrong size on ABlunderbombParticleSpawner_C");
static_assert(offsetof(ABlunderbombParticleSpawner_C, UberGraphFrame) == 0x000278, "Member 'ABlunderbombParticleSpawner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABlunderbombParticleSpawner_C, Explosion_Sound) == 0x000280, "Member 'ABlunderbombParticleSpawner_C::Explosion_Sound' has a wrong offset!");
static_assert(offsetof(ABlunderbombParticleSpawner_C, BlunderbombParticle) == 0x000288, "Member 'ABlunderbombParticleSpawner_C::BlunderbombParticle' has a wrong offset!");
static_assert(offsetof(ABlunderbombParticleSpawner_C, DefaultSceneRoot) == 0x000290, "Member 'ABlunderbombParticleSpawner_C::DefaultSceneRoot' has a wrong offset!");

}

