#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Blunderbomb_Client

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Blunderbomb_Client.Blunderbomb_Client_C.ReceiveHit
// 0x0150 (0x0150 - 0x0000)
struct Blunderbomb_Client_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfMoved;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0038(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0050(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0068(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Blunderbomb_Client_C_ReceiveHit) == 0x000008, "Wrong alignment on Blunderbomb_Client_C_ReceiveHit");
static_assert(sizeof(Blunderbomb_Client_C_ReceiveHit) == 0x000150, "Wrong size on Blunderbomb_Client_C_ReceiveHit");
static_assert(offsetof(Blunderbomb_Client_C_ReceiveHit, MyComp) == 0x000000, "Member 'Blunderbomb_Client_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ReceiveHit, Other) == 0x000008, "Member 'Blunderbomb_Client_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ReceiveHit, OtherComp) == 0x000010, "Member 'Blunderbomb_Client_C_ReceiveHit::OtherComp' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ReceiveHit, bSelfMoved) == 0x000018, "Member 'Blunderbomb_Client_C_ReceiveHit::bSelfMoved' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ReceiveHit, HitLocation) == 0x000020, "Member 'Blunderbomb_Client_C_ReceiveHit::HitLocation' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ReceiveHit, HitNormal) == 0x000038, "Member 'Blunderbomb_Client_C_ReceiveHit::HitNormal' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ReceiveHit, NormalImpulse) == 0x000050, "Member 'Blunderbomb_Client_C_ReceiveHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ReceiveHit, Hit) == 0x000068, "Member 'Blunderbomb_Client_C_ReceiveHit::Hit' has a wrong offset!");

// Function Blunderbomb_Client.Blunderbomb_Client_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct Blunderbomb_Client_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Blunderbomb_Client_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on Blunderbomb_Client_C_ReceiveActorBeginOverlap");
static_assert(sizeof(Blunderbomb_Client_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on Blunderbomb_Client_C_ReceiveActorBeginOverlap");
static_assert(offsetof(Blunderbomb_Client_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'Blunderbomb_Client_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function Blunderbomb_Client.Blunderbomb_Client_C.ExecuteUbergraph_Blunderbomb_Client
// 0x03E0 (0x03E0 - 0x0000)
struct Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0088(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetInstigatorController_ReturnValue;      // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0190(0x0060)(IsPlainOldData, NoDestructor)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player;             // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player_1;           // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23A[0x6];                                      // 0x023A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player_2;           // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player_3;           // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26A[0x6];                                      // 0x026A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_3;                   // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AExplosion_C*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_4;                   // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ApplyDamage_ReturnValue;                  // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player_4;           // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_5;                   // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Spawn_Transform_Location;       // 0x02D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Owner;                          // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_Instigator;                     // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player_5;           // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0xF];                                      // 0x0301(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0310(0x0060)(IsPlainOldData, NoDestructor)
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player_6;           // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AExplosion_C*                           CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_6;                   // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_7;                   // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player_7;           // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player_8;           // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B9[0x7];                                      // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerControllerBP_C*                  K2Node_DynamicCast_AsPlayer_Controller_BP;         // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client) == 0x000010, "Wrong alignment on Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client");
static_assert(sizeof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client) == 0x0003E0, "Wrong size on Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, EntryPoint) == 0x000000, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::EntryPoint' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, K2Node_Event_MyComp) == 0x000020, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, K2Node_Event_Other) == 0x000028, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, K2Node_Event_OtherComp) == 0x000030, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, K2Node_Event_bSelfMoved) == 0x000038, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, K2Node_Event_HitLocation) == 0x000040, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, K2Node_Event_HitNormal) == 0x000058, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, K2Node_Event_NormalImpulse) == 0x000070, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, K2Node_Event_Hit) == 0x000088, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000170, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, CallFunc_GetInstigatorController_ReturnValue) == 0x000188, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::CallFunc_GetInstigatorController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, CallFunc_MakeTransform_ReturnValue) == 0x000190, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, K2Node_DynamicCast_AsPlayer_Controller) == 0x0001F0, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, K2Node_DynamicCast_bSuccess) == 0x0001F8, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, K2Node_Event_OtherActor) == 0x000200, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, K2Node_DynamicCast_AsTrain_Gus_Player) == 0x000208, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::K2Node_DynamicCast_AsTrain_Gus_Player' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, K2Node_DynamicCast_bSuccess_1) == 0x000210, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, CallFunc_GetOwner_ReturnValue) == 0x000218, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000220, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, CallFunc_GetOwner_ReturnValue_1) == 0x000228, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, K2Node_DynamicCast_AsTrain_Gus_Player_1) == 0x000230, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::K2Node_DynamicCast_AsTrain_Gus_Player_1' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, K2Node_DynamicCast_bSuccess_2) == 0x000238, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, CallFunc_HasAuthority_ReturnValue) == 0x000239, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, K2Node_DynamicCast_AsTrain_Gus_Player_2) == 0x000240, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::K2Node_DynamicCast_AsTrain_Gus_Player_2' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, K2Node_DynamicCast_bSuccess_3) == 0x000248, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, K2Node_DynamicCast_AsTrain_Gus_Player_3) == 0x000250, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::K2Node_DynamicCast_AsTrain_Gus_Player_3' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, K2Node_DynamicCast_bSuccess_4) == 0x000258, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, CallFunc_GetOwner_ReturnValue_2) == 0x000260, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000268, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000269, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, CallFunc_GetOwner_ReturnValue_3) == 0x000270, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::CallFunc_GetOwner_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, CallFunc_GetPlayerController_ReturnValue) == 0x000278, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000280, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, CallFunc_GetInstigator_ReturnValue) == 0x000288, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, CallFunc_FinishSpawningActor_ReturnValue) == 0x000290, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, K2Node_CustomEvent_DamagedActor) == 0x000298, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, K2Node_CustomEvent_DamageCauser) == 0x0002A0, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, CallFunc_GetOwner_ReturnValue_4) == 0x0002A8, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::CallFunc_GetOwner_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, CallFunc_ApplyDamage_ReturnValue) == 0x0002B0, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::CallFunc_ApplyDamage_ReturnValue' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, K2Node_DynamicCast_AsTrain_Gus_Player_4) == 0x0002B8, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::K2Node_DynamicCast_AsTrain_Gus_Player_4' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, K2Node_DynamicCast_bSuccess_5) == 0x0002C0, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, CallFunc_GetOwner_ReturnValue_5) == 0x0002C8, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::CallFunc_GetOwner_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, K2Node_CustomEvent_Spawn_Transform_Location) == 0x0002D0, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::K2Node_CustomEvent_Spawn_Transform_Location' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, K2Node_CustomEvent_Owner) == 0x0002E8, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::K2Node_CustomEvent_Owner' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, K2Node_CustomEvent_Instigator) == 0x0002F0, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::K2Node_CustomEvent_Instigator' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, K2Node_DynamicCast_AsTrain_Gus_Player_5) == 0x0002F8, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::K2Node_DynamicCast_AsTrain_Gus_Player_5' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, K2Node_DynamicCast_bSuccess_6) == 0x000300, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, CallFunc_MakeTransform_ReturnValue_1) == 0x000310, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, K2Node_DynamicCast_AsTrain_Gus_Player_6) == 0x000370, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::K2Node_DynamicCast_AsTrain_Gus_Player_6' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, K2Node_DynamicCast_bSuccess_7) == 0x000378, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000380, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000388, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, CallFunc_GetOwner_ReturnValue_6) == 0x000390, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::CallFunc_GetOwner_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, CallFunc_GetOwner_ReturnValue_7) == 0x000398, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::CallFunc_GetOwner_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, K2Node_DynamicCast_AsTrain_Gus_Player_7) == 0x0003A0, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::K2Node_DynamicCast_AsTrain_Gus_Player_7' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, K2Node_DynamicCast_bSuccess_8) == 0x0003A8, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, K2Node_DynamicCast_AsTrain_Gus_Player_8) == 0x0003B0, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::K2Node_DynamicCast_AsTrain_Gus_Player_8' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, K2Node_DynamicCast_bSuccess_9) == 0x0003B8, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, CallFunc_GetPlayerController_ReturnValue_1) == 0x0003C0, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, K2Node_DynamicCast_AsPlayer_Controller_BP) == 0x0003C8, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::K2Node_DynamicCast_AsPlayer_Controller_BP' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client, K2Node_DynamicCast_bSuccess_10) == 0x0003D0, "Member 'Blunderbomb_Client_C_ExecuteUbergraph_Blunderbomb_Client::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");

// Function Blunderbomb_Client.Blunderbomb_Client_C.Spawn Explosion
// 0x0028 (0x0028 - 0x0000)
struct Blunderbomb_Client_C_Spawn_Explosion final
{
public:
	struct FVector                                Spawn_Transform_Location;                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Owner_0;                                           // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  Instigator_0;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(Blunderbomb_Client_C_Spawn_Explosion) == 0x000008, "Wrong alignment on Blunderbomb_Client_C_Spawn_Explosion");
static_assert(sizeof(Blunderbomb_Client_C_Spawn_Explosion) == 0x000028, "Wrong size on Blunderbomb_Client_C_Spawn_Explosion");
static_assert(offsetof(Blunderbomb_Client_C_Spawn_Explosion, Spawn_Transform_Location) == 0x000000, "Member 'Blunderbomb_Client_C_Spawn_Explosion::Spawn_Transform_Location' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_Spawn_Explosion, Owner_0) == 0x000018, "Member 'Blunderbomb_Client_C_Spawn_Explosion::Owner_0' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_Spawn_Explosion, Instigator_0) == 0x000020, "Member 'Blunderbomb_Client_C_Spawn_Explosion::Instigator_0' has a wrong offset!");

// Function Blunderbomb_Client.Blunderbomb_Client_C.Apply Damage Server
// 0x0010 (0x0010 - 0x0000)
struct Blunderbomb_Client_C_Apply_Damage_Server final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Blunderbomb_Client_C_Apply_Damage_Server) == 0x000008, "Wrong alignment on Blunderbomb_Client_C_Apply_Damage_Server");
static_assert(sizeof(Blunderbomb_Client_C_Apply_Damage_Server) == 0x000010, "Wrong size on Blunderbomb_Client_C_Apply_Damage_Server");
static_assert(offsetof(Blunderbomb_Client_C_Apply_Damage_Server, DamagedActor) == 0x000000, "Member 'Blunderbomb_Client_C_Apply_Damage_Server::DamagedActor' has a wrong offset!");
static_assert(offsetof(Blunderbomb_Client_C_Apply_Damage_Server, DamageCauser) == 0x000008, "Member 'Blunderbomb_Client_C_Apply_Damage_Server::DamageCauser' has a wrong offset!");

}

