#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlunderProjectile_Server

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BlunderProjectile_Server.BlunderProjectile_Server_C
// 0x01A8 (0x0420 - 0x0278)
class ABlunderProjectile_Server_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      BulletWithTrail;                                   // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   cannonball;                                        // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UProjectileMovementComponent*           Projectile;                                        // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       CollisionComponent;                                // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A8[0x8];                                      // 0x02A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Spawn_Transform;                                   // 0x02B0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Condition;                                         // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHUDgus_C*                              HudRef;                                            // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Other_Team;                                        // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Owner_Team;                                        // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ImDone;                                            // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             Hit_Result;                                        // 0x0338(0x00E8)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)

public:
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ReceiveBeginPlay();
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ExecuteUbergraph_BlunderProjectile_Server(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BlunderProjectile_Server_C">();
	}
	static class ABlunderProjectile_Server_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABlunderProjectile_Server_C>();
	}
};
static_assert(alignof(ABlunderProjectile_Server_C) == 0x000010, "Wrong alignment on ABlunderProjectile_Server_C");
static_assert(sizeof(ABlunderProjectile_Server_C) == 0x000420, "Wrong size on ABlunderProjectile_Server_C");
static_assert(offsetof(ABlunderProjectile_Server_C, UberGraphFrame) == 0x000278, "Member 'ABlunderProjectile_Server_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABlunderProjectile_Server_C, BulletWithTrail) == 0x000280, "Member 'ABlunderProjectile_Server_C::BulletWithTrail' has a wrong offset!");
static_assert(offsetof(ABlunderProjectile_Server_C, Arrow) == 0x000288, "Member 'ABlunderProjectile_Server_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABlunderProjectile_Server_C, cannonball) == 0x000290, "Member 'ABlunderProjectile_Server_C::cannonball' has a wrong offset!");
static_assert(offsetof(ABlunderProjectile_Server_C, Projectile) == 0x000298, "Member 'ABlunderProjectile_Server_C::Projectile' has a wrong offset!");
static_assert(offsetof(ABlunderProjectile_Server_C, CollisionComponent) == 0x0002A0, "Member 'ABlunderProjectile_Server_C::CollisionComponent' has a wrong offset!");
static_assert(offsetof(ABlunderProjectile_Server_C, Spawn_Transform) == 0x0002B0, "Member 'ABlunderProjectile_Server_C::Spawn_Transform' has a wrong offset!");
static_assert(offsetof(ABlunderProjectile_Server_C, Condition) == 0x000310, "Member 'ABlunderProjectile_Server_C::Condition' has a wrong offset!");
static_assert(offsetof(ABlunderProjectile_Server_C, HudRef) == 0x000318, "Member 'ABlunderProjectile_Server_C::HudRef' has a wrong offset!");
static_assert(offsetof(ABlunderProjectile_Server_C, Other_Team) == 0x000320, "Member 'ABlunderProjectile_Server_C::Other_Team' has a wrong offset!");
static_assert(offsetof(ABlunderProjectile_Server_C, Owner_Team) == 0x000328, "Member 'ABlunderProjectile_Server_C::Owner_Team' has a wrong offset!");
static_assert(offsetof(ABlunderProjectile_Server_C, ImDone) == 0x000330, "Member 'ABlunderProjectile_Server_C::ImDone' has a wrong offset!");
static_assert(offsetof(ABlunderProjectile_Server_C, Hit_Result) == 0x000338, "Member 'ABlunderProjectile_Server_C::Hit_Result' has a wrong offset!");

}

