#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Blunderbomb_widget

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Blunderbomb_widget.Blunderbomb_widget_C.GetText_0
// 0x0030 (0x0030 - 0x0000)
struct Blunderbomb_widget_C_GetText_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0018)()
};
static_assert(alignof(Blunderbomb_widget_C_GetText_0) == 0x000008, "Wrong alignment on Blunderbomb_widget_C_GetText_0");
static_assert(sizeof(Blunderbomb_widget_C_GetText_0) == 0x000030, "Wrong size on Blunderbomb_widget_C_GetText_0");
static_assert(offsetof(Blunderbomb_widget_C_GetText_0, ReturnValue) == 0x000000, "Member 'Blunderbomb_widget_C_GetText_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(Blunderbomb_widget_C_GetText_0, CallFunc_Conv_IntToText_ReturnValue) == 0x000018, "Member 'Blunderbomb_widget_C_GetText_0::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function Blunderbomb_widget.Blunderbomb_widget_C.Get Interact key
// 0x0070 (0x0070 - 0x0000)
struct Blunderbomb_widget_C_Get_Interact_key final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputActionKeyMapping>         CallFunc_GetActionMappingByName_OutMappings;       // 0x0020(0x0010)(ReferenceParm)
	struct FInputActionKeyMapping                 CallFunc_Array_Get_Item;                           // 0x0030(0x0028)()
	class FText                                   CallFunc_Key_GetDisplayName_ReturnValue;           // 0x0058(0x0018)()
};
static_assert(alignof(Blunderbomb_widget_C_Get_Interact_key) == 0x000008, "Wrong alignment on Blunderbomb_widget_C_Get_Interact_key");
static_assert(sizeof(Blunderbomb_widget_C_Get_Interact_key) == 0x000070, "Wrong size on Blunderbomb_widget_C_Get_Interact_key");
static_assert(offsetof(Blunderbomb_widget_C_Get_Interact_key, ReturnValue) == 0x000000, "Member 'Blunderbomb_widget_C_Get_Interact_key::ReturnValue' has a wrong offset!");
static_assert(offsetof(Blunderbomb_widget_C_Get_Interact_key, CallFunc_GetInputSettings_ReturnValue) == 0x000018, "Member 'Blunderbomb_widget_C_Get_Interact_key::CallFunc_GetInputSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(Blunderbomb_widget_C_Get_Interact_key, CallFunc_GetActionMappingByName_OutMappings) == 0x000020, "Member 'Blunderbomb_widget_C_Get_Interact_key::CallFunc_GetActionMappingByName_OutMappings' has a wrong offset!");
static_assert(offsetof(Blunderbomb_widget_C_Get_Interact_key, CallFunc_Array_Get_Item) == 0x000030, "Member 'Blunderbomb_widget_C_Get_Interact_key::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Blunderbomb_widget_C_Get_Interact_key, CallFunc_Key_GetDisplayName_ReturnValue) == 0x000058, "Member 'Blunderbomb_widget_C_Get_Interact_key::CallFunc_Key_GetDisplayName_ReturnValue' has a wrong offset!");

// Function Blunderbomb_widget.Blunderbomb_widget_C.ExecuteUbergraph_Blunderbomb_widget
// 0x0004 (0x0004 - 0x0000)
struct Blunderbomb_widget_C_ExecuteUbergraph_Blunderbomb_widget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Blunderbomb_widget_C_ExecuteUbergraph_Blunderbomb_widget) == 0x000004, "Wrong alignment on Blunderbomb_widget_C_ExecuteUbergraph_Blunderbomb_widget");
static_assert(sizeof(Blunderbomb_widget_C_ExecuteUbergraph_Blunderbomb_widget) == 0x000004, "Wrong size on Blunderbomb_widget_C_ExecuteUbergraph_Blunderbomb_widget");
static_assert(offsetof(Blunderbomb_widget_C_ExecuteUbergraph_Blunderbomb_widget, EntryPoint) == 0x000000, "Member 'Blunderbomb_widget_C_ExecuteUbergraph_Blunderbomb_widget::EntryPoint' has a wrong offset!");

}

