#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Blunderbomb_Client

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Blunderbomb_Client.Blunderbomb_Client_C
// 0x00B8 (0x0330 - 0x0278)
class ABlunderbomb_Client_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URotatingMovementComponent*             RotatingMovement;                                  // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UProjectileMovementComponent*           ProjectileMovement;                                // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URadialForceComponent*                  RadialForce;                                       // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   cannonball;                                        // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       CollisionComponent;                                // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Spawn_Transform;                                   // 0x02B0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Condition;                                         // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHUDgus_C*                              HudRef;                                            // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Other_Team;                                        // 0x0320(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Owner_Team;                                        // 0x0328(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ReceiveBeginPlay();
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ExecuteUbergraph_Blunderbomb_Client(int32 EntryPoint);
	void Spawn_Explosion(const struct FVector& Spawn_Transform_Location, class AActor* Owner_0, class APawn* Instigator_0);
	void Apply_Damage_Server(class AActor* DamagedActor, class AActor* DamageCauser);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Blunderbomb_Client_C">();
	}
	static class ABlunderbomb_Client_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABlunderbomb_Client_C>();
	}
};
static_assert(alignof(ABlunderbomb_Client_C) == 0x000010, "Wrong alignment on ABlunderbomb_Client_C");
static_assert(sizeof(ABlunderbomb_Client_C) == 0x000330, "Wrong size on ABlunderbomb_Client_C");
static_assert(offsetof(ABlunderbomb_Client_C, UberGraphFrame) == 0x000278, "Member 'ABlunderbomb_Client_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABlunderbomb_Client_C, RotatingMovement) == 0x000280, "Member 'ABlunderbomb_Client_C::RotatingMovement' has a wrong offset!");
static_assert(offsetof(ABlunderbomb_Client_C, ProjectileMovement) == 0x000288, "Member 'ABlunderbomb_Client_C::ProjectileMovement' has a wrong offset!");
static_assert(offsetof(ABlunderbomb_Client_C, RadialForce) == 0x000290, "Member 'ABlunderbomb_Client_C::RadialForce' has a wrong offset!");
static_assert(offsetof(ABlunderbomb_Client_C, Arrow) == 0x000298, "Member 'ABlunderbomb_Client_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABlunderbomb_Client_C, cannonball) == 0x0002A0, "Member 'ABlunderbomb_Client_C::cannonball' has a wrong offset!");
static_assert(offsetof(ABlunderbomb_Client_C, CollisionComponent) == 0x0002A8, "Member 'ABlunderbomb_Client_C::CollisionComponent' has a wrong offset!");
static_assert(offsetof(ABlunderbomb_Client_C, Spawn_Transform) == 0x0002B0, "Member 'ABlunderbomb_Client_C::Spawn_Transform' has a wrong offset!");
static_assert(offsetof(ABlunderbomb_Client_C, Condition) == 0x000310, "Member 'ABlunderbomb_Client_C::Condition' has a wrong offset!");
static_assert(offsetof(ABlunderbomb_Client_C, HudRef) == 0x000318, "Member 'ABlunderbomb_Client_C::HudRef' has a wrong offset!");
static_assert(offsetof(ABlunderbomb_Client_C, Other_Team) == 0x000320, "Member 'ABlunderbomb_Client_C::Other_Team' has a wrong offset!");
static_assert(offsetof(ABlunderbomb_Client_C, Owner_Team) == 0x000328, "Member 'ABlunderbomb_Client_C::Owner_Team' has a wrong offset!");

}

