#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Blunderbomb_widget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Blunderbomb_widget.Blunderbomb_widget_C
// 0x0040 (0x02D0 - 0x0290)
class UBlunderbomb_widget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_0;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                InteractkeyShower;                                 // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x02B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_0;                                       // 0x02B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABlunderbomb_Barrel_C*                  BarrelRef;                                         // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Blunder_s_in_barrel;                               // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	class FText GetText_0();
	class FText Get_Interact_key();
	void ExecuteUbergraph_Blunderbomb_widget(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Blunderbomb_widget_C">();
	}
	static class UBlunderbomb_widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlunderbomb_widget_C>();
	}
};
static_assert(alignof(UBlunderbomb_widget_C) == 0x000008, "Wrong alignment on UBlunderbomb_widget_C");
static_assert(sizeof(UBlunderbomb_widget_C) == 0x0002D0, "Wrong size on UBlunderbomb_widget_C");
static_assert(offsetof(UBlunderbomb_widget_C, UberGraphFrame) == 0x000290, "Member 'UBlunderbomb_widget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBlunderbomb_widget_C, Button_0) == 0x000298, "Member 'UBlunderbomb_widget_C::Button_0' has a wrong offset!");
static_assert(offsetof(UBlunderbomb_widget_C, Image_0) == 0x0002A0, "Member 'UBlunderbomb_widget_C::Image_0' has a wrong offset!");
static_assert(offsetof(UBlunderbomb_widget_C, InteractkeyShower) == 0x0002A8, "Member 'UBlunderbomb_widget_C::InteractkeyShower' has a wrong offset!");
static_assert(offsetof(UBlunderbomb_widget_C, TextBlock) == 0x0002B0, "Member 'UBlunderbomb_widget_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UBlunderbomb_widget_C, TextBlock_0) == 0x0002B8, "Member 'UBlunderbomb_widget_C::TextBlock_0' has a wrong offset!");
static_assert(offsetof(UBlunderbomb_widget_C, BarrelRef) == 0x0002C0, "Member 'UBlunderbomb_widget_C::BarrelRef' has a wrong offset!");
static_assert(offsetof(UBlunderbomb_widget_C, Blunder_s_in_barrel) == 0x0002C8, "Member 'UBlunderbomb_widget_C::Blunder_s_in_barrel' has a wrong offset!");

}

