#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BorderSpectate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BorderSpectate.BorderSpectate_C
// 0x0030 (0x02C0 - 0x0290)
class UBorderSpectate_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       BarAnim;                                           // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Condition;                                         // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATrainGusPlayer_C*                      Traingusref;                                       // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void ExecuteUbergraph_BorderSpectate(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BorderSpectate_C">();
	}
	static class UBorderSpectate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBorderSpectate_C>();
	}
};
static_assert(alignof(UBorderSpectate_C) == 0x000008, "Wrong alignment on UBorderSpectate_C");
static_assert(sizeof(UBorderSpectate_C) == 0x0002C0, "Wrong size on UBorderSpectate_C");
static_assert(offsetof(UBorderSpectate_C, UberGraphFrame) == 0x000290, "Member 'UBorderSpectate_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBorderSpectate_C, BarAnim) == 0x000298, "Member 'UBorderSpectate_C::BarAnim' has a wrong offset!");
static_assert(offsetof(UBorderSpectate_C, Image) == 0x0002A0, "Member 'UBorderSpectate_C::Image' has a wrong offset!");
static_assert(offsetof(UBorderSpectate_C, Image_0) == 0x0002A8, "Member 'UBorderSpectate_C::Image_0' has a wrong offset!");
static_assert(offsetof(UBorderSpectate_C, Condition) == 0x0002B0, "Member 'UBorderSpectate_C::Condition' has a wrong offset!");
static_assert(offsetof(UBorderSpectate_C, Traingusref) == 0x0002B8, "Member 'UBorderSpectate_C::Traingusref' has a wrong offset!");

}

