#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BorderSpectate

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BorderSpectate.BorderSpectate_C.Tick
// 0x0048 (0x0048 - 0x0000)
struct BorderSpectate_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BorderSpectate_C_Tick) == 0x000008, "Wrong alignment on BorderSpectate_C_Tick");
static_assert(sizeof(BorderSpectate_C_Tick) == 0x000048, "Wrong size on BorderSpectate_C_Tick");
static_assert(offsetof(BorderSpectate_C_Tick, MyGeometry) == 0x000000, "Member 'BorderSpectate_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(BorderSpectate_C_Tick, InDeltaTime) == 0x000040, "Member 'BorderSpectate_C_Tick::InDeltaTime' has a wrong offset!");

// Function BorderSpectate.BorderSpectate_C.ExecuteUbergraph_BorderSpectate
// 0x0088 (0x0088 - 0x0000)
struct BorderSpectate_C_ExecuteUbergraph_BorderSpectate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0020(0x0040)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BorderSpectate_C_ExecuteUbergraph_BorderSpectate) == 0x000008, "Wrong alignment on BorderSpectate_C_ExecuteUbergraph_BorderSpectate");
static_assert(sizeof(BorderSpectate_C_ExecuteUbergraph_BorderSpectate) == 0x000088, "Wrong size on BorderSpectate_C_ExecuteUbergraph_BorderSpectate");
static_assert(offsetof(BorderSpectate_C_ExecuteUbergraph_BorderSpectate, EntryPoint) == 0x000000, "Member 'BorderSpectate_C_ExecuteUbergraph_BorderSpectate::EntryPoint' has a wrong offset!");
static_assert(offsetof(BorderSpectate_C_ExecuteUbergraph_BorderSpectate, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'BorderSpectate_C_ExecuteUbergraph_BorderSpectate::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BorderSpectate_C_ExecuteUbergraph_BorderSpectate, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'BorderSpectate_C_ExecuteUbergraph_BorderSpectate::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BorderSpectate_C_ExecuteUbergraph_BorderSpectate, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'BorderSpectate_C_ExecuteUbergraph_BorderSpectate::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BorderSpectate_C_ExecuteUbergraph_BorderSpectate, Temp_bool_Has_Been_Initd_Variable) == 0x000018, "Member 'BorderSpectate_C_ExecuteUbergraph_BorderSpectate::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BorderSpectate_C_ExecuteUbergraph_BorderSpectate, K2Node_Event_MyGeometry) == 0x000020, "Member 'BorderSpectate_C_ExecuteUbergraph_BorderSpectate::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BorderSpectate_C_ExecuteUbergraph_BorderSpectate, K2Node_Event_InDeltaTime) == 0x000060, "Member 'BorderSpectate_C_ExecuteUbergraph_BorderSpectate::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BorderSpectate_C_ExecuteUbergraph_BorderSpectate, CallFunc_GetPlayerController_ReturnValue) == 0x000068, "Member 'BorderSpectate_C_ExecuteUbergraph_BorderSpectate::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BorderSpectate_C_ExecuteUbergraph_BorderSpectate, CallFunc_K2_GetPawn_ReturnValue) == 0x000070, "Member 'BorderSpectate_C_ExecuteUbergraph_BorderSpectate::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BorderSpectate_C_ExecuteUbergraph_BorderSpectate, K2Node_DynamicCast_AsTrain_Gus_Player) == 0x000078, "Member 'BorderSpectate_C_ExecuteUbergraph_BorderSpectate::K2Node_DynamicCast_AsTrain_Gus_Player' has a wrong offset!");
static_assert(offsetof(BorderSpectate_C_ExecuteUbergraph_BorderSpectate, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'BorderSpectate_C_ExecuteUbergraph_BorderSpectate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BorderSpectate_C_ExecuteUbergraph_BorderSpectate, CallFunc_IsValid_ReturnValue) == 0x000081, "Member 'BorderSpectate_C_ExecuteUbergraph_BorderSpectate::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

