#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FlintlockTRAIN

#include "Basic.hpp"

#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function BP_FlintlockTRAIN.BP_FlintlockTRAIN_C.InpActEvt_Fire weapon_K2Node_InputActionEvent_0
// 0x0018 (0x0018 - 0x0000)
struct BP_FlintlockTRAIN_C_InpActEvt_Fire_weapon_K2Node_InputActionEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_FlintlockTRAIN_C_InpActEvt_Fire_weapon_K2Node_InputActionEvent_0) == 0x000008, "Wrong alignment on BP_FlintlockTRAIN_C_InpActEvt_Fire_weapon_K2Node_InputActionEvent_0");
static_assert(sizeof(BP_FlintlockTRAIN_C_InpActEvt_Fire_weapon_K2Node_InputActionEvent_0) == 0x000018, "Wrong size on BP_FlintlockTRAIN_C_InpActEvt_Fire_weapon_K2Node_InputActionEvent_0");
static_assert(offsetof(BP_FlintlockTRAIN_C_InpActEvt_Fire_weapon_K2Node_InputActionEvent_0, Key) == 0x000000, "Member 'BP_FlintlockTRAIN_C_InpActEvt_Fire_weapon_K2Node_InputActionEvent_0::Key' has a wrong offset!");

// Function BP_FlintlockTRAIN.BP_FlintlockTRAIN_C.ExecuteUbergraph_BP_FlintlockTRAIN
// 0x0038 (0x0038 - 0x0000)
struct BP_FlintlockTRAIN_C_ExecuteUbergraph_BP_FlintlockTRAIN final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x0020(0x0018)(HasGetValueTypeHash)
};
static_assert(alignof(BP_FlintlockTRAIN_C_ExecuteUbergraph_BP_FlintlockTRAIN) == 0x000008, "Wrong alignment on BP_FlintlockTRAIN_C_ExecuteUbergraph_BP_FlintlockTRAIN");
static_assert(sizeof(BP_FlintlockTRAIN_C_ExecuteUbergraph_BP_FlintlockTRAIN) == 0x000038, "Wrong size on BP_FlintlockTRAIN_C_ExecuteUbergraph_BP_FlintlockTRAIN");
static_assert(offsetof(BP_FlintlockTRAIN_C_ExecuteUbergraph_BP_FlintlockTRAIN, EntryPoint) == 0x000000, "Member 'BP_FlintlockTRAIN_C_ExecuteUbergraph_BP_FlintlockTRAIN::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FlintlockTRAIN_C_ExecuteUbergraph_BP_FlintlockTRAIN, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_FlintlockTRAIN_C_ExecuteUbergraph_BP_FlintlockTRAIN::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FlintlockTRAIN_C_ExecuteUbergraph_BP_FlintlockTRAIN, K2Node_DynamicCast_AsTrain_Gus_Player) == 0x000010, "Member 'BP_FlintlockTRAIN_C_ExecuteUbergraph_BP_FlintlockTRAIN::K2Node_DynamicCast_AsTrain_Gus_Player' has a wrong offset!");
static_assert(offsetof(BP_FlintlockTRAIN_C_ExecuteUbergraph_BP_FlintlockTRAIN, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_FlintlockTRAIN_C_ExecuteUbergraph_BP_FlintlockTRAIN::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FlintlockTRAIN_C_ExecuteUbergraph_BP_FlintlockTRAIN, K2Node_InputActionEvent_Key) == 0x000020, "Member 'BP_FlintlockTRAIN_C_ExecuteUbergraph_BP_FlintlockTRAIN::K2Node_InputActionEvent_Key' has a wrong offset!");

}

