#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FlintlockTRAIN

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FlintlockTRAIN.BP_FlintlockTRAIN_C
// 0x0028 (0x02A0 - 0x0278)
class ABP_FlintlockTRAIN_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 FlintlockSkeletonfbx;                              // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          ADS_Fov;                                           // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATrainGusPlayer_C*                      traingus;                                          // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void InpActEvt_Fire_weapon_K2Node_InputActionEvent_0(const struct FKey& Key);
	void ExecuteUbergraph_BP_FlintlockTRAIN(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FlintlockTRAIN_C">();
	}
	static class ABP_FlintlockTRAIN_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FlintlockTRAIN_C>();
	}
};
static_assert(alignof(ABP_FlintlockTRAIN_C) == 0x000008, "Wrong alignment on ABP_FlintlockTRAIN_C");
static_assert(sizeof(ABP_FlintlockTRAIN_C) == 0x0002A0, "Wrong size on ABP_FlintlockTRAIN_C");
static_assert(offsetof(ABP_FlintlockTRAIN_C, UberGraphFrame) == 0x000278, "Member 'ABP_FlintlockTRAIN_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_FlintlockTRAIN_C, FlintlockSkeletonfbx) == 0x000280, "Member 'ABP_FlintlockTRAIN_C::FlintlockSkeletonfbx' has a wrong offset!");
static_assert(offsetof(ABP_FlintlockTRAIN_C, DefaultSceneRoot) == 0x000288, "Member 'ABP_FlintlockTRAIN_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_FlintlockTRAIN_C, ADS_Fov) == 0x000290, "Member 'ABP_FlintlockTRAIN_C::ADS_Fov' has a wrong offset!");
static_assert(offsetof(ABP_FlintlockTRAIN_C, traingus) == 0x000298, "Member 'ABP_FlintlockTRAIN_C::traingus' has a wrong offset!");

}

