#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_BlueprintBase_New

#include "Basic.hpp"

#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function BTTask_BlueprintBase_New.BTTask_BlueprintBase_New_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTTask_BlueprintBase_New_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_BlueprintBase_New_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTTask_BlueprintBase_New_C_ReceiveExecuteAI");
static_assert(sizeof(BTTask_BlueprintBase_New_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTTask_BlueprintBase_New_C_ReceiveExecuteAI");
static_assert(offsetof(BTTask_BlueprintBase_New_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTTask_BlueprintBase_New_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_BlueprintBase_New_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTTask_BlueprintBase_New_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

// Function BTTask_BlueprintBase_New.BTTask_BlueprintBase_New_C.OnSuccess_4A2D8EC9409DE4B6632D7882E7E1E348
// 0x0001 (0x0001 - 0x0000)
struct BTTask_BlueprintBase_New_C_OnSuccess_4A2D8EC9409DE4B6632D7882E7E1E348 final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_BlueprintBase_New_C_OnSuccess_4A2D8EC9409DE4B6632D7882E7E1E348) == 0x000001, "Wrong alignment on BTTask_BlueprintBase_New_C_OnSuccess_4A2D8EC9409DE4B6632D7882E7E1E348");
static_assert(sizeof(BTTask_BlueprintBase_New_C_OnSuccess_4A2D8EC9409DE4B6632D7882E7E1E348) == 0x000001, "Wrong size on BTTask_BlueprintBase_New_C_OnSuccess_4A2D8EC9409DE4B6632D7882E7E1E348");
static_assert(offsetof(BTTask_BlueprintBase_New_C_OnSuccess_4A2D8EC9409DE4B6632D7882E7E1E348, MovementResult) == 0x000000, "Member 'BTTask_BlueprintBase_New_C_OnSuccess_4A2D8EC9409DE4B6632D7882E7E1E348::MovementResult' has a wrong offset!");

// Function BTTask_BlueprintBase_New.BTTask_BlueprintBase_New_C.OnFail_4A2D8EC9409DE4B6632D7882E7E1E348
// 0x0001 (0x0001 - 0x0000)
struct BTTask_BlueprintBase_New_C_OnFail_4A2D8EC9409DE4B6632D7882E7E1E348 final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_BlueprintBase_New_C_OnFail_4A2D8EC9409DE4B6632D7882E7E1E348) == 0x000001, "Wrong alignment on BTTask_BlueprintBase_New_C_OnFail_4A2D8EC9409DE4B6632D7882E7E1E348");
static_assert(sizeof(BTTask_BlueprintBase_New_C_OnFail_4A2D8EC9409DE4B6632D7882E7E1E348) == 0x000001, "Wrong size on BTTask_BlueprintBase_New_C_OnFail_4A2D8EC9409DE4B6632D7882E7E1E348");
static_assert(offsetof(BTTask_BlueprintBase_New_C_OnFail_4A2D8EC9409DE4B6632D7882E7E1E348, MovementResult) == 0x000000, "Member 'BTTask_BlueprintBase_New_C_OnFail_4A2D8EC9409DE4B6632D7882E7E1E348::MovementResult' has a wrong offset!");

// Function BTTask_BlueprintBase_New.BTTask_BlueprintBase_New_C.ExecuteUbergraph_BTTask_BlueprintBase_New
// 0x0078 (0x0078 - 0x0000)
struct BTTask_BlueprintBase_New_C_ExecuteUbergraph_BTTask_BlueprintBase_New final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_1;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate;       // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_1;     // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          Temp_byte_Variable;                                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetOwnersBlackboard_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetValueAsObject_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_BlueprintBase_New_C_ExecuteUbergraph_BTTask_BlueprintBase_New) == 0x000008, "Wrong alignment on BTTask_BlueprintBase_New_C_ExecuteUbergraph_BTTask_BlueprintBase_New");
static_assert(sizeof(BTTask_BlueprintBase_New_C_ExecuteUbergraph_BTTask_BlueprintBase_New) == 0x000078, "Wrong size on BTTask_BlueprintBase_New_C_ExecuteUbergraph_BTTask_BlueprintBase_New");
static_assert(offsetof(BTTask_BlueprintBase_New_C_ExecuteUbergraph_BTTask_BlueprintBase_New, EntryPoint) == 0x000000, "Member 'BTTask_BlueprintBase_New_C_ExecuteUbergraph_BTTask_BlueprintBase_New::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTTask_BlueprintBase_New_C_ExecuteUbergraph_BTTask_BlueprintBase_New, K2Node_CustomEvent_MovementResult_1) == 0x000004, "Member 'BTTask_BlueprintBase_New_C_ExecuteUbergraph_BTTask_BlueprintBase_New::K2Node_CustomEvent_MovementResult_1' has a wrong offset!");
static_assert(offsetof(BTTask_BlueprintBase_New_C_ExecuteUbergraph_BTTask_BlueprintBase_New, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BTTask_BlueprintBase_New_C_ExecuteUbergraph_BTTask_BlueprintBase_New::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BTTask_BlueprintBase_New_C_ExecuteUbergraph_BTTask_BlueprintBase_New, K2Node_CustomEvent_MovementResult) == 0x000018, "Member 'BTTask_BlueprintBase_New_C_ExecuteUbergraph_BTTask_BlueprintBase_New::K2Node_CustomEvent_MovementResult' has a wrong offset!");
static_assert(offsetof(BTTask_BlueprintBase_New_C_ExecuteUbergraph_BTTask_BlueprintBase_New, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'BTTask_BlueprintBase_New_C_ExecuteUbergraph_BTTask_BlueprintBase_New::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BTTask_BlueprintBase_New_C_ExecuteUbergraph_BTTask_BlueprintBase_New, Temp_byte_Variable) == 0x00002C, "Member 'BTTask_BlueprintBase_New_C_ExecuteUbergraph_BTTask_BlueprintBase_New::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BTTask_BlueprintBase_New_C_ExecuteUbergraph_BTTask_BlueprintBase_New, K2Node_Event_OwnerController) == 0x000030, "Member 'BTTask_BlueprintBase_New_C_ExecuteUbergraph_BTTask_BlueprintBase_New::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_BlueprintBase_New_C_ExecuteUbergraph_BTTask_BlueprintBase_New, K2Node_Event_ControlledPawn) == 0x000038, "Member 'BTTask_BlueprintBase_New_C_ExecuteUbergraph_BTTask_BlueprintBase_New::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTTask_BlueprintBase_New_C_ExecuteUbergraph_BTTask_BlueprintBase_New, CallFunc_GetOwnersBlackboard_ReturnValue) == 0x000040, "Member 'BTTask_BlueprintBase_New_C_ExecuteUbergraph_BTTask_BlueprintBase_New::CallFunc_GetOwnersBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_BlueprintBase_New_C_ExecuteUbergraph_BTTask_BlueprintBase_New, CallFunc_MakeLiteralName_ReturnValue) == 0x000048, "Member 'BTTask_BlueprintBase_New_C_ExecuteUbergraph_BTTask_BlueprintBase_New::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_BlueprintBase_New_C_ExecuteUbergraph_BTTask_BlueprintBase_New, CallFunc_GetValueAsObject_ReturnValue) == 0x000050, "Member 'BTTask_BlueprintBase_New_C_ExecuteUbergraph_BTTask_BlueprintBase_New::CallFunc_GetValueAsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_BlueprintBase_New_C_ExecuteUbergraph_BTTask_BlueprintBase_New, K2Node_DynamicCast_AsActor) == 0x000058, "Member 'BTTask_BlueprintBase_New_C_ExecuteUbergraph_BTTask_BlueprintBase_New::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(BTTask_BlueprintBase_New_C_ExecuteUbergraph_BTTask_BlueprintBase_New, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BTTask_BlueprintBase_New_C_ExecuteUbergraph_BTTask_BlueprintBase_New::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTTask_BlueprintBase_New_C_ExecuteUbergraph_BTTask_BlueprintBase_New, CallFunc_CreateMoveToProxyObject_ReturnValue) == 0x000068, "Member 'BTTask_BlueprintBase_New_C_ExecuteUbergraph_BTTask_BlueprintBase_New::CallFunc_CreateMoveToProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_BlueprintBase_New_C_ExecuteUbergraph_BTTask_BlueprintBase_New, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'BTTask_BlueprintBase_New_C_ExecuteUbergraph_BTTask_BlueprintBase_New::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

