#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Camera_SpectateHUD

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function Camera_SpectateHUD.Camera_SpectateHUD_C.Tracking User
// 0x0080 (0x0080 - 0x0000)
struct Camera_SpectateHUD_C_Tracking_User final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraSpectate_C*                      K2Node_DynamicCast_AsCamera_Spectate;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0068(0x0018)()
};
static_assert(alignof(Camera_SpectateHUD_C_Tracking_User) == 0x000008, "Wrong alignment on Camera_SpectateHUD_C_Tracking_User");
static_assert(sizeof(Camera_SpectateHUD_C_Tracking_User) == 0x000080, "Wrong size on Camera_SpectateHUD_C_Tracking_User");
static_assert(offsetof(Camera_SpectateHUD_C_Tracking_User, ReturnValue) == 0x000000, "Member 'Camera_SpectateHUD_C_Tracking_User::ReturnValue' has a wrong offset!");
static_assert(offsetof(Camera_SpectateHUD_C_Tracking_User, CallFunc_GetPlayerPawn_ReturnValue) == 0x000018, "Member 'Camera_SpectateHUD_C_Tracking_User::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Camera_SpectateHUD_C_Tracking_User, K2Node_DynamicCast_AsCamera_Spectate) == 0x000020, "Member 'Camera_SpectateHUD_C_Tracking_User::K2Node_DynamicCast_AsCamera_Spectate' has a wrong offset!");
static_assert(offsetof(Camera_SpectateHUD_C_Tracking_User, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Camera_SpectateHUD_C_Tracking_User::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Camera_SpectateHUD_C_Tracking_User, CallFunc_GetOwner_ReturnValue) == 0x000030, "Member 'Camera_SpectateHUD_C_Tracking_User::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Camera_SpectateHUD_C_Tracking_User, K2Node_DynamicCast_AsPlayer_Controller) == 0x000038, "Member 'Camera_SpectateHUD_C_Tracking_User::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(Camera_SpectateHUD_C_Tracking_User, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'Camera_SpectateHUD_C_Tracking_User::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Camera_SpectateHUD_C_Tracking_User, CallFunc_GetPlayerName_ReturnValue) == 0x000048, "Member 'Camera_SpectateHUD_C_Tracking_User::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Camera_SpectateHUD_C_Tracking_User, CallFunc_Concat_StrStr_ReturnValue) == 0x000058, "Member 'Camera_SpectateHUD_C_Tracking_User::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Camera_SpectateHUD_C_Tracking_User, CallFunc_Conv_StringToText_ReturnValue) == 0x000068, "Member 'Camera_SpectateHUD_C_Tracking_User::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function Camera_SpectateHUD.Camera_SpectateHUD_C.Tick
// 0x0048 (0x0048 - 0x0000)
struct Camera_SpectateHUD_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Camera_SpectateHUD_C_Tick) == 0x000008, "Wrong alignment on Camera_SpectateHUD_C_Tick");
static_assert(sizeof(Camera_SpectateHUD_C_Tick) == 0x000048, "Wrong size on Camera_SpectateHUD_C_Tick");
static_assert(offsetof(Camera_SpectateHUD_C_Tick, MyGeometry) == 0x000000, "Member 'Camera_SpectateHUD_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(Camera_SpectateHUD_C_Tick, InDeltaTime) == 0x000040, "Member 'Camera_SpectateHUD_C_Tick::InDeltaTime' has a wrong offset!");

// Function Camera_SpectateHUD.Camera_SpectateHUD_C.Hud Visibility Camera Lag
// 0x0001 (0x0001 - 0x0000)
struct Camera_SpectateHUD_C_Hud_Visibility_Camera_Lag final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Camera_SpectateHUD_C_Hud_Visibility_Camera_Lag) == 0x000001, "Wrong alignment on Camera_SpectateHUD_C_Hud_Visibility_Camera_Lag");
static_assert(sizeof(Camera_SpectateHUD_C_Hud_Visibility_Camera_Lag) == 0x000001, "Wrong size on Camera_SpectateHUD_C_Hud_Visibility_Camera_Lag");
static_assert(offsetof(Camera_SpectateHUD_C_Hud_Visibility_Camera_Lag, ReturnValue) == 0x000000, "Member 'Camera_SpectateHUD_C_Hud_Visibility_Camera_Lag::ReturnValue' has a wrong offset!");

// Function Camera_SpectateHUD.Camera_SpectateHUD_C.Hud Visibility
// 0x0001 (0x0001 - 0x0000)
struct Camera_SpectateHUD_C_Hud_Visibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Camera_SpectateHUD_C_Hud_Visibility) == 0x000001, "Wrong alignment on Camera_SpectateHUD_C_Hud_Visibility");
static_assert(sizeof(Camera_SpectateHUD_C_Hud_Visibility) == 0x000001, "Wrong size on Camera_SpectateHUD_C_Hud_Visibility");
static_assert(offsetof(Camera_SpectateHUD_C_Hud_Visibility, ReturnValue) == 0x000000, "Member 'Camera_SpectateHUD_C_Hud_Visibility::ReturnValue' has a wrong offset!");

// Function Camera_SpectateHUD.Camera_SpectateHUD_C.FOV Amount
// 0x0080 (0x0080 - 0x0000)
struct Camera_SpectateHUD_C_FOV_Amount final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraSpectate_C*                      K2Node_DynamicCast_AsCamera_Spectate;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0030(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0068(0x0018)()
};
static_assert(alignof(Camera_SpectateHUD_C_FOV_Amount) == 0x000008, "Wrong alignment on Camera_SpectateHUD_C_FOV_Amount");
static_assert(sizeof(Camera_SpectateHUD_C_FOV_Amount) == 0x000080, "Wrong size on Camera_SpectateHUD_C_FOV_Amount");
static_assert(offsetof(Camera_SpectateHUD_C_FOV_Amount, ReturnValue) == 0x000000, "Member 'Camera_SpectateHUD_C_FOV_Amount::ReturnValue' has a wrong offset!");
static_assert(offsetof(Camera_SpectateHUD_C_FOV_Amount, CallFunc_GetPlayerPawn_ReturnValue) == 0x000018, "Member 'Camera_SpectateHUD_C_FOV_Amount::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Camera_SpectateHUD_C_FOV_Amount, K2Node_DynamicCast_AsCamera_Spectate) == 0x000020, "Member 'Camera_SpectateHUD_C_FOV_Amount::K2Node_DynamicCast_AsCamera_Spectate' has a wrong offset!");
static_assert(offsetof(Camera_SpectateHUD_C_FOV_Amount, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Camera_SpectateHUD_C_FOV_Amount::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Camera_SpectateHUD_C_FOV_Amount, CallFunc_Conv_FloatToText_ReturnValue) == 0x000030, "Member 'Camera_SpectateHUD_C_FOV_Amount::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Camera_SpectateHUD_C_FOV_Amount, CallFunc_Conv_TextToString_ReturnValue) == 0x000048, "Member 'Camera_SpectateHUD_C_FOV_Amount::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Camera_SpectateHUD_C_FOV_Amount, CallFunc_Concat_StrStr_ReturnValue) == 0x000058, "Member 'Camera_SpectateHUD_C_FOV_Amount::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Camera_SpectateHUD_C_FOV_Amount, CallFunc_Conv_StringToText_ReturnValue) == 0x000068, "Member 'Camera_SpectateHUD_C_FOV_Amount::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function Camera_SpectateHUD.Camera_SpectateHUD_C.ExecuteUbergraph_Camera_SpectateHUD
// 0x0068 (0x0068 - 0x0000)
struct Camera_SpectateHUD_C_ExecuteUbergraph_Camera_SpectateHUD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0040)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraSpectate_C*                      K2Node_DynamicCast_AsCamera_Spectate;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Camera_SpectateHUD_C_ExecuteUbergraph_Camera_SpectateHUD) == 0x000008, "Wrong alignment on Camera_SpectateHUD_C_ExecuteUbergraph_Camera_SpectateHUD");
static_assert(sizeof(Camera_SpectateHUD_C_ExecuteUbergraph_Camera_SpectateHUD) == 0x000068, "Wrong size on Camera_SpectateHUD_C_ExecuteUbergraph_Camera_SpectateHUD");
static_assert(offsetof(Camera_SpectateHUD_C_ExecuteUbergraph_Camera_SpectateHUD, EntryPoint) == 0x000000, "Member 'Camera_SpectateHUD_C_ExecuteUbergraph_Camera_SpectateHUD::EntryPoint' has a wrong offset!");
static_assert(offsetof(Camera_SpectateHUD_C_ExecuteUbergraph_Camera_SpectateHUD, K2Node_Event_MyGeometry) == 0x000008, "Member 'Camera_SpectateHUD_C_ExecuteUbergraph_Camera_SpectateHUD::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(Camera_SpectateHUD_C_ExecuteUbergraph_Camera_SpectateHUD, K2Node_Event_InDeltaTime) == 0x000048, "Member 'Camera_SpectateHUD_C_ExecuteUbergraph_Camera_SpectateHUD::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(Camera_SpectateHUD_C_ExecuteUbergraph_Camera_SpectateHUD, CallFunc_GetPlayerPawn_ReturnValue) == 0x000050, "Member 'Camera_SpectateHUD_C_ExecuteUbergraph_Camera_SpectateHUD::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Camera_SpectateHUD_C_ExecuteUbergraph_Camera_SpectateHUD, K2Node_DynamicCast_AsCamera_Spectate) == 0x000058, "Member 'Camera_SpectateHUD_C_ExecuteUbergraph_Camera_SpectateHUD::K2Node_DynamicCast_AsCamera_Spectate' has a wrong offset!");
static_assert(offsetof(Camera_SpectateHUD_C_ExecuteUbergraph_Camera_SpectateHUD, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'Camera_SpectateHUD_C_ExecuteUbergraph_Camera_SpectateHUD::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

