#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraSpectate

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CameraSpectate.CameraSpectate_C.VoteUpdate
// 0x0008 (0x0008 - 0x0000)
struct CameraSpectate_C_VoteUpdate final
{
public:
	int32                                         Ay;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Ny;                                                // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CameraSpectate_C_VoteUpdate) == 0x000004, "Wrong alignment on CameraSpectate_C_VoteUpdate");
static_assert(sizeof(CameraSpectate_C_VoteUpdate) == 0x000008, "Wrong size on CameraSpectate_C_VoteUpdate");
static_assert(offsetof(CameraSpectate_C_VoteUpdate, Ay) == 0x000000, "Member 'CameraSpectate_C_VoteUpdate::Ay' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_VoteUpdate, Ny) == 0x000004, "Member 'CameraSpectate_C_VoteUpdate::Ny' has a wrong offset!");

// Function CameraSpectate.CameraSpectate_C.Spawn The Widgets
// 0x0008 (0x0008 - 0x0000)
struct CameraSpectate_C_Spawn_The_Widgets final
{
public:
	class APlayerController*                      OwningPlayer;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CameraSpectate_C_Spawn_The_Widgets) == 0x000008, "Wrong alignment on CameraSpectate_C_Spawn_The_Widgets");
static_assert(sizeof(CameraSpectate_C_Spawn_The_Widgets) == 0x000008, "Wrong size on CameraSpectate_C_Spawn_The_Widgets");
static_assert(offsetof(CameraSpectate_C_Spawn_The_Widgets, OwningPlayer) == 0x000000, "Member 'CameraSpectate_C_Spawn_The_Widgets::OwningPlayer' has a wrong offset!");

// Function CameraSpectate.CameraSpectate_C.SomeoneVoted
// 0x0028 (0x0028 - 0x0000)
struct CameraSpectate_C_SomeoneVoted final
{
public:
	class FText                                   PersonWhoVoted;                                    // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          TheirVote;                                         // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateBP_C*                       Player_State;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CameraSpectate_C_SomeoneVoted) == 0x000008, "Wrong alignment on CameraSpectate_C_SomeoneVoted");
static_assert(sizeof(CameraSpectate_C_SomeoneVoted) == 0x000028, "Wrong size on CameraSpectate_C_SomeoneVoted");
static_assert(offsetof(CameraSpectate_C_SomeoneVoted, PersonWhoVoted) == 0x000000, "Member 'CameraSpectate_C_SomeoneVoted::PersonWhoVoted' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_SomeoneVoted, TheirVote) == 0x000018, "Member 'CameraSpectate_C_SomeoneVoted::TheirVote' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_SomeoneVoted, Player_State) == 0x000020, "Member 'CameraSpectate_C_SomeoneVoted::Player_State' has a wrong offset!");

// Function CameraSpectate.CameraSpectate_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct CameraSpectate_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CameraSpectate_C_ReceiveTick) == 0x000004, "Wrong alignment on CameraSpectate_C_ReceiveTick");
static_assert(sizeof(CameraSpectate_C_ReceiveTick) == 0x000004, "Wrong size on CameraSpectate_C_ReceiveTick");
static_assert(offsetof(CameraSpectate_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'CameraSpectate_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function CameraSpectate.CameraSpectate_C.Kickfart
// 0x0048 (0x0048 - 0x0000)
struct CameraSpectate_C_Kickfart final
{
public:
	class FString                                 PlayerName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Kick_;                                             // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   ThoseWhoKnow;                                      // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(CameraSpectate_C_Kickfart) == 0x000008, "Wrong alignment on CameraSpectate_C_Kickfart");
static_assert(sizeof(CameraSpectate_C_Kickfart) == 0x000048, "Wrong size on CameraSpectate_C_Kickfart");
static_assert(offsetof(CameraSpectate_C_Kickfart, PlayerName) == 0x000000, "Member 'CameraSpectate_C_Kickfart::PlayerName' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_Kickfart, Kick_) == 0x000010, "Member 'CameraSpectate_C_Kickfart::Kick_' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_Kickfart, Text) == 0x000018, "Member 'CameraSpectate_C_Kickfart::Text' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_Kickfart, ThoseWhoKnow) == 0x000030, "Member 'CameraSpectate_C_Kickfart::ThoseWhoKnow' has a wrong offset!");

// Function CameraSpectate.CameraSpectate_C.Just Possesed Pawn
// 0x0008 (0x0008 - 0x0000)
struct CameraSpectate_C_Just_Possesed_Pawn final
{
public:
	class APawn*                                  Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CameraSpectate_C_Just_Possesed_Pawn) == 0x000008, "Wrong alignment on CameraSpectate_C_Just_Possesed_Pawn");
static_assert(sizeof(CameraSpectate_C_Just_Possesed_Pawn) == 0x000008, "Wrong size on CameraSpectate_C_Just_Possesed_Pawn");
static_assert(offsetof(CameraSpectate_C_Just_Possesed_Pawn, Pawn) == 0x000000, "Member 'CameraSpectate_C_Just_Possesed_Pawn::Pawn' has a wrong offset!");

// Function CameraSpectate.CameraSpectate_C.Spawn Gus The Spire Docks
// 0x0018 (0x0018 - 0x0000)
struct CameraSpectate_C_Spawn_Gus_The_Spire_Docks final
{
public:
	class AController*                            Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         My_team;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      PlayerController;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CameraSpectate_C_Spawn_Gus_The_Spire_Docks) == 0x000008, "Wrong alignment on CameraSpectate_C_Spawn_Gus_The_Spire_Docks");
static_assert(sizeof(CameraSpectate_C_Spawn_Gus_The_Spire_Docks) == 0x000018, "Wrong size on CameraSpectate_C_Spawn_Gus_The_Spire_Docks");
static_assert(offsetof(CameraSpectate_C_Spawn_Gus_The_Spire_Docks, Target) == 0x000000, "Member 'CameraSpectate_C_Spawn_Gus_The_Spire_Docks::Target' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_Spawn_Gus_The_Spire_Docks, My_team) == 0x000008, "Member 'CameraSpectate_C_Spawn_Gus_The_Spire_Docks::My_team' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_Spawn_Gus_The_Spire_Docks, PlayerController) == 0x000010, "Member 'CameraSpectate_C_Spawn_Gus_The_Spire_Docks::PlayerController' has a wrong offset!");

// Function CameraSpectate.CameraSpectate_C.Spawn Gus TDMer Island
// 0x0018 (0x0018 - 0x0000)
struct CameraSpectate_C_Spawn_Gus_TDMer_Island final
{
public:
	class AController*                            Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         My_team;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      PlayerController;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CameraSpectate_C_Spawn_Gus_TDMer_Island) == 0x000008, "Wrong alignment on CameraSpectate_C_Spawn_Gus_TDMer_Island");
static_assert(sizeof(CameraSpectate_C_Spawn_Gus_TDMer_Island) == 0x000018, "Wrong size on CameraSpectate_C_Spawn_Gus_TDMer_Island");
static_assert(offsetof(CameraSpectate_C_Spawn_Gus_TDMer_Island, Target) == 0x000000, "Member 'CameraSpectate_C_Spawn_Gus_TDMer_Island::Target' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_Spawn_Gus_TDMer_Island, My_team) == 0x000008, "Member 'CameraSpectate_C_Spawn_Gus_TDMer_Island::My_team' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_Spawn_Gus_TDMer_Island, PlayerController) == 0x000010, "Member 'CameraSpectate_C_Spawn_Gus_TDMer_Island::PlayerController' has a wrong offset!");

// Function CameraSpectate.CameraSpectate_C.InpActEvt_V_K2Node_InputKeyEvent_8
// 0x0018 (0x0018 - 0x0000)
struct CameraSpectate_C_InpActEvt_V_K2Node_InputKeyEvent_8 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(CameraSpectate_C_InpActEvt_V_K2Node_InputKeyEvent_8) == 0x000008, "Wrong alignment on CameraSpectate_C_InpActEvt_V_K2Node_InputKeyEvent_8");
static_assert(sizeof(CameraSpectate_C_InpActEvt_V_K2Node_InputKeyEvent_8) == 0x000018, "Wrong size on CameraSpectate_C_InpActEvt_V_K2Node_InputKeyEvent_8");
static_assert(offsetof(CameraSpectate_C_InpActEvt_V_K2Node_InputKeyEvent_8, Key) == 0x000000, "Member 'CameraSpectate_C_InpActEvt_V_K2Node_InputKeyEvent_8::Key' has a wrong offset!");

// Function CameraSpectate.CameraSpectate_C.InpActEvt_RightMouseButton_K2Node_InputKeyEvent_6
// 0x0018 (0x0018 - 0x0000)
struct CameraSpectate_C_InpActEvt_RightMouseButton_K2Node_InputKeyEvent_6 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(CameraSpectate_C_InpActEvt_RightMouseButton_K2Node_InputKeyEvent_6) == 0x000008, "Wrong alignment on CameraSpectate_C_InpActEvt_RightMouseButton_K2Node_InputKeyEvent_6");
static_assert(sizeof(CameraSpectate_C_InpActEvt_RightMouseButton_K2Node_InputKeyEvent_6) == 0x000018, "Wrong size on CameraSpectate_C_InpActEvt_RightMouseButton_K2Node_InputKeyEvent_6");
static_assert(offsetof(CameraSpectate_C_InpActEvt_RightMouseButton_K2Node_InputKeyEvent_6, Key) == 0x000000, "Member 'CameraSpectate_C_InpActEvt_RightMouseButton_K2Node_InputKeyEvent_6::Key' has a wrong offset!");

// Function CameraSpectate.CameraSpectate_C.InpActEvt_R_K2Node_InputKeyEvent_0
// 0x0018 (0x0018 - 0x0000)
struct CameraSpectate_C_InpActEvt_R_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(CameraSpectate_C_InpActEvt_R_K2Node_InputKeyEvent_0) == 0x000008, "Wrong alignment on CameraSpectate_C_InpActEvt_R_K2Node_InputKeyEvent_0");
static_assert(sizeof(CameraSpectate_C_InpActEvt_R_K2Node_InputKeyEvent_0) == 0x000018, "Wrong size on CameraSpectate_C_InpActEvt_R_K2Node_InputKeyEvent_0");
static_assert(offsetof(CameraSpectate_C_InpActEvt_R_K2Node_InputKeyEvent_0, Key) == 0x000000, "Member 'CameraSpectate_C_InpActEvt_R_K2Node_InputKeyEvent_0::Key' has a wrong offset!");

// Function CameraSpectate.CameraSpectate_C.InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_2
// 0x0018 (0x0018 - 0x0000)
struct CameraSpectate_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_2 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(CameraSpectate_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_2) == 0x000008, "Wrong alignment on CameraSpectate_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_2");
static_assert(sizeof(CameraSpectate_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_2) == 0x000018, "Wrong size on CameraSpectate_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_2");
static_assert(offsetof(CameraSpectate_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_2, Key) == 0x000000, "Member 'CameraSpectate_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_2::Key' has a wrong offset!");

// Function CameraSpectate.CameraSpectate_C.InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_1
// 0x0018 (0x0018 - 0x0000)
struct CameraSpectate_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(CameraSpectate_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_1) == 0x000008, "Wrong alignment on CameraSpectate_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_1");
static_assert(sizeof(CameraSpectate_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_1) == 0x000018, "Wrong size on CameraSpectate_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_1");
static_assert(offsetof(CameraSpectate_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_1, Key) == 0x000000, "Member 'CameraSpectate_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_1::Key' has a wrong offset!");

// Function CameraSpectate.CameraSpectate_C.InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_7
// 0x0018 (0x0018 - 0x0000)
struct CameraSpectate_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_7 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(CameraSpectate_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_7) == 0x000008, "Wrong alignment on CameraSpectate_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_7");
static_assert(sizeof(CameraSpectate_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_7) == 0x000018, "Wrong size on CameraSpectate_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_7");
static_assert(offsetof(CameraSpectate_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_7, Key) == 0x000000, "Member 'CameraSpectate_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_7::Key' has a wrong offset!");

// Function CameraSpectate.CameraSpectate_C.InpActEvt_H_K2Node_InputKeyEvent_3
// 0x0018 (0x0018 - 0x0000)
struct CameraSpectate_C_InpActEvt_H_K2Node_InputKeyEvent_3 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(CameraSpectate_C_InpActEvt_H_K2Node_InputKeyEvent_3) == 0x000008, "Wrong alignment on CameraSpectate_C_InpActEvt_H_K2Node_InputKeyEvent_3");
static_assert(sizeof(CameraSpectate_C_InpActEvt_H_K2Node_InputKeyEvent_3) == 0x000018, "Wrong size on CameraSpectate_C_InpActEvt_H_K2Node_InputKeyEvent_3");
static_assert(offsetof(CameraSpectate_C_InpActEvt_H_K2Node_InputKeyEvent_3, Key) == 0x000000, "Member 'CameraSpectate_C_InpActEvt_H_K2Node_InputKeyEvent_3::Key' has a wrong offset!");

// Function CameraSpectate.CameraSpectate_C.InpActEvt_G_K2Node_InputKeyEvent_4
// 0x0018 (0x0018 - 0x0000)
struct CameraSpectate_C_InpActEvt_G_K2Node_InputKeyEvent_4 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(CameraSpectate_C_InpActEvt_G_K2Node_InputKeyEvent_4) == 0x000008, "Wrong alignment on CameraSpectate_C_InpActEvt_G_K2Node_InputKeyEvent_4");
static_assert(sizeof(CameraSpectate_C_InpActEvt_G_K2Node_InputKeyEvent_4) == 0x000018, "Wrong size on CameraSpectate_C_InpActEvt_G_K2Node_InputKeyEvent_4");
static_assert(offsetof(CameraSpectate_C_InpActEvt_G_K2Node_InputKeyEvent_4, Key) == 0x000000, "Member 'CameraSpectate_C_InpActEvt_G_K2Node_InputKeyEvent_4::Key' has a wrong offset!");

// Function CameraSpectate.CameraSpectate_C.InpActEvt_F_K2Node_InputKeyEvent_5
// 0x0018 (0x0018 - 0x0000)
struct CameraSpectate_C_InpActEvt_F_K2Node_InputKeyEvent_5 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(CameraSpectate_C_InpActEvt_F_K2Node_InputKeyEvent_5) == 0x000008, "Wrong alignment on CameraSpectate_C_InpActEvt_F_K2Node_InputKeyEvent_5");
static_assert(sizeof(CameraSpectate_C_InpActEvt_F_K2Node_InputKeyEvent_5) == 0x000018, "Wrong size on CameraSpectate_C_InpActEvt_F_K2Node_InputKeyEvent_5");
static_assert(offsetof(CameraSpectate_C_InpActEvt_F_K2Node_InputKeyEvent_5, Key) == 0x000000, "Member 'CameraSpectate_C_InpActEvt_F_K2Node_InputKeyEvent_5::Key' has a wrong offset!");

// Function CameraSpectate.CameraSpectate_C.ExecuteUbergraph_CameraSpectate
// 0x0C40 (0x0C40 - 0x0000)
struct CameraSpectate_C_ExecuteUbergraph_CameraSpectate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_8;                        // 0x0028(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_7;                        // 0x0040(0x0018)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_6;                        // 0x0060(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_5;                        // 0x0078(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_4;                        // 0x0090(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_3;                        // 0x00A8(0x0018)(HasGetValueTypeHash)
	class UHUDgus_C*                              CallFunc_Create_ReturnValue;                       // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_2;                        // 0x00C8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_1;                        // 0x00E0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x00F8(0x0018)(HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0128(0x0010)(ConstParm, ReferenceParm)
	class APlayerController*                      K2Node_CustomEvent_OwningPlayer_1;                 // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBorderSpectate_C*                      CallFunc_Create_ReturnValue_1;                     // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_CustomEvent_OwningPlayer;                   // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_Target_1;                       // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_My_team_1;                      // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_CustomEvent_PlayerController_1;             // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller_1;          // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x01D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USpawnMenu_The_Spire_C*                 CallFunc_Create_ReturnValue_2;                     // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x01EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_2;          // 0x01F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_2;        // 0x01FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FE[0x2];                                      // 0x01FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_3;          // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_208[0x8];                                      // 0x0208(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0210(0x0060)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_3;        // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrainGusPlayer_C*                      CallFunc_FinishSpawningActor_ReturnValue;          // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller_2;          // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x3];                                      // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Ay;                                   // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Ny;                                   // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USpawnMenu_TDMer_Island_C*              CallFunc_Create_ReturnValue_3;                     // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_CustomEvent_Target;                         // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_My_team;                        // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_CustomEvent_PlayerController;               // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_3;                   // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller_3;          // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_PersonWhoVoted;                       // 0x02E0(0x0018)()
	bool                                          K2Node_Event_TheirVote;                            // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateBP_C*                       K2Node_Event_Player_State;                         // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_4;                   // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller_4;          // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ATrainGusPlayer_C*>              CallFunc_GetAllActorsOfClass_OutActors;            // 0x0320(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0330(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0348(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0368(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_PlayerName;                           // 0x0450(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Kick_;                                // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_461[0x7];                                      // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Text;                                 // 0x0468(0x0018)()
	class FText                                   K2Node_Event_ThoseWhoKnow;                         // 0x0480(0x0018)()
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x04A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_Pawn;                                 // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_1;                      // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C4[0x4];                                      // 0x04C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x04C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x04D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult_1;     // 0x04F0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Temp_int_Variable;                                 // 0x05D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DC[0x4];                                      // 0x05DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Select_Default;                             // 0x05E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F8[0x8];                                      // 0x05F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0600(0x0060)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x0660(0x0060)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x06C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x06C8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ATrainGusPlayer_C*                      CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x07B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x07B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x07C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ATrainGusPlayer_C*>              CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x07C8(0x0010)(ReferenceParm)
	uint8                                         Pad_7D8[0x8];                                      // 0x07D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_3;              // 0x07E0(0x0060)(IsPlainOldData, NoDestructor)
	class ATrainGusPlayer_C*                      CallFunc_Array_Get_Item;                           // 0x0840(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult_1;    // 0x0848(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ATrainGusPlayer_C*                      CallFunc_Array_Get_Item_1;                         // 0x0930(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0938(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x093C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93D[0x3];                                      // 0x093D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0940(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_1;    // 0x0958(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0970(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0988(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x09A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x09B8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0AA0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0AA1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0AA2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA3[0x1];                                      // 0x0AA3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0AA4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0AA8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AAC[0x4];                                      // 0x0AAC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0AB0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0AC8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0AE0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0AF8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0B10(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0B18(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0B20(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0B28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0B30(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0B38(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0B3C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0B40(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B44[0x4];                                      // 0x0B44(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0B48(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0B60(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0B78(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0B80(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0B88(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0B90(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0B98(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_4;              // 0x0BB0(0x0060)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0C10(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIGremlin_C*                           CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0C18(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_WideningCast;     // 0x0C20(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_WideningCast;          // 0x0C28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_In_Field_Of_View_NarrowingCast; // 0x0C30(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_In_Field_Of_View_NarrowingCast_1; // 0x0C34(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate) == 0x000010, "Wrong alignment on CameraSpectate_C_ExecuteUbergraph_CameraSpectate");
static_assert(sizeof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate) == 0x000C40, "Wrong size on CameraSpectate_C_ExecuteUbergraph_CameraSpectate");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, EntryPoint) == 0x000000, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::EntryPoint' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, CallFunc_GetPlayerState_ReturnValue) == 0x000008, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, CallFunc_GetPlayerName_ReturnValue) == 0x000010, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000020, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000021, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, CallFunc_BooleanOR_ReturnValue) == 0x000022, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, K2Node_InputKeyEvent_Key_8) == 0x000028, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::K2Node_InputKeyEvent_Key_8' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, K2Node_InputKeyEvent_Key_7) == 0x000040, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::K2Node_InputKeyEvent_Key_7' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, K2Node_InputKeyEvent_Key_6) == 0x000060, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::K2Node_InputKeyEvent_Key_6' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, K2Node_InputKeyEvent_Key_5) == 0x000078, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::K2Node_InputKeyEvent_Key_5' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, K2Node_InputKeyEvent_Key_4) == 0x000090, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::K2Node_InputKeyEvent_Key_4' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, K2Node_InputKeyEvent_Key_3) == 0x0000A8, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::K2Node_InputKeyEvent_Key_3' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, CallFunc_Create_ReturnValue) == 0x0000C0, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, K2Node_InputKeyEvent_Key_2) == 0x0000C8, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::K2Node_InputKeyEvent_Key_2' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, K2Node_InputKeyEvent_Key_1) == 0x0000E0, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::K2Node_InputKeyEvent_Key_1' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, K2Node_InputKeyEvent_Key) == 0x0000F8, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::K2Node_InputKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000110, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, Temp_object_Variable) == 0x000128, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, K2Node_CustomEvent_OwningPlayer_1) == 0x000138, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::K2Node_CustomEvent_OwningPlayer_1' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000140, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, CallFunc_Create_ReturnValue_1) == 0x000158, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, CallFunc_GetOwner_ReturnValue) == 0x000160, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, K2Node_DynamicCast_AsPlayer_Controller) == 0x000168, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, K2Node_DynamicCast_bSuccess) == 0x000170, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, Temp_int_Array_Index_Variable) == 0x000174, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, K2Node_CustomEvent_OwningPlayer) == 0x000178, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::K2Node_CustomEvent_OwningPlayer' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, K2Node_Event_DeltaSeconds) == 0x000180, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, K2Node_CustomEvent_Target_1) == 0x000188, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::K2Node_CustomEvent_Target_1' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, K2Node_CustomEvent_My_team_1) == 0x000190, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::K2Node_CustomEvent_My_team_1' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, K2Node_CustomEvent_PlayerController_1) == 0x000198, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::K2Node_CustomEvent_PlayerController_1' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, Temp_int_Loop_Counter_Variable) == 0x0001A0, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, CallFunc_Less_IntInt_ReturnValue) == 0x0001A4, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, CallFunc_Add_IntInt_ReturnValue) == 0x0001A8, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, CallFunc_RandomInteger_ReturnValue) == 0x0001AC, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, CallFunc_GetOwner_ReturnValue_1) == 0x0001B0, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, CallFunc_GetCurrentLevelName_ReturnValue) == 0x0001B8, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, K2Node_DynamicCast_AsPlayer_Controller_1) == 0x0001C8, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::K2Node_DynamicCast_AsPlayer_Controller_1' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, K2Node_DynamicCast_bSuccess_1) == 0x0001D0, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, CallFunc_Conv_StringToName_ReturnValue) == 0x0001D4, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, CallFunc_Create_ReturnValue_2) == 0x0001E0, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0001E8, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, CallFunc_Conv_StringToName_ReturnValue_1) == 0x0001EC, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, CallFunc_Conv_StringToName_ReturnValue_2) == 0x0001F4, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::CallFunc_Conv_StringToName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x0001FC, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CameraSpectate_C_ExecuteUbergraph_CameraSpectate, CallFunc_EqualEqual_NameName_ReturnValue_2) == 0x0001FD, "Member 'CameraSpectate_C_ExecuteUbergraph_CameraSpectate::CallFunc_EqualEqual_NameName_ReturnValue_2' has a wrong offset!");
