#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CannonFront_widget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CannonFront_widget.CannonFront_widget_C
// 0x0028 (0x02B8 - 0x0290)
class UCannonFront_widget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCircle_Bar_C*                          Circle_Bar;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                InteractkeyShower;                                 // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ACannon_C*                              BarrelRef;                                         // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Bannana_s_in_barrel;                               // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	class FText Get_Interact_key();
	void ExecuteUbergraph_CannonFront_widget(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CannonFront_widget_C">();
	}
	static class UCannonFront_widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCannonFront_widget_C>();
	}
};
static_assert(alignof(UCannonFront_widget_C) == 0x000008, "Wrong alignment on UCannonFront_widget_C");
static_assert(sizeof(UCannonFront_widget_C) == 0x0002B8, "Wrong size on UCannonFront_widget_C");
static_assert(offsetof(UCannonFront_widget_C, UberGraphFrame) == 0x000290, "Member 'UCannonFront_widget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCannonFront_widget_C, Circle_Bar) == 0x000298, "Member 'UCannonFront_widget_C::Circle_Bar' has a wrong offset!");
static_assert(offsetof(UCannonFront_widget_C, InteractkeyShower) == 0x0002A0, "Member 'UCannonFront_widget_C::InteractkeyShower' has a wrong offset!");
static_assert(offsetof(UCannonFront_widget_C, BarrelRef) == 0x0002A8, "Member 'UCannonFront_widget_C::BarrelRef' has a wrong offset!");
static_assert(offsetof(UCannonFront_widget_C, Bannana_s_in_barrel) == 0x0002B0, "Member 'UCannonFront_widget_C::Bannana_s_in_barrel' has a wrong offset!");

}

