#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CannonFront_Interact_Widget

#include "Basic.hpp"


namespace SDK::Params
{

// Function CannonFront_Interact_Widget.CannonFront_Interact_Widget_C.ExecuteUbergraph_CannonFront_Interact_Widget
// 0x0020 (0x0020 - 0x0000)
struct CannonFront_Interact_Widget_C_ExecuteUbergraph_CannonFront_Interact_Widget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerControlled_ReturnValue;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CannonFront_Interact_Widget_C_ExecuteUbergraph_CannonFront_Interact_Widget) == 0x000008, "Wrong alignment on CannonFront_Interact_Widget_C_ExecuteUbergraph_CannonFront_Interact_Widget");
static_assert(sizeof(CannonFront_Interact_Widget_C_ExecuteUbergraph_CannonFront_Interact_Widget) == 0x000020, "Wrong size on CannonFront_Interact_Widget_C_ExecuteUbergraph_CannonFront_Interact_Widget");
static_assert(offsetof(CannonFront_Interact_Widget_C_ExecuteUbergraph_CannonFront_Interact_Widget, EntryPoint) == 0x000000, "Member 'CannonFront_Interact_Widget_C_ExecuteUbergraph_CannonFront_Interact_Widget::EntryPoint' has a wrong offset!");
static_assert(offsetof(CannonFront_Interact_Widget_C_ExecuteUbergraph_CannonFront_Interact_Widget, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'CannonFront_Interact_Widget_C_ExecuteUbergraph_CannonFront_Interact_Widget::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(CannonFront_Interact_Widget_C_ExecuteUbergraph_CannonFront_Interact_Widget, K2Node_DynamicCast_AsTrain_Gus_Player) == 0x000010, "Member 'CannonFront_Interact_Widget_C_ExecuteUbergraph_CannonFront_Interact_Widget::K2Node_DynamicCast_AsTrain_Gus_Player' has a wrong offset!");
static_assert(offsetof(CannonFront_Interact_Widget_C_ExecuteUbergraph_CannonFront_Interact_Widget, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'CannonFront_Interact_Widget_C_ExecuteUbergraph_CannonFront_Interact_Widget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CannonFront_Interact_Widget_C_ExecuteUbergraph_CannonFront_Interact_Widget, CallFunc_IsPlayerControlled_ReturnValue) == 0x000019, "Member 'CannonFront_Interact_Widget_C_ExecuteUbergraph_CannonFront_Interact_Widget::CallFunc_IsPlayerControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(CannonFront_Interact_Widget_C_ExecuteUbergraph_CannonFront_Interact_Widget, CallFunc_Not_PreBool_ReturnValue) == 0x00001A, "Member 'CannonFront_Interact_Widget_C_ExecuteUbergraph_CannonFront_Interact_Widget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CannonFront_Interact_Widget_C_ExecuteUbergraph_CannonFront_Interact_Widget, CallFunc_BooleanOR_ReturnValue) == 0x00001B, "Member 'CannonFront_Interact_Widget_C_ExecuteUbergraph_CannonFront_Interact_Widget::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

