#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cannon_Interact_Widget_Actor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Cannon_Interact_Widget_Actor.Cannon_Interact_Widget_Actor_C
// 0x0020 (0x0298 - 0x0278)
class ACannon_Interact_Widget_Actor_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetComponent*                       Widget;                                            // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ACannon_C*                              Barrel_Ref;                                        // 0x0290(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ExecuteUbergraph_Cannon_Interact_Widget_Actor(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Cannon_Interact_Widget_Actor_C">();
	}
	static class ACannon_Interact_Widget_Actor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACannon_Interact_Widget_Actor_C>();
	}
};
static_assert(alignof(ACannon_Interact_Widget_Actor_C) == 0x000008, "Wrong alignment on ACannon_Interact_Widget_Actor_C");
static_assert(sizeof(ACannon_Interact_Widget_Actor_C) == 0x000298, "Wrong size on ACannon_Interact_Widget_Actor_C");
static_assert(offsetof(ACannon_Interact_Widget_Actor_C, UberGraphFrame) == 0x000278, "Member 'ACannon_Interact_Widget_Actor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACannon_Interact_Widget_Actor_C, Widget) == 0x000280, "Member 'ACannon_Interact_Widget_Actor_C::Widget' has a wrong offset!");
static_assert(offsetof(ACannon_Interact_Widget_Actor_C, DefaultSceneRoot) == 0x000288, "Member 'ACannon_Interact_Widget_Actor_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ACannon_Interact_Widget_Actor_C, Barrel_Ref) == 0x000290, "Member 'ACannon_Interact_Widget_Actor_C::Barrel_Ref' has a wrong offset!");

}

