#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cannon

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Cannon.Cannon_C.Up Down server
// 0x0028 (0x0028 - 0x0000)
struct Cannon_C_Up_Down_server final
{
public:
	double                                        A;                                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               NewRotation;                                       // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class USceneComponent*                        Target;                                            // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cannon_C_Up_Down_server) == 0x000008, "Wrong alignment on Cannon_C_Up_Down_server");
static_assert(sizeof(Cannon_C_Up_Down_server) == 0x000028, "Wrong size on Cannon_C_Up_Down_server");
static_assert(offsetof(Cannon_C_Up_Down_server, A) == 0x000000, "Member 'Cannon_C_Up_Down_server::A' has a wrong offset!");
static_assert(offsetof(Cannon_C_Up_Down_server, NewRotation) == 0x000008, "Member 'Cannon_C_Up_Down_server::NewRotation' has a wrong offset!");
static_assert(offsetof(Cannon_C_Up_Down_server, Target) == 0x000020, "Member 'Cannon_C_Up_Down_server::Target' has a wrong offset!");

// Function Cannon.Cannon_C.Turn Left Server
// 0x0028 (0x0028 - 0x0000)
struct Cannon_C_Turn_Left_Server final
{
public:
	double                                        A;                                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               NewRotation;                                       // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class USceneComponent*                        Target;                                            // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cannon_C_Turn_Left_Server) == 0x000008, "Wrong alignment on Cannon_C_Turn_Left_Server");
static_assert(sizeof(Cannon_C_Turn_Left_Server) == 0x000028, "Wrong size on Cannon_C_Turn_Left_Server");
static_assert(offsetof(Cannon_C_Turn_Left_Server, A) == 0x000000, "Member 'Cannon_C_Turn_Left_Server::A' has a wrong offset!");
static_assert(offsetof(Cannon_C_Turn_Left_Server, NewRotation) == 0x000008, "Member 'Cannon_C_Turn_Left_Server::NewRotation' has a wrong offset!");
static_assert(offsetof(Cannon_C_Turn_Left_Server, Target) == 0x000020, "Member 'Cannon_C_Turn_Left_Server::Target' has a wrong offset!");

// Function Cannon.Cannon_C.Server Spawn cannonball
// 0x0038 (0x0038 - 0x0000)
struct Cannon_C_Server_Spawn_cannonball final
{
public:
	struct FVector                                Spawn_Transform_Location_0;                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Spawn_Transform_Rotation_0;                        // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 Owner_0;                                           // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cannon_C_Server_Spawn_cannonball) == 0x000008, "Wrong alignment on Cannon_C_Server_Spawn_cannonball");
static_assert(sizeof(Cannon_C_Server_Spawn_cannonball) == 0x000038, "Wrong size on Cannon_C_Server_Spawn_cannonball");
static_assert(offsetof(Cannon_C_Server_Spawn_cannonball, Spawn_Transform_Location_0) == 0x000000, "Member 'Cannon_C_Server_Spawn_cannonball::Spawn_Transform_Location_0' has a wrong offset!");
static_assert(offsetof(Cannon_C_Server_Spawn_cannonball, Spawn_Transform_Rotation_0) == 0x000018, "Member 'Cannon_C_Server_Spawn_cannonball::Spawn_Transform_Rotation_0' has a wrong offset!");
static_assert(offsetof(Cannon_C_Server_Spawn_cannonball, Owner_0) == 0x000030, "Member 'Cannon_C_Server_Spawn_cannonball::Owner_0' has a wrong offset!");

// Function Cannon.Cannon_C.Server hitmarker
// 0x0008 (0x0008 - 0x0000)
struct Cannon_C_Server_hitmarker final
{
public:
	class APlayerController*                      OwningPlayer;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cannon_C_Server_hitmarker) == 0x000008, "Wrong alignment on Cannon_C_Server_hitmarker");
static_assert(sizeof(Cannon_C_Server_hitmarker) == 0x000008, "Wrong size on Cannon_C_Server_hitmarker");
static_assert(offsetof(Cannon_C_Server_hitmarker, OwningPlayer) == 0x000000, "Member 'Cannon_C_Server_hitmarker::OwningPlayer' has a wrong offset!");

// Function Cannon.Cannon_C.ReceivePossessed
// 0x0008 (0x0008 - 0x0000)
struct Cannon_C_ReceivePossessed final
{
public:
	class AController*                            NewController;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cannon_C_ReceivePossessed) == 0x000008, "Wrong alignment on Cannon_C_ReceivePossessed");
static_assert(sizeof(Cannon_C_ReceivePossessed) == 0x000008, "Wrong size on Cannon_C_ReceivePossessed");
static_assert(offsetof(Cannon_C_ReceivePossessed, NewController) == 0x000000, "Member 'Cannon_C_ReceivePossessed::NewController' has a wrong offset!");

// Function Cannon.Cannon_C.On Interact
// 0x0010 (0x0010 - 0x0000)
struct Cannon_C_On_Interact final
{
public:
	class ATrainGusPlayer_C*                      User_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Inside_;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cannon_C_On_Interact) == 0x000008, "Wrong alignment on Cannon_C_On_Interact");
static_assert(sizeof(Cannon_C_On_Interact) == 0x000010, "Wrong size on Cannon_C_On_Interact");
static_assert(offsetof(Cannon_C_On_Interact, User_0) == 0x000000, "Member 'Cannon_C_On_Interact::User_0' has a wrong offset!");
static_assert(offsetof(Cannon_C_On_Interact, Inside_) == 0x000008, "Member 'Cannon_C_On_Interact::Inside_' has a wrong offset!");

// Function Cannon.Cannon_C.Launch
// 0x0030 (0x0030 - 0x0000)
struct Cannon_C_Launch final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             Character_0;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            Target;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                A;                                                 // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cannon_C_Launch) == 0x000008, "Wrong alignment on Cannon_C_Launch");
static_assert(sizeof(Cannon_C_Launch) == 0x000030, "Wrong size on Cannon_C_Launch");
static_assert(offsetof(Cannon_C_Launch, Actor) == 0x000000, "Member 'Cannon_C_Launch::Actor' has a wrong offset!");
static_assert(offsetof(Cannon_C_Launch, Character_0) == 0x000008, "Member 'Cannon_C_Launch::Character_0' has a wrong offset!");
static_assert(offsetof(Cannon_C_Launch, Target) == 0x000010, "Member 'Cannon_C_Launch::Target' has a wrong offset!");
static_assert(offsetof(Cannon_C_Launch, A) == 0x000018, "Member 'Cannon_C_Launch::A' has a wrong offset!");

// Function Cannon.Cannon_C.Interact Server
// 0x0008 (0x0008 - 0x0000)
struct Cannon_C_Interact_Server final
{
public:
	class ATrainGusPlayer_C*                      Recent_gus_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cannon_C_Interact_Server) == 0x000008, "Wrong alignment on Cannon_C_Interact_Server");
static_assert(sizeof(Cannon_C_Interact_Server) == 0x000008, "Wrong size on Cannon_C_Interact_Server");
static_assert(offsetof(Cannon_C_Interact_Server, Recent_gus_0) == 0x000000, "Member 'Cannon_C_Interact_Server::Recent_gus_0' has a wrong offset!");

// Function Cannon.Cannon_C.Inside Cannon Exit
// 0x0048 (0x0048 - 0x0000)
struct Cannon_C_Inside_Cannon_Exit final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DestLocation;                                      // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               DestRotation;                                      // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AController*                            Target2;                                           // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  InPawn;                                            // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cannon_C_Inside_Cannon_Exit) == 0x000008, "Wrong alignment on Cannon_C_Inside_Cannon_Exit");
static_assert(sizeof(Cannon_C_Inside_Cannon_Exit) == 0x000048, "Wrong size on Cannon_C_Inside_Cannon_Exit");
static_assert(offsetof(Cannon_C_Inside_Cannon_Exit, Target) == 0x000000, "Member 'Cannon_C_Inside_Cannon_Exit::Target' has a wrong offset!");
static_assert(offsetof(Cannon_C_Inside_Cannon_Exit, DestLocation) == 0x000008, "Member 'Cannon_C_Inside_Cannon_Exit::DestLocation' has a wrong offset!");
static_assert(offsetof(Cannon_C_Inside_Cannon_Exit, DestRotation) == 0x000020, "Member 'Cannon_C_Inside_Cannon_Exit::DestRotation' has a wrong offset!");
static_assert(offsetof(Cannon_C_Inside_Cannon_Exit, Target2) == 0x000038, "Member 'Cannon_C_Inside_Cannon_Exit::Target2' has a wrong offset!");
static_assert(offsetof(Cannon_C_Inside_Cannon_Exit, InPawn) == 0x000040, "Member 'Cannon_C_Inside_Cannon_Exit::InPawn' has a wrong offset!");

// Function Cannon.Cannon_C. Left Mouse_K2Node_InputAxisEvent_3
// 0x0004 (0x0004 - 0x0000)
struct Cannon_C__Left_Mouse_K2Node_InputAxisEvent_3 final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cannon_C__Left_Mouse_K2Node_InputAxisEvent_3) == 0x000004, "Wrong alignment on Cannon_C__Left_Mouse_K2Node_InputAxisEvent_3");
static_assert(sizeof(Cannon_C__Left_Mouse_K2Node_InputAxisEvent_3) == 0x000004, "Wrong size on Cannon_C__Left_Mouse_K2Node_InputAxisEvent_3");
static_assert(offsetof(Cannon_C__Left_Mouse_K2Node_InputAxisEvent_3, AxisValue) == 0x000000, "Member 'Cannon_C__Left_Mouse_K2Node_InputAxisEvent_3::AxisValue' has a wrong offset!");

// Function Cannon.Cannon_C. Down Mouse_K2Node_InputAxisEvent_2
// 0x0004 (0x0004 - 0x0000)
struct Cannon_C__Down_Mouse_K2Node_InputAxisEvent_2 final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cannon_C__Down_Mouse_K2Node_InputAxisEvent_2) == 0x000004, "Wrong alignment on Cannon_C__Down_Mouse_K2Node_InputAxisEvent_2");
static_assert(sizeof(Cannon_C__Down_Mouse_K2Node_InputAxisEvent_2) == 0x000004, "Wrong size on Cannon_C__Down_Mouse_K2Node_InputAxisEvent_2");
static_assert(offsetof(Cannon_C__Down_Mouse_K2Node_InputAxisEvent_2, AxisValue) == 0x000000, "Member 'Cannon_C__Down_Mouse_K2Node_InputAxisEvent_2::AxisValue' has a wrong offset!");

// Function Cannon.Cannon_C.InpActEvt_V_K2Node_InputKeyEvent_0
// 0x0018 (0x0018 - 0x0000)
struct Cannon_C_InpActEvt_V_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(Cannon_C_InpActEvt_V_K2Node_InputKeyEvent_0) == 0x000008, "Wrong alignment on Cannon_C_InpActEvt_V_K2Node_InputKeyEvent_0");
static_assert(sizeof(Cannon_C_InpActEvt_V_K2Node_InputKeyEvent_0) == 0x000018, "Wrong size on Cannon_C_InpActEvt_V_K2Node_InputKeyEvent_0");
static_assert(offsetof(Cannon_C_InpActEvt_V_K2Node_InputKeyEvent_0, Key) == 0x000000, "Member 'Cannon_C_InpActEvt_V_K2Node_InputKeyEvent_0::Key' has a wrong offset!");

// Function Cannon.Cannon_C.InpActEvt_R_K2Node_InputKeyEvent_2
// 0x0018 (0x0018 - 0x0000)
struct Cannon_C_InpActEvt_R_K2Node_InputKeyEvent_2 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(Cannon_C_InpActEvt_R_K2Node_InputKeyEvent_2) == 0x000008, "Wrong alignment on Cannon_C_InpActEvt_R_K2Node_InputKeyEvent_2");
static_assert(sizeof(Cannon_C_InpActEvt_R_K2Node_InputKeyEvent_2) == 0x000018, "Wrong size on Cannon_C_InpActEvt_R_K2Node_InputKeyEvent_2");
static_assert(offsetof(Cannon_C_InpActEvt_R_K2Node_InputKeyEvent_2, Key) == 0x000000, "Member 'Cannon_C_InpActEvt_R_K2Node_InputKeyEvent_2::Key' has a wrong offset!");

// Function Cannon.Cannon_C.InpActEvt_R_K2Node_InputKeyEvent_1
// 0x0018 (0x0018 - 0x0000)
struct Cannon_C_InpActEvt_R_K2Node_InputKeyEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(Cannon_C_InpActEvt_R_K2Node_InputKeyEvent_1) == 0x000008, "Wrong alignment on Cannon_C_InpActEvt_R_K2Node_InputKeyEvent_1");
static_assert(sizeof(Cannon_C_InpActEvt_R_K2Node_InputKeyEvent_1) == 0x000018, "Wrong size on Cannon_C_InpActEvt_R_K2Node_InputKeyEvent_1");
static_assert(offsetof(Cannon_C_InpActEvt_R_K2Node_InputKeyEvent_1, Key) == 0x000000, "Member 'Cannon_C_InpActEvt_R_K2Node_InputKeyEvent_1::Key' has a wrong offset!");

// Function Cannon.Cannon_C.InpActEvt_Interact key_K2Node_InputActionEvent_0
// 0x0018 (0x0018 - 0x0000)
struct Cannon_C_InpActEvt_Interact_key_K2Node_InputActionEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(Cannon_C_InpActEvt_Interact_key_K2Node_InputActionEvent_0) == 0x000008, "Wrong alignment on Cannon_C_InpActEvt_Interact_key_K2Node_InputActionEvent_0");
static_assert(sizeof(Cannon_C_InpActEvt_Interact_key_K2Node_InputActionEvent_0) == 0x000018, "Wrong size on Cannon_C_InpActEvt_Interact_key_K2Node_InputActionEvent_0");
static_assert(offsetof(Cannon_C_InpActEvt_Interact_key_K2Node_InputActionEvent_0, Key) == 0x000000, "Member 'Cannon_C_InpActEvt_Interact_key_K2Node_InputActionEvent_0::Key' has a wrong offset!");

// Function Cannon.Cannon_C.InpActEvt_Fire weapon_K2Node_InputActionEvent_1
// 0x0018 (0x0018 - 0x0000)
struct Cannon_C_InpActEvt_Fire_weapon_K2Node_InputActionEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(Cannon_C_InpActEvt_Fire_weapon_K2Node_InputActionEvent_1) == 0x000008, "Wrong alignment on Cannon_C_InpActEvt_Fire_weapon_K2Node_InputActionEvent_1");
static_assert(sizeof(Cannon_C_InpActEvt_Fire_weapon_K2Node_InputActionEvent_1) == 0x000018, "Wrong size on Cannon_C_InpActEvt_Fire_weapon_K2Node_InputActionEvent_1");
static_assert(offsetof(Cannon_C_InpActEvt_Fire_weapon_K2Node_InputActionEvent_1, Key) == 0x000000, "Member 'Cannon_C_InpActEvt_Fire_weapon_K2Node_InputActionEvent_1::Key' has a wrong offset!");

// Function Cannon.Cannon_C.Get off cannon server
// 0x0018 (0x0018 - 0x0000)
struct Cannon_C_Get_off_cannon_server final
{
public:
	class AController*                            Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  InPawn;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cannon_C_Get_off_cannon_server) == 0x000008, "Wrong alignment on Cannon_C_Get_off_cannon_server");
static_assert(sizeof(Cannon_C_Get_off_cannon_server) == 0x000018, "Wrong size on Cannon_C_Get_off_cannon_server");
static_assert(offsetof(Cannon_C_Get_off_cannon_server, Target) == 0x000000, "Member 'Cannon_C_Get_off_cannon_server::Target' has a wrong offset!");
static_assert(offsetof(Cannon_C_Get_off_cannon_server, InPawn) == 0x000008, "Member 'Cannon_C_Get_off_cannon_server::InPawn' has a wrong offset!");
static_assert(offsetof(Cannon_C_Get_off_cannon_server, Actor) == 0x000010, "Member 'Cannon_C_Get_off_cannon_server::Actor' has a wrong offset!");

// Function Cannon.Cannon_C.Get in cannon
// 0x0008 (0x0008 - 0x0000)
struct Cannon_C_Get_in_cannon final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cannon_C_Get_in_cannon) == 0x000008, "Wrong alignment on Cannon_C_Get_in_cannon");
static_assert(sizeof(Cannon_C_Get_in_cannon) == 0x000008, "Wrong size on Cannon_C_Get_in_cannon");
static_assert(offsetof(Cannon_C_Get_in_cannon, Target) == 0x000000, "Member 'Cannon_C_Get_in_cannon::Target' has a wrong offset!");

// Function Cannon.Cannon_C.ExecuteUbergraph_Cannon
// 0x0EC0 (0x0EC0 - 0x0000)
struct Cannon_C_ExecuteUbergraph_Cannon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0020(0x0060)(IsPlainOldData, NoDestructor)
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0080(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_1;                     // 0x0098(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x00B0(0x0018)(HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Actor_1;                        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_CustomEvent_Character;                      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_CustomEvent_Target_5;                       // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_A_2;                            // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player;             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICommunication_BPI_C>  K2Node_DynamicCast_AsCommunication_BPI;            // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_InputAxisEvent_AxisValue_1;                 // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_TeleportTo_ReturnValue;                // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F8[0x8];                                      // 0x01F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0200(0x0060)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0260(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0278(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_CustomEvent_OwningPlayer;                   // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Uhitmarker_C*                           CallFunc_Create_ReturnValue;                       // 0x0298(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Target_4;                       // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Target_3;                       // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_DestLocation;                   // 0x02B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_DestRotation;                   // 0x02C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AController*                            K2Node_CustomEvent_Target2;                        // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_InPawn_1;                       // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Spawn_Transform_Location;       // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_Spawn_Transform_Rotation;       // 0x0308(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_Owner;                          // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x0330(0x0060)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_TeleportTo_ReturnValue_1;              // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACanonball_BP_C*                        CallFunc_FinishSpawningActor_ReturnValue;          // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x03C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_InputAxisEvent_AxisValue;                   // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x03E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_1;    // 0x0408(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0420(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0438(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UCannon_Reload_C*                       CallFunc_Create_ReturnValue_1;                     // 0x0520(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0528(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FKey                                   Temp_struct_Variable;                              // 0x0610(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_1;                        // 0x0628(0x0018)(HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Hit_bloke;                      // 0x0640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0648(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AController*                            K2Node_Event_NewController;                        // 0x0658(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_661[0x7];                                      // 0x0661(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0668(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_CustomEvent_Target_2;                       // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_InPawn;                         // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Actor;                          // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player_1;           // 0x0698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_TeleportTo_ReturnValue_2;              // 0x06A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A2[0xE];                                      // 0x06A2(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x06B0(0x0060)(ConstParm, IsPlainOldData, NoDestructor)
	double                                        K2Node_CustomEvent_A_1;                            // 0x0710(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_NewRotation_1;                  // 0x0718(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class USceneComponent*                        K2Node_CustomEvent_Target_1;                       // 0x0730(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_A;                              // 0x0738(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_NewRotation;                    // 0x0740(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class USceneComponent*                        K2Node_CustomEvent_Target;                         // 0x0758(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x0760(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_2;  // 0x0848(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ATrainGusPlayer_C*                      K2Node_Event_User;                                 // 0x0930(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Inside_;                              // 0x0938(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerControlled_ReturnValue;           // 0x0939(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerControlled_ReturnValue_1;         // 0x093A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93B[0x5];                                      // 0x093B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICommunication_BPI_C>  K2Node_DynamicCast_AsCommunication_BPI_1;          // 0x0940(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0950(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_951[0x7];                                      // 0x0951(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATrainGusPlayer_C*                      K2Node_CustomEvent_Recent_gus;                     // 0x0958(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_2;    // 0x0960(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0978(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult; // 0x0990(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue; // 0x0A78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A79[0x7];                                      // 0x0A79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0A80(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACanonball_BP_Client_C*                 CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0A88(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0A90(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A91[0x7];                                      // 0x0A91(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0A98(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             K2Node_CustomEvent_SpawnTransform;                 // 0x0AB0(0x0060)(IsPlainOldData, NoDestructor)
	class ACharacter*                             K2Node_CustomEvent_Real;                           // 0x0B10(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0B18(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICommunication_BPI_C>  K2Node_DynamicCast_AsCommunication_BPI_2;          // 0x0B20(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0B30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B31[0xF];                                      // 0x0B31(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0B40(0x0060)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0BA0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0BB8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0BD0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult_1; // 0x0BE8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue_1; // 0x0CD0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD1[0x7];                                      // 0x0CD1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0CD8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AServerCannonDamager_C*                 CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0CE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0CE8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FKey                                   K2Node_InputKeyEvent_Key_2;                        // 0x0D00(0x0018)(HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x0D18(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x0D1C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x0D20(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D24[0x4];                                      // 0x0D24(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x0D28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_3;                // 0x0D30(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_3;  // 0x0D48(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_BreakRotator_Roll_3;                      // 0x0E30(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_3;                     // 0x0E34(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_3;                       // 0x0E38(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E3C[0x4];                                      // 0x0E3C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_4;                // 0x0E40(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        K2Node_VariableSet_Reload_time_WideningCast;       // 0x0E58(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Up_Down_server_A_WideningCast;            // 0x0E60(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_WideningCast;     // 0x0E68(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_WideningCast_1;   // 0x0E70(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AddControllerPitchInput_Val_NarrowingCast; // 0x0E78(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E7C[0x4];                                      // 0x0E7C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_B_WideningCast;          // 0x0E80(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_Barrel_Pitch_NarrowingCast;     // 0x0E88(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E8C[0x4];                                      // 0x0E8C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Turn_Left_Server_A_WideningCast;          // 0x0E90(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_WideningCast_2;   // 0x0E98(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_WideningCast_1;        // 0x0EA0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_Barrel_Yaw_NarrowingCast;       // 0x0EA8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EAC[0x4];                                      // 0x0EAC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_WideningCast;          // 0x0EB0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_NarrowingCast;            // 0x0EB8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cannon_C_ExecuteUbergraph_Cannon) == 0x000010, "Wrong alignment on Cannon_C_ExecuteUbergraph_Cannon");
static_assert(sizeof(Cannon_C_ExecuteUbergraph_Cannon) == 0x000EC0, "Wrong size on Cannon_C_ExecuteUbergraph_Cannon");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, EntryPoint) == 0x000000, "Member 'Cannon_C_ExecuteUbergraph_Cannon::EntryPoint' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000008, "Member 'Cannon_C_ExecuteUbergraph_Cannon::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, CallFunc_MakeTransform_ReturnValue) == 0x000020, "Member 'Cannon_C_ExecuteUbergraph_Cannon::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, K2Node_InputKeyEvent_Key) == 0x000080, "Member 'Cannon_C_ExecuteUbergraph_Cannon::K2Node_InputKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, K2Node_InputActionEvent_Key_1) == 0x000098, "Member 'Cannon_C_ExecuteUbergraph_Cannon::K2Node_InputActionEvent_Key_1' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, K2Node_InputActionEvent_Key) == 0x0000B0, "Member 'Cannon_C_ExecuteUbergraph_Cannon::K2Node_InputActionEvent_Key' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, K2Node_CustomEvent_Actor_1) == 0x0000C8, "Member 'Cannon_C_ExecuteUbergraph_Cannon::K2Node_CustomEvent_Actor_1' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, K2Node_CustomEvent_Character) == 0x0000D0, "Member 'Cannon_C_ExecuteUbergraph_Cannon::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, K2Node_CustomEvent_Target_5) == 0x0000D8, "Member 'Cannon_C_ExecuteUbergraph_Cannon::K2Node_CustomEvent_Target_5' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, K2Node_CustomEvent_A_2) == 0x0000E0, "Member 'Cannon_C_ExecuteUbergraph_Cannon::K2Node_CustomEvent_A_2' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000F8, "Member 'Cannon_C_ExecuteUbergraph_Cannon::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, CallFunc_BreakVector_X) == 0x000110, "Member 'Cannon_C_ExecuteUbergraph_Cannon::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, CallFunc_BreakVector_Y) == 0x000118, "Member 'Cannon_C_ExecuteUbergraph_Cannon::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, CallFunc_BreakVector_Z) == 0x000120, "Member 'Cannon_C_ExecuteUbergraph_Cannon::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, K2Node_DynamicCast_AsTrain_Gus_Player) == 0x000128, "Member 'Cannon_C_ExecuteUbergraph_Cannon::K2Node_DynamicCast_AsTrain_Gus_Player' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, K2Node_DynamicCast_bSuccess) == 0x000130, "Member 'Cannon_C_ExecuteUbergraph_Cannon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000138, "Member 'Cannon_C_ExecuteUbergraph_Cannon::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, CallFunc_MakeVector_ReturnValue) == 0x000140, "Member 'Cannon_C_ExecuteUbergraph_Cannon::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, K2Node_DynamicCast_AsCommunication_BPI) == 0x000158, "Member 'Cannon_C_ExecuteUbergraph_Cannon::K2Node_DynamicCast_AsCommunication_BPI' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, K2Node_DynamicCast_bSuccess_1) == 0x000168, "Member 'Cannon_C_ExecuteUbergraph_Cannon::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, K2Node_InputAxisEvent_AxisValue_1) == 0x00016C, "Member 'Cannon_C_ExecuteUbergraph_Cannon::K2Node_InputAxisEvent_AxisValue_1' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000170, "Member 'Cannon_C_ExecuteUbergraph_Cannon::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000178, "Member 'Cannon_C_ExecuteUbergraph_Cannon::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000190, "Member 'Cannon_C_ExecuteUbergraph_Cannon::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, CallFunc_BreakRotator_Roll) == 0x0001A8, "Member 'Cannon_C_ExecuteUbergraph_Cannon::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, CallFunc_BreakRotator_Pitch) == 0x0001AC, "Member 'Cannon_C_ExecuteUbergraph_Cannon::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, CallFunc_BreakRotator_Yaw) == 0x0001B0, "Member 'Cannon_C_ExecuteUbergraph_Cannon::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0001B8, "Member 'Cannon_C_ExecuteUbergraph_Cannon::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, CallFunc_MakeRotator_ReturnValue) == 0x0001C0, "Member 'Cannon_C_ExecuteUbergraph_Cannon::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, CallFunc_K2_TeleportTo_ReturnValue) == 0x0001D8, "Member 'Cannon_C_ExecuteUbergraph_Cannon::CallFunc_K2_TeleportTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, CallFunc_MakeRotator_ReturnValue_1) == 0x0001E0, "Member 'Cannon_C_ExecuteUbergraph_Cannon::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, CallFunc_MakeTransform_ReturnValue_1) == 0x000200, "Member 'Cannon_C_ExecuteUbergraph_Cannon::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000260, "Member 'Cannon_C_ExecuteUbergraph_Cannon::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000278, "Member 'Cannon_C_ExecuteUbergraph_Cannon::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, CallFunc_GetPlayerController_ReturnValue) == 0x000280, "Member 'Cannon_C_ExecuteUbergraph_Cannon::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, K2Node_CustomEvent_OwningPlayer) == 0x000288, "Member 'Cannon_C_ExecuteUbergraph_Cannon::K2Node_CustomEvent_OwningPlayer' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, CallFunc_GetInstigator_ReturnValue) == 0x000290, "Member 'Cannon_C_ExecuteUbergraph_Cannon::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, CallFunc_Create_ReturnValue) == 0x000298, "Member 'Cannon_C_ExecuteUbergraph_Cannon::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, K2Node_CustomEvent_Target_4) == 0x0002A0, "Member 'Cannon_C_ExecuteUbergraph_Cannon::K2Node_CustomEvent_Target_4' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, K2Node_CustomEvent_Target_3) == 0x0002A8, "Member 'Cannon_C_ExecuteUbergraph_Cannon::K2Node_CustomEvent_Target_3' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, K2Node_CustomEvent_DestLocation) == 0x0002B0, "Member 'Cannon_C_ExecuteUbergraph_Cannon::K2Node_CustomEvent_DestLocation' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, K2Node_CustomEvent_DestRotation) == 0x0002C8, "Member 'Cannon_C_ExecuteUbergraph_Cannon::K2Node_CustomEvent_DestRotation' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, K2Node_CustomEvent_Target2) == 0x0002E0, "Member 'Cannon_C_ExecuteUbergraph_Cannon::K2Node_CustomEvent_Target2' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, K2Node_CustomEvent_InPawn_1) == 0x0002E8, "Member 'Cannon_C_ExecuteUbergraph_Cannon::K2Node_CustomEvent_InPawn_1' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, K2Node_CustomEvent_Spawn_Transform_Location) == 0x0002F0, "Member 'Cannon_C_ExecuteUbergraph_Cannon::K2Node_CustomEvent_Spawn_Transform_Location' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, K2Node_CustomEvent_Spawn_Transform_Rotation) == 0x000308, "Member 'Cannon_C_ExecuteUbergraph_Cannon::K2Node_CustomEvent_Spawn_Transform_Rotation' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, K2Node_CustomEvent_Owner) == 0x000320, "Member 'Cannon_C_ExecuteUbergraph_Cannon::K2Node_CustomEvent_Owner' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, CallFunc_IsValid_ReturnValue) == 0x000328, "Member 'Cannon_C_ExecuteUbergraph_Cannon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, CallFunc_MakeTransform_ReturnValue_2) == 0x000330, "Member 'Cannon_C_ExecuteUbergraph_Cannon::CallFunc_MakeTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000390, "Member 'Cannon_C_ExecuteUbergraph_Cannon::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cannon_C_ExecuteUbergraph_Cannon, CallFunc_K2_TeleportTo_ReturnValue_1) == 0x000398, "Member 'Cannon_C_ExecuteUbergraph_Cannon::CallFunc_K2_TeleportTo_ReturnValue_1' has a wrong offset!");
