#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChatMessageWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "AdvancedSessions_structs.hpp"


namespace SDK::Params
{

// Function ChatMessageWidget.ChatMessageWidget_C.GetText_0
// 0x0070 (0x0070 - 0x0000)
struct ChatMessageWidget_C_GetText_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0018)()
};
static_assert(alignof(ChatMessageWidget_C_GetText_0) == 0x000008, "Wrong alignment on ChatMessageWidget_C_GetText_0");
static_assert(sizeof(ChatMessageWidget_C_GetText_0) == 0x000070, "Wrong size on ChatMessageWidget_C_GetText_0");
static_assert(offsetof(ChatMessageWidget_C_GetText_0, ReturnValue) == 0x000000, "Member 'ChatMessageWidget_C_GetText_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatMessageWidget_C_GetText_0, CallFunc_Conv_TextToString_ReturnValue) == 0x000018, "Member 'ChatMessageWidget_C_GetText_0::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatMessageWidget_C_GetText_0, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000028, "Member 'ChatMessageWidget_C_GetText_0::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChatMessageWidget_C_GetText_0, CallFunc_Concat_StrStr_ReturnValue) == 0x000038, "Member 'ChatMessageWidget_C_GetText_0::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatMessageWidget_C_GetText_0, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000048, "Member 'ChatMessageWidget_C_GetText_0::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChatMessageWidget_C_GetText_0, CallFunc_Conv_StringToText_ReturnValue) == 0x000058, "Member 'ChatMessageWidget_C_GetText_0::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function ChatMessageWidget.ChatMessageWidget_C.GetColorAndOpacity_0
// 0x0088 (0x0088 - 0x0000)
struct ChatMessageWidget_C_GetColorAndOpacity_0 final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0014)(Parm, OutParm, ReturnParm)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0020(0x0014)()
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0048(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x005C(0x0014)()
	class FString                                 CallFunc_GetPlayerName_ReturnValue_1;              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChatMessageWidget_C_GetColorAndOpacity_0) == 0x000008, "Wrong alignment on ChatMessageWidget_C_GetColorAndOpacity_0");
static_assert(sizeof(ChatMessageWidget_C_GetColorAndOpacity_0) == 0x000088, "Wrong size on ChatMessageWidget_C_GetColorAndOpacity_0");
static_assert(offsetof(ChatMessageWidget_C_GetColorAndOpacity_0, ReturnValue) == 0x000000, "Member 'ChatMessageWidget_C_GetColorAndOpacity_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatMessageWidget_C_GetColorAndOpacity_0, CallFunc_GetPlayerState_ReturnValue) == 0x000018, "Member 'ChatMessageWidget_C_GetColorAndOpacity_0::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatMessageWidget_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateColor) == 0x000020, "Member 'ChatMessageWidget_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(ChatMessageWidget_C_GetColorAndOpacity_0, CallFunc_GetPlayerName_ReturnValue) == 0x000038, "Member 'ChatMessageWidget_C_GetColorAndOpacity_0::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatMessageWidget_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateColor_1) == 0x000048, "Member 'ChatMessageWidget_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(ChatMessageWidget_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateColor_2) == 0x00005C, "Member 'ChatMessageWidget_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(ChatMessageWidget_C_GetColorAndOpacity_0, CallFunc_GetPlayerName_ReturnValue_1) == 0x000070, "Member 'ChatMessageWidget_C_GetColorAndOpacity_0::CallFunc_GetPlayerName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChatMessageWidget_C_GetColorAndOpacity_0, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'ChatMessageWidget_C_GetColorAndOpacity_0::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatMessageWidget_C_GetColorAndOpacity_0, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000081, "Member 'ChatMessageWidget_C_GetColorAndOpacity_0::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function ChatMessageWidget.ChatMessageWidget_C.ExecuteUbergraph_ChatMessageWidget
// 0x0030 (0x0030 - 0x0000)
struct ChatMessageWidget_C_ExecuteUbergraph_ChatMessageWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBPUniqueNetId                         CallFunc_GetUniqueNetIDFromPlayerState_UniqueNetId; // 0x0008(0x0020)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidUniqueNetID_ReturnValue;           // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChatMessageWidget_C_ExecuteUbergraph_ChatMessageWidget) == 0x000008, "Wrong alignment on ChatMessageWidget_C_ExecuteUbergraph_ChatMessageWidget");
static_assert(sizeof(ChatMessageWidget_C_ExecuteUbergraph_ChatMessageWidget) == 0x000030, "Wrong size on ChatMessageWidget_C_ExecuteUbergraph_ChatMessageWidget");
static_assert(offsetof(ChatMessageWidget_C_ExecuteUbergraph_ChatMessageWidget, EntryPoint) == 0x000000, "Member 'ChatMessageWidget_C_ExecuteUbergraph_ChatMessageWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(ChatMessageWidget_C_ExecuteUbergraph_ChatMessageWidget, CallFunc_GetUniqueNetIDFromPlayerState_UniqueNetId) == 0x000008, "Member 'ChatMessageWidget_C_ExecuteUbergraph_ChatMessageWidget::CallFunc_GetUniqueNetIDFromPlayerState_UniqueNetId' has a wrong offset!");
static_assert(offsetof(ChatMessageWidget_C_ExecuteUbergraph_ChatMessageWidget, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'ChatMessageWidget_C_ExecuteUbergraph_ChatMessageWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatMessageWidget_C_ExecuteUbergraph_ChatMessageWidget, CallFunc_IsValidUniqueNetID_ReturnValue) == 0x000029, "Member 'ChatMessageWidget_C_ExecuteUbergraph_ChatMessageWidget::CallFunc_IsValidUniqueNetID_ReturnValue' has a wrong offset!");

}

