#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Circle_Bar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Circle_Bar.Circle_Bar_C
// 0x0020 (0x02B0 - 0x0290)
class UCircle_Bar_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_0;                                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CircleVar;                                         // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Percent;                                           // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Set_percent(double Percent_0);
	void PreConstruct(bool IsDesignTime);
	void GetBrush_0();
	void ExecuteUbergraph_Circle_Bar(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Circle_Bar_C">();
	}
	static class UCircle_Bar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCircle_Bar_C>();
	}
};
static_assert(alignof(UCircle_Bar_C) == 0x000008, "Wrong alignment on UCircle_Bar_C");
static_assert(sizeof(UCircle_Bar_C) == 0x0002B0, "Wrong size on UCircle_Bar_C");
static_assert(offsetof(UCircle_Bar_C, UberGraphFrame) == 0x000290, "Member 'UCircle_Bar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCircle_Bar_C, Image_0) == 0x000298, "Member 'UCircle_Bar_C::Image_0' has a wrong offset!");
static_assert(offsetof(UCircle_Bar_C, CircleVar) == 0x0002A0, "Member 'UCircle_Bar_C::CircleVar' has a wrong offset!");
static_assert(offsetof(UCircle_Bar_C, Percent) == 0x0002A8, "Member 'UCircle_Bar_C::Percent' has a wrong offset!");

}

