#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Communication_BPI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Communication_BPI.Communication_BPI_C.On_Vanished
// 0x0070 (0x0070 - 0x0000)
struct Communication_BPI_C_On_Vanished final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	class ACharacter*                             Real;                                              // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Communication_BPI_C_On_Vanished) == 0x000010, "Wrong alignment on Communication_BPI_C_On_Vanished");
static_assert(sizeof(Communication_BPI_C_On_Vanished) == 0x000070, "Wrong size on Communication_BPI_C_On_Vanished");
static_assert(offsetof(Communication_BPI_C_On_Vanished, Transform) == 0x000000, "Member 'Communication_BPI_C_On_Vanished::Transform' has a wrong offset!");
static_assert(offsetof(Communication_BPI_C_On_Vanished, Real) == 0x000060, "Member 'Communication_BPI_C_On_Vanished::Real' has a wrong offset!");

// Function Communication_BPI.Communication_BPI_C.On_Bannana
// 0x0020 (0x0020 - 0x0000)
struct Communication_BPI_C_On_Bannana final
{
public:
	struct FRotator                               NewParam;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      NewParam1;                                         // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Communication_BPI_C_On_Bannana) == 0x000008, "Wrong alignment on Communication_BPI_C_On_Bannana");
static_assert(sizeof(Communication_BPI_C_On_Bannana) == 0x000020, "Wrong size on Communication_BPI_C_On_Bannana");
static_assert(offsetof(Communication_BPI_C_On_Bannana, NewParam) == 0x000000, "Member 'Communication_BPI_C_On_Bannana::NewParam' has a wrong offset!");
static_assert(offsetof(Communication_BPI_C_On_Bannana, NewParam1) == 0x000018, "Member 'Communication_BPI_C_On_Bannana::NewParam1' has a wrong offset!");

}

