#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DamageNumberWidgetActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DamageNumberWidgetActor.DamageNumberWidgetActor_C
// 0x0020 (0x0298 - 0x0278)
class ADamageNumberWidgetActor_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetComponent*                       Widget;                                            // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        Damage;                                            // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ExecuteUbergraph_DamageNumberWidgetActor(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DamageNumberWidgetActor_C">();
	}
	static class ADamageNumberWidgetActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADamageNumberWidgetActor_C>();
	}
};
static_assert(alignof(ADamageNumberWidgetActor_C) == 0x000008, "Wrong alignment on ADamageNumberWidgetActor_C");
static_assert(sizeof(ADamageNumberWidgetActor_C) == 0x000298, "Wrong size on ADamageNumberWidgetActor_C");
static_assert(offsetof(ADamageNumberWidgetActor_C, UberGraphFrame) == 0x000278, "Member 'ADamageNumberWidgetActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ADamageNumberWidgetActor_C, Widget) == 0x000280, "Member 'ADamageNumberWidgetActor_C::Widget' has a wrong offset!");
static_assert(offsetof(ADamageNumberWidgetActor_C, DefaultSceneRoot) == 0x000288, "Member 'ADamageNumberWidgetActor_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ADamageNumberWidgetActor_C, Damage) == 0x000290, "Member 'ADamageNumberWidgetActor_C::Damage' has a wrong offset!");

}

