#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DamageNumber

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DamageNumber.DamageNumber_C
// 0x0020 (0x02B0 - 0x0290)
class UDamageNumber_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewAnimation;                                      // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_62;                                      // 0x02A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        Damage;                                            // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	class FText GetText_0();
	void ExecuteUbergraph_DamageNumber(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DamageNumber_C">();
	}
	static class UDamageNumber_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDamageNumber_C>();
	}
};
static_assert(alignof(UDamageNumber_C) == 0x000008, "Wrong alignment on UDamageNumber_C");
static_assert(sizeof(UDamageNumber_C) == 0x0002B0, "Wrong size on UDamageNumber_C");
static_assert(offsetof(UDamageNumber_C, UberGraphFrame) == 0x000290, "Member 'UDamageNumber_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDamageNumber_C, NewAnimation) == 0x000298, "Member 'UDamageNumber_C::NewAnimation' has a wrong offset!");
static_assert(offsetof(UDamageNumber_C, TextBlock_62) == 0x0002A0, "Member 'UDamageNumber_C::TextBlock_62' has a wrong offset!");
static_assert(offsetof(UDamageNumber_C, Damage) == 0x0002A8, "Member 'UDamageNumber_C::Damage' has a wrong offset!");

}

