#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Dash_hit

#include "Basic.hpp"


namespace SDK::Params
{

// Function Dash_hit.Dash_hit_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct Dash_hit_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dash_hit_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on Dash_hit_C_ReceiveActorBeginOverlap");
static_assert(sizeof(Dash_hit_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on Dash_hit_C_ReceiveActorBeginOverlap");
static_assert(offsetof(Dash_hit_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'Dash_hit_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function Dash_hit.Dash_hit_C.ExecuteUbergraph_Dash_hit
// 0x0020 (0x0020 - 0x0000)
struct Dash_hit_C_ExecuteUbergraph_Dash_hit final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ApplyDamage_ReturnValue;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dash_hit_C_ExecuteUbergraph_Dash_hit) == 0x000008, "Wrong alignment on Dash_hit_C_ExecuteUbergraph_Dash_hit");
static_assert(sizeof(Dash_hit_C_ExecuteUbergraph_Dash_hit) == 0x000020, "Wrong size on Dash_hit_C_ExecuteUbergraph_Dash_hit");
static_assert(offsetof(Dash_hit_C_ExecuteUbergraph_Dash_hit, EntryPoint) == 0x000000, "Member 'Dash_hit_C_ExecuteUbergraph_Dash_hit::EntryPoint' has a wrong offset!");
static_assert(offsetof(Dash_hit_C_ExecuteUbergraph_Dash_hit, K2Node_Event_OtherActor) == 0x000008, "Member 'Dash_hit_C_ExecuteUbergraph_Dash_hit::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(Dash_hit_C_ExecuteUbergraph_Dash_hit, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'Dash_hit_C_ExecuteUbergraph_Dash_hit::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dash_hit_C_ExecuteUbergraph_Dash_hit, CallFunc_ApplyDamage_ReturnValue) == 0x000018, "Member 'Dash_hit_C_ExecuteUbergraph_Dash_hit::CallFunc_ApplyDamage_ReturnValue' has a wrong offset!");

}

