#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeadSpectate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass DeadSpectate.DeadSpectate_C
// 0x0190 (0x04B0 - 0x0320)
class ADeadSpectate_C final : public ASpectatorPawn
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Pivot;                                             // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    SpringArm;                                         // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Camera;                                            // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_2_Alpha_C0808F644C0860B18B2F0AAD8DB44052; // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_2__Direction_C0808F644C0860B18B2F0AAD8DB44052; // 0x0344(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_345[0x3];                                      // 0x0345(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_2;                                        // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_Alpha_2264FC8F480104316241A3A009B40892; // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_2264FC8F480104316241A3A009B40892; // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_355[0x3];                                      // 0x0355(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Alpha_A120584C49363B9CAA9AC0B7EA86A893; // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_A120584C49363B9CAA9AC0B7EA86A893; // 0x0364(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_365[0x3];                                      // 0x0365(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Interp_Death_sEQUENCE_Alpha_1690C7EB4786B1606008348A26627332; // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Interp_Death_sEQUENCE__Direction_1690C7EB4786B1606008348A26627332; // 0x0374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_375[0x3];                                      // 0x0375(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Interp_Death_sEQUENCE;                             // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Dead_Fov_Alpha_D8B2FEC9498759C23D71238F90EB2046;   // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Dead_Fov__Direction_D8B2FEC9498759C23D71238F90EB2046; // 0x0384(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_385[0x3];                                      // 0x0385(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Dead_Fov;                                          // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpawnPoint_Dock1;                                  // 0x0390(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpawnPoint_Dock2;                                  // 0x03A8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Killed_By_ActorRef;                                // 0x03C0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              BorderHudAnim;                                     // 0x03C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          Condition;                                         // 0x03D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Followcam_;                                        // 0x03D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Menuabler_;                                        // 0x03DA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMenuOn;                                          // 0x03DB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Team;                                              // 0x03DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Equipped_weapon;                                   // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Equipped_weapon_2;                                 // 0x03E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   Player_Title;                                      // 0x03E8(0x0018)(Edit, BlueprintVisible, Net, ExposeOnSpawn)
	class ATrainGusPlayer_C*                      Gusref;                                            // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CTF_Red_Score;                                     // 0x0408(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         CTF_Blue_Score;                                    // 0x040C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class AHUD_BP_C*                              HudRef;                                            // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Kills;                                             // 0x0418(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_41C[0x4];                                      // 0x041C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SpawnPoint_Tutorial_Island_1;                      // 0x0420(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpawnPoint_Tutorial_Island_2;                      // 0x0438(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TDMER_Cannon_1;                                    // 0x0450(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TDMER_Cannon_2;                                    // 0x0468(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TDMER_Fort_1;                                      // 0x0480(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TDMER_Fort_2;                                      // 0x0498(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Title_Verification(const class FText& Title, class ADeadSpectate_C* User);
	void Timeline_2__UpdateFunc();
	void Timeline_2__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void Spawn_The_Widgets(class APlayerController* OwningPlayer);
	void Spawn_Gus_Tutorial_Island(class AController* Target, int32 My_team, class APlayerController* PlayerController, int32 Hat, int32 Title, int32 Equipped_weapon_0, int32 EquippedWeapon2, class APlayerState* Player_State, int32 Skin_Number);
	void Spawn_Gus_The_Spire_Docks(class AController* Target, int32 My_team, class APlayerController* PlayerController, int32 Hat, int32 Title, int32 Equipped_weapon_0, int32 EquippedWeapon2, class APlayerState* Player_State, int32 Skin_Number, const struct FVector& Spawn_Transform_Location);
	void Spawn_Gus_TDMer_Island(class AController* Target, int32 My_team, class APlayerController* PlayerController, int32 Hat, int32 Title, int32 Weapon_1, int32 Weapon_2, class APlayerState* Player_State, int32 Skin_Number);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void Interp_Death_sEQUENCE__UpdateFunc();
	void Interp_Death_sEQUENCE__FinishedFunc();
	void Facing_Forts(class AController* Target, int32 My_team, class APlayerController* PlayerController, int32 Hat, int32 Title, int32 Weapon_1, int32 Weapon_2, class APlayerState* Player_State, int32 Skin_Number);
	void ExecuteUbergraph_DeadSpectate(int32 EntryPoint);
	void Dead_Fov__UpdateFunc();
	void Dead_Fov__FinishedFunc();
	void Create_The_menu_widget(class APlayerController* OwningPlayer);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DeadSpectate_C">();
	}
	static class ADeadSpectate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADeadSpectate_C>();
	}
};
static_assert(alignof(ADeadSpectate_C) == 0x000008, "Wrong alignment on ADeadSpectate_C");
static_assert(sizeof(ADeadSpectate_C) == 0x0004B0, "Wrong size on ADeadSpectate_C");
static_assert(offsetof(ADeadSpectate_C, UberGraphFrame) == 0x000320, "Member 'ADeadSpectate_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, Pivot) == 0x000328, "Member 'ADeadSpectate_C::Pivot' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, SpringArm) == 0x000330, "Member 'ADeadSpectate_C::SpringArm' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, Camera) == 0x000338, "Member 'ADeadSpectate_C::Camera' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, Timeline_2_Alpha_C0808F644C0860B18B2F0AAD8DB44052) == 0x000340, "Member 'ADeadSpectate_C::Timeline_2_Alpha_C0808F644C0860B18B2F0AAD8DB44052' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, Timeline_2__Direction_C0808F644C0860B18B2F0AAD8DB44052) == 0x000344, "Member 'ADeadSpectate_C::Timeline_2__Direction_C0808F644C0860B18B2F0AAD8DB44052' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, Timeline_2) == 0x000348, "Member 'ADeadSpectate_C::Timeline_2' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, Timeline_1_Alpha_2264FC8F480104316241A3A009B40892) == 0x000350, "Member 'ADeadSpectate_C::Timeline_1_Alpha_2264FC8F480104316241A3A009B40892' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, Timeline_1__Direction_2264FC8F480104316241A3A009B40892) == 0x000354, "Member 'ADeadSpectate_C::Timeline_1__Direction_2264FC8F480104316241A3A009B40892' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, Timeline_1) == 0x000358, "Member 'ADeadSpectate_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, Timeline_0_Alpha_A120584C49363B9CAA9AC0B7EA86A893) == 0x000360, "Member 'ADeadSpectate_C::Timeline_0_Alpha_A120584C49363B9CAA9AC0B7EA86A893' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, Timeline_0__Direction_A120584C49363B9CAA9AC0B7EA86A893) == 0x000364, "Member 'ADeadSpectate_C::Timeline_0__Direction_A120584C49363B9CAA9AC0B7EA86A893' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, Timeline_0) == 0x000368, "Member 'ADeadSpectate_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, Interp_Death_sEQUENCE_Alpha_1690C7EB4786B1606008348A26627332) == 0x000370, "Member 'ADeadSpectate_C::Interp_Death_sEQUENCE_Alpha_1690C7EB4786B1606008348A26627332' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, Interp_Death_sEQUENCE__Direction_1690C7EB4786B1606008348A26627332) == 0x000374, "Member 'ADeadSpectate_C::Interp_Death_sEQUENCE__Direction_1690C7EB4786B1606008348A26627332' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, Interp_Death_sEQUENCE) == 0x000378, "Member 'ADeadSpectate_C::Interp_Death_sEQUENCE' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, Dead_Fov_Alpha_D8B2FEC9498759C23D71238F90EB2046) == 0x000380, "Member 'ADeadSpectate_C::Dead_Fov_Alpha_D8B2FEC9498759C23D71238F90EB2046' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, Dead_Fov__Direction_D8B2FEC9498759C23D71238F90EB2046) == 0x000384, "Member 'ADeadSpectate_C::Dead_Fov__Direction_D8B2FEC9498759C23D71238F90EB2046' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, Dead_Fov) == 0x000388, "Member 'ADeadSpectate_C::Dead_Fov' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, SpawnPoint_Dock1) == 0x000390, "Member 'ADeadSpectate_C::SpawnPoint_Dock1' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, SpawnPoint_Dock2) == 0x0003A8, "Member 'ADeadSpectate_C::SpawnPoint_Dock2' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, Killed_By_ActorRef) == 0x0003C0, "Member 'ADeadSpectate_C::Killed_By_ActorRef' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, BorderHudAnim) == 0x0003C8, "Member 'ADeadSpectate_C::BorderHudAnim' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, Condition) == 0x0003D8, "Member 'ADeadSpectate_C::Condition' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, Followcam_) == 0x0003D9, "Member 'ADeadSpectate_C::Followcam_' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, Menuabler_) == 0x0003DA, "Member 'ADeadSpectate_C::Menuabler_' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, IsMenuOn) == 0x0003DB, "Member 'ADeadSpectate_C::IsMenuOn' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, Team) == 0x0003DC, "Member 'ADeadSpectate_C::Team' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, Equipped_weapon) == 0x0003E0, "Member 'ADeadSpectate_C::Equipped_weapon' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, Equipped_weapon_2) == 0x0003E4, "Member 'ADeadSpectate_C::Equipped_weapon_2' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, Player_Title) == 0x0003E8, "Member 'ADeadSpectate_C::Player_Title' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, Gusref) == 0x000400, "Member 'ADeadSpectate_C::Gusref' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, CTF_Red_Score) == 0x000408, "Member 'ADeadSpectate_C::CTF_Red_Score' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, CTF_Blue_Score) == 0x00040C, "Member 'ADeadSpectate_C::CTF_Blue_Score' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, HudRef) == 0x000410, "Member 'ADeadSpectate_C::HudRef' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, Kills) == 0x000418, "Member 'ADeadSpectate_C::Kills' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, SpawnPoint_Tutorial_Island_1) == 0x000420, "Member 'ADeadSpectate_C::SpawnPoint_Tutorial_Island_1' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, SpawnPoint_Tutorial_Island_2) == 0x000438, "Member 'ADeadSpectate_C::SpawnPoint_Tutorial_Island_2' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, TDMER_Cannon_1) == 0x000450, "Member 'ADeadSpectate_C::TDMER_Cannon_1' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, TDMER_Cannon_2) == 0x000468, "Member 'ADeadSpectate_C::TDMER_Cannon_2' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, TDMER_Fort_1) == 0x000480, "Member 'ADeadSpectate_C::TDMER_Fort_1' has a wrong offset!");
static_assert(offsetof(ADeadSpectate_C, TDMER_Fort_2) == 0x000498, "Member 'ADeadSpectate_C::TDMER_Fort_2' has a wrong offset!");

}

