#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Explosion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Explosion.Explosion_C
// 0x0030 (0x02A8 - 0x0278)
class AExplosion_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Sphere1;                                           // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URadialForceComponent*                  RadialForce;                                       // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Team_Actor;                                        // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void Make_Sphere_Strace_Damage(class AActor* DamageCauser, const struct FVector& Actor_Location);
	void ExecuteUbergraph_Explosion(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Explosion_C">();
	}
	static class AExplosion_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AExplosion_C>();
	}
};
static_assert(alignof(AExplosion_C) == 0x000008, "Wrong alignment on AExplosion_C");
static_assert(sizeof(AExplosion_C) == 0x0002A8, "Wrong size on AExplosion_C");
static_assert(offsetof(AExplosion_C, UberGraphFrame) == 0x000278, "Member 'AExplosion_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AExplosion_C, Sphere1) == 0x000280, "Member 'AExplosion_C::Sphere1' has a wrong offset!");
static_assert(offsetof(AExplosion_C, Sphere) == 0x000288, "Member 'AExplosion_C::Sphere' has a wrong offset!");
static_assert(offsetof(AExplosion_C, RadialForce) == 0x000290, "Member 'AExplosion_C::RadialForce' has a wrong offset!");
static_assert(offsetof(AExplosion_C, DefaultSceneRoot) == 0x000298, "Member 'AExplosion_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AExplosion_C, Team_Actor) == 0x0002A0, "Member 'AExplosion_C::Team_Actor' has a wrong offset!");

}

