#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EyeOfReach_Projectile_Server

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EyeOfReach_Projectile_Server.EyeOfReach_Projectile_Server_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct EyeOfReach_Projectile_Server_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EyeOfReach_Projectile_Server_C_ReceiveTick) == 0x000004, "Wrong alignment on EyeOfReach_Projectile_Server_C_ReceiveTick");
static_assert(sizeof(EyeOfReach_Projectile_Server_C_ReceiveTick) == 0x000004, "Wrong size on EyeOfReach_Projectile_Server_C_ReceiveTick");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'EyeOfReach_Projectile_Server_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function EyeOfReach_Projectile_Server.EyeOfReach_Projectile_Server_C.ReceiveHit
// 0x0150 (0x0150 - 0x0000)
struct EyeOfReach_Projectile_Server_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfMoved;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0038(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0050(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0068(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(EyeOfReach_Projectile_Server_C_ReceiveHit) == 0x000008, "Wrong alignment on EyeOfReach_Projectile_Server_C_ReceiveHit");
static_assert(sizeof(EyeOfReach_Projectile_Server_C_ReceiveHit) == 0x000150, "Wrong size on EyeOfReach_Projectile_Server_C_ReceiveHit");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ReceiveHit, MyComp) == 0x000000, "Member 'EyeOfReach_Projectile_Server_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ReceiveHit, Other) == 0x000008, "Member 'EyeOfReach_Projectile_Server_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ReceiveHit, OtherComp) == 0x000010, "Member 'EyeOfReach_Projectile_Server_C_ReceiveHit::OtherComp' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ReceiveHit, bSelfMoved) == 0x000018, "Member 'EyeOfReach_Projectile_Server_C_ReceiveHit::bSelfMoved' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ReceiveHit, HitLocation) == 0x000020, "Member 'EyeOfReach_Projectile_Server_C_ReceiveHit::HitLocation' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ReceiveHit, HitNormal) == 0x000038, "Member 'EyeOfReach_Projectile_Server_C_ReceiveHit::HitNormal' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ReceiveHit, NormalImpulse) == 0x000050, "Member 'EyeOfReach_Projectile_Server_C_ReceiveHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ReceiveHit, Hit) == 0x000068, "Member 'EyeOfReach_Projectile_Server_C_ReceiveHit::Hit' has a wrong offset!");

// Function EyeOfReach_Projectile_Server.EyeOfReach_Projectile_Server_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct EyeOfReach_Projectile_Server_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EyeOfReach_Projectile_Server_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on EyeOfReach_Projectile_Server_C_ReceiveActorBeginOverlap");
static_assert(sizeof(EyeOfReach_Projectile_Server_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on EyeOfReach_Projectile_Server_C_ReceiveActorBeginOverlap");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'EyeOfReach_Projectile_Server_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function EyeOfReach_Projectile_Server.EyeOfReach_Projectile_Server_C.ExecuteUbergraph_EyeOfReach_Projectile_Server
// 0x0660 (0x0660 - 0x0000)
struct EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player_1;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player_2;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0070(0x0060)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGunKnockback_C*                        CallFunc_FinishSpawningActor_ReturnValue;          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player_3;           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player_4;           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetInstigatorController_ReturnValue;      // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player_5;           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0170(0x0010)(ConstParm, ReferenceParm)
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_3;                   // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ApplyDamage_ReturnValue;                  // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player_6;           // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A2[0x6];                                      // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player_7;           // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player_8;           // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0240(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0329(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32A[0x2];                                      // 0x032A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0338(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0350(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0368(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0380(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x03A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC[0x4];                                      // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x03D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x03E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_401[0x7];                                      // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0408(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x0420(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0438(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0450(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0468(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0480(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0569(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x056A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56B[0x1];                                      // 0x056B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x056C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0570(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_574[0x4];                                      // 0x0574(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0578(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0590(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x05A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x05C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x05E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x05F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_1;                // 0x05F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0600(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x0604(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0608(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60C[0x4];                                      // 0x060C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0610(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0628(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0640(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue;         // 0x0658(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server) == 0x000010, "Wrong alignment on EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server");
static_assert(sizeof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server) == 0x000660, "Wrong size on EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, EntryPoint) == 0x000000, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::EntryPoint' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, K2Node_DynamicCast_AsTrain_Gus_Player) == 0x000008, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::K2Node_DynamicCast_AsTrain_Gus_Player' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, K2Node_DynamicCast_AsTrain_Gus_Player_1) == 0x000018, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::K2Node_DynamicCast_AsTrain_Gus_Player_1' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, K2Node_DynamicCast_bSuccess_1) == 0x000020, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000021, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, K2Node_DynamicCast_AsTrain_Gus_Player_2) == 0x000040, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::K2Node_DynamicCast_AsTrain_Gus_Player_2' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, K2Node_DynamicCast_bSuccess_2) == 0x000048, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000050, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_MakeTransform_ReturnValue) == 0x000070, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000D0, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000D8, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000E0, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_GetOwner_ReturnValue) == 0x0000E8, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, K2Node_DynamicCast_AsTrain_Gus_Player_3) == 0x0000F0, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::K2Node_DynamicCast_AsTrain_Gus_Player_3' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, K2Node_DynamicCast_bSuccess_3) == 0x0000F8, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_GetOwner_ReturnValue_1) == 0x000100, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, K2Node_DynamicCast_AsTrain_Gus_Player_4) == 0x000108, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::K2Node_DynamicCast_AsTrain_Gus_Player_4' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, K2Node_DynamicCast_bSuccess_4) == 0x000110, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, K2Node_Event_DeltaSeconds) == 0x000114, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000118, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_GetOwner_ReturnValue_2) == 0x000130, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_GetInstigatorController_ReturnValue) == 0x000138, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_GetInstigatorController_ReturnValue' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, K2Node_DynamicCast_AsTrain_Gus_Player_5) == 0x000140, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::K2Node_DynamicCast_AsTrain_Gus_Player_5' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, K2Node_DynamicCast_bSuccess_5) == 0x000148, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, K2Node_DynamicCast_AsPlayer_Controller) == 0x000150, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, K2Node_DynamicCast_bSuccess_6) == 0x000158, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_Conv_BoolToString_ReturnValue) == 0x000160, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, Temp_object_Variable) == 0x000170, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, K2Node_CustomEvent_DamagedActor) == 0x000180, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_GetOwner_ReturnValue_3) == 0x000188, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_GetOwner_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_ApplyDamage_ReturnValue) == 0x000190, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_ApplyDamage_ReturnValue' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, Temp_bool_Has_Been_Initd_Variable) == 0x000194, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, K2Node_DynamicCast_AsTrain_Gus_Player_6) == 0x000198, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::K2Node_DynamicCast_AsTrain_Gus_Player_6' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, K2Node_DynamicCast_bSuccess_7) == 0x0001A0, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, Temp_bool_IsClosed_Variable) == 0x0001A1, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, K2Node_Event_OtherActor) == 0x0001A8, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0001B0, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, K2Node_DynamicCast_AsTrain_Gus_Player_7) == 0x0001B8, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::K2Node_DynamicCast_AsTrain_Gus_Player_7' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, K2Node_DynamicCast_bSuccess_8) == 0x0001C0, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, K2Node_DynamicCast_AsTrain_Gus_Player_8) == 0x0001C8, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::K2Node_DynamicCast_AsTrain_Gus_Player_8' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, K2Node_DynamicCast_bSuccess_9) == 0x0001D0, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, K2Node_Event_MyComp) == 0x0001D8, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, K2Node_Event_Other) == 0x0001E0, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, K2Node_Event_OtherComp) == 0x0001E8, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, K2Node_Event_bSelfMoved) == 0x0001F0, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, K2Node_Event_HitLocation) == 0x0001F8, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, K2Node_Event_HitNormal) == 0x000210, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, K2Node_Event_NormalImpulse) == 0x000228, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, K2Node_Event_Hit) == 0x000240, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_BreakHitResult_bBlockingHit) == 0x000328, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_BreakHitResult_bInitialOverlap) == 0x000329, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_BreakHitResult_Time) == 0x00032C, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_BreakHitResult_Distance) == 0x000330, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_BreakHitResult_Location) == 0x000338, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_BreakHitResult_ImpactPoint) == 0x000350, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_BreakHitResult_Normal) == 0x000368, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_BreakHitResult_ImpactNormal) == 0x000380, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_BreakHitResult_PhysMat) == 0x000398, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_BreakHitResult_HitActor) == 0x0003A0, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_BreakHitResult_HitComponent) == 0x0003A8, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_BreakHitResult_HitBoneName) == 0x0003B0, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_BreakHitResult_BoneName) == 0x0003B8, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_BreakHitResult_HitItem) == 0x0003C0, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_BreakHitResult_ElementIndex) == 0x0003C4, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_BreakHitResult_FaceIndex) == 0x0003C8, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_BreakHitResult_TraceStart) == 0x0003D0, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_BreakHitResult_TraceEnd) == 0x0003E8, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000400, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000408, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_K2_GetActorRotation_ReturnValue_1) == 0x000420, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_K2_GetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_GetForwardVector_ReturnValue) == 0x000438, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000450, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_Add_VectorVector_ReturnValue) == 0x000468, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_LineTraceSingle_OutHit) == 0x000480, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_LineTraceSingle_ReturnValue) == 0x000568, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_BreakHitResult_bBlockingHit_1) == 0x000569, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x00056A, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_BreakHitResult_Time_1) == 0x00056C, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_BreakHitResult_Distance_1) == 0x000570, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_BreakHitResult_Location_1) == 0x000578, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_BreakHitResult_ImpactPoint_1) == 0x000590, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_BreakHitResult_Normal_1) == 0x0005A8, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_BreakHitResult_ImpactNormal_1) == 0x0005C0, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_BreakHitResult_PhysMat_1) == 0x0005D8, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_BreakHitResult_HitActor_1) == 0x0005E0, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_BreakHitResult_HitComponent_1) == 0x0005E8, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_BreakHitResult_HitBoneName_1) == 0x0005F0, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_BreakHitResult_BoneName_1) == 0x0005F8, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_BreakHitResult_BoneName_1' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_BreakHitResult_HitItem_1) == 0x000600, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_BreakHitResult_ElementIndex_1) == 0x000604, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_BreakHitResult_FaceIndex_1) == 0x000608, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_BreakHitResult_TraceStart_1) == 0x000610, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_BreakHitResult_TraceEnd_1) == 0x000628, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000640, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server, CallFunc_SpawnDecalAtLocation_ReturnValue) == 0x000658, "Member 'EyeOfReach_Projectile_Server_C_ExecuteUbergraph_EyeOfReach_Projectile_Server::CallFunc_SpawnDecalAtLocation_ReturnValue' has a wrong offset!");

// Function EyeOfReach_Projectile_Server.EyeOfReach_Projectile_Server_C.Damade2
// 0x0008 (0x0008 - 0x0000)
struct EyeOfReach_Projectile_Server_C_Damade2 final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EyeOfReach_Projectile_Server_C_Damade2) == 0x000008, "Wrong alignment on EyeOfReach_Projectile_Server_C_Damade2");
static_assert(sizeof(EyeOfReach_Projectile_Server_C_Damade2) == 0x000008, "Wrong size on EyeOfReach_Projectile_Server_C_Damade2");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_Damade2, DamagedActor) == 0x000000, "Member 'EyeOfReach_Projectile_Server_C_Damade2::DamagedActor' has a wrong offset!");

// Function EyeOfReach_Projectile_Server.EyeOfReach_Projectile_Server_C.Damade
// 0x0008 (0x0008 - 0x0000)
struct EyeOfReach_Projectile_Server_C_Damade final
{
public:
	class AActor*                                 DamagedActor1;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EyeOfReach_Projectile_Server_C_Damade) == 0x000008, "Wrong alignment on EyeOfReach_Projectile_Server_C_Damade");
static_assert(sizeof(EyeOfReach_Projectile_Server_C_Damade) == 0x000008, "Wrong size on EyeOfReach_Projectile_Server_C_Damade");
static_assert(offsetof(EyeOfReach_Projectile_Server_C_Damade, DamagedActor1) == 0x000000, "Member 'EyeOfReach_Projectile_Server_C_Damade::DamagedActor1' has a wrong offset!");

}

