#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FFAScoreBoard

#include "Basic.hpp"


namespace SDK::Params
{

// Function FFAScoreBoard.FFAScoreBoard_C.ExecuteUbergraph_FFAScoreBoard
// 0x0080 (0x0080 - 0x0000)
struct FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFFAScoreboardSpot_C*                   CallFunc_Create_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MaxOfIntArray_IndexOfMaxValue;            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MaxOfIntArray_MaxValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFFAScoreboardSpot_C*                   CallFunc_Array_Get_Item_1;                         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard) == 0x000008, "Wrong alignment on FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard");
static_assert(sizeof(FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard) == 0x000080, "Wrong size on FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard");
static_assert(offsetof(FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard, EntryPoint) == 0x000000, "Member 'FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard::EntryPoint' has a wrong offset!");
static_assert(offsetof(FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard, Temp_int_Array_Index_Variable) == 0x000004, "Member 'FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard, CallFunc_GetGameState_ReturnValue) == 0x000010, "Member 'FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard, CallFunc_GetPlayerPawn_ReturnValue) == 0x000018, "Member 'FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard, CallFunc_Array_Get_Item) == 0x000020, "Member 'FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00002C, "Member 'FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard, CallFunc_Less_IntInt_ReturnValue) == 0x00002D, "Member 'FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard, K2Node_DynamicCast_AsPlayer_State_BP) == 0x000030, "Member 'FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard::K2Node_DynamicCast_AsPlayer_State_BP' has a wrong offset!");
static_assert(offsetof(FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard, CallFunc_GetPlayerName_ReturnValue) == 0x000040, "Member 'FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard, CallFunc_Conv_StringToName_ReturnValue) == 0x000050, "Member 'FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard, CallFunc_Create_ReturnValue) == 0x000058, "Member 'FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000060, "Member 'FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard, CallFunc_MaxOfIntArray_IndexOfMaxValue) == 0x000064, "Member 'FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard::CallFunc_MaxOfIntArray_IndexOfMaxValue' has a wrong offset!");
static_assert(offsetof(FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard, CallFunc_MaxOfIntArray_MaxValue) == 0x000068, "Member 'FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard::CallFunc_MaxOfIntArray_MaxValue' has a wrong offset!");
static_assert(offsetof(FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard, CallFunc_Array_Get_Item_1) == 0x000070, "Member 'FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard, CallFunc_AddChild_ReturnValue) == 0x000078, "Member 'FFAScoreBoard_C_ExecuteUbergraph_FFAScoreBoard::CallFunc_AddChild_ReturnValue' has a wrong offset!");

}

