#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FFAScoreBoard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FFAScoreBoard.FFAScoreBoard_C
// 0x0058 (0x02E8 - 0x0290)
class UFFAScoreBoard_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel_39;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_50;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsOwner_;                                          // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFFAScoreboardSpot_C*>           ScoreboardRowArray;                                // 0x02B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<int32>                                 Kill_Count_Array;                                  // 0x02C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         IndexWidthManValue;                                // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              UpdateFFAScoreboard_Widget;                        // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Update_Scoreboard();
	void ExecuteUbergraph_FFAScoreBoard(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FFAScoreBoard_C">();
	}
	static class UFFAScoreBoard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFFAScoreBoard_C>();
	}
};
static_assert(alignof(UFFAScoreBoard_C) == 0x000008, "Wrong alignment on UFFAScoreBoard_C");
static_assert(sizeof(UFFAScoreBoard_C) == 0x0002E8, "Wrong size on UFFAScoreBoard_C");
static_assert(offsetof(UFFAScoreBoard_C, UberGraphFrame) == 0x000290, "Member 'UFFAScoreBoard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFFAScoreBoard_C, CanvasPanel_39) == 0x000298, "Member 'UFFAScoreBoard_C::CanvasPanel_39' has a wrong offset!");
static_assert(offsetof(UFFAScoreBoard_C, VerticalBox_50) == 0x0002A0, "Member 'UFFAScoreBoard_C::VerticalBox_50' has a wrong offset!");
static_assert(offsetof(UFFAScoreBoard_C, IsOwner_) == 0x0002A8, "Member 'UFFAScoreBoard_C::IsOwner_' has a wrong offset!");
static_assert(offsetof(UFFAScoreBoard_C, ScoreboardRowArray) == 0x0002B0, "Member 'UFFAScoreBoard_C::ScoreboardRowArray' has a wrong offset!");
static_assert(offsetof(UFFAScoreBoard_C, Kill_Count_Array) == 0x0002C0, "Member 'UFFAScoreBoard_C::Kill_Count_Array' has a wrong offset!");
static_assert(offsetof(UFFAScoreBoard_C, IndexWidthManValue) == 0x0002D0, "Member 'UFFAScoreBoard_C::IndexWidthManValue' has a wrong offset!");
static_assert(offsetof(UFFAScoreBoard_C, UpdateFFAScoreboard_Widget) == 0x0002D8, "Member 'UFFAScoreBoard_C::UpdateFFAScoreboard_Widget' has a wrong offset!");

}

