#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Flintlock_Projectile_Server

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Flintlock_Projectile_Server.Flintlock_Projectile_Server_C
// 0x01C8 (0x0440 - 0x0278)
class AFlintlock_Projectile_Server_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      BulletWithTrail;                                   // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URadialForceComponent*                  RadialForce;                                       // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   cannonball;                                        // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UProjectileMovementComponent*           Projectile;                                        // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       CollisionComponent;                                // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Spawn_Transform;                                   // 0x02B0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Condition;                                         // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHUDgus_C*                              HudRef;                                            // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                OtherTeam;                                         // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                OwnerTeam;                                         // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Teammate;                                          // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Damage_done;                                       // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Hit_Actor;                                         // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hit_gentlemen;                                     // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ImDone;                                            // 0x0351(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_352[0x6];                                      // 0x0352(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             Hit_Result;                                        // 0x0358(0x00E8)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)

public:
	void ReceiveTick(float DeltaSeconds);
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ReceiveBeginPlay();
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ExecuteUbergraph_Flintlock_Projectile_Server(int32 EntryPoint);
	void Damade(class AActor* DamagedActor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Flintlock_Projectile_Server_C">();
	}
	static class AFlintlock_Projectile_Server_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFlintlock_Projectile_Server_C>();
	}
};
static_assert(alignof(AFlintlock_Projectile_Server_C) == 0x000010, "Wrong alignment on AFlintlock_Projectile_Server_C");
static_assert(sizeof(AFlintlock_Projectile_Server_C) == 0x000440, "Wrong size on AFlintlock_Projectile_Server_C");
static_assert(offsetof(AFlintlock_Projectile_Server_C, UberGraphFrame) == 0x000278, "Member 'AFlintlock_Projectile_Server_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AFlintlock_Projectile_Server_C, BulletWithTrail) == 0x000280, "Member 'AFlintlock_Projectile_Server_C::BulletWithTrail' has a wrong offset!");
static_assert(offsetof(AFlintlock_Projectile_Server_C, RadialForce) == 0x000288, "Member 'AFlintlock_Projectile_Server_C::RadialForce' has a wrong offset!");
static_assert(offsetof(AFlintlock_Projectile_Server_C, Arrow) == 0x000290, "Member 'AFlintlock_Projectile_Server_C::Arrow' has a wrong offset!");
static_assert(offsetof(AFlintlock_Projectile_Server_C, cannonball) == 0x000298, "Member 'AFlintlock_Projectile_Server_C::cannonball' has a wrong offset!");
static_assert(offsetof(AFlintlock_Projectile_Server_C, Projectile) == 0x0002A0, "Member 'AFlintlock_Projectile_Server_C::Projectile' has a wrong offset!");
static_assert(offsetof(AFlintlock_Projectile_Server_C, CollisionComponent) == 0x0002A8, "Member 'AFlintlock_Projectile_Server_C::CollisionComponent' has a wrong offset!");
static_assert(offsetof(AFlintlock_Projectile_Server_C, Spawn_Transform) == 0x0002B0, "Member 'AFlintlock_Projectile_Server_C::Spawn_Transform' has a wrong offset!");
static_assert(offsetof(AFlintlock_Projectile_Server_C, Condition) == 0x000310, "Member 'AFlintlock_Projectile_Server_C::Condition' has a wrong offset!");
static_assert(offsetof(AFlintlock_Projectile_Server_C, HudRef) == 0x000318, "Member 'AFlintlock_Projectile_Server_C::HudRef' has a wrong offset!");
static_assert(offsetof(AFlintlock_Projectile_Server_C, OtherTeam) == 0x000320, "Member 'AFlintlock_Projectile_Server_C::OtherTeam' has a wrong offset!");
static_assert(offsetof(AFlintlock_Projectile_Server_C, OwnerTeam) == 0x000328, "Member 'AFlintlock_Projectile_Server_C::OwnerTeam' has a wrong offset!");
static_assert(offsetof(AFlintlock_Projectile_Server_C, Teammate) == 0x000330, "Member 'AFlintlock_Projectile_Server_C::Teammate' has a wrong offset!");
static_assert(offsetof(AFlintlock_Projectile_Server_C, Damage_done) == 0x000338, "Member 'AFlintlock_Projectile_Server_C::Damage_done' has a wrong offset!");
static_assert(offsetof(AFlintlock_Projectile_Server_C, Hit_Actor) == 0x000340, "Member 'AFlintlock_Projectile_Server_C::Hit_Actor' has a wrong offset!");
static_assert(offsetof(AFlintlock_Projectile_Server_C, Actor) == 0x000348, "Member 'AFlintlock_Projectile_Server_C::Actor' has a wrong offset!");
static_assert(offsetof(AFlintlock_Projectile_Server_C, Hit_gentlemen) == 0x000350, "Member 'AFlintlock_Projectile_Server_C::Hit_gentlemen' has a wrong offset!");
static_assert(offsetof(AFlintlock_Projectile_Server_C, ImDone) == 0x000351, "Member 'AFlintlock_Projectile_Server_C::ImDone' has a wrong offset!");
static_assert(offsetof(AFlintlock_Projectile_Server_C, Hit_Result) == 0x000358, "Member 'AFlintlock_Projectile_Server_C::Hit_Result' has a wrong offset!");

}

