#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FPS_Arms_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass FPS_Arms_AnimBP.FPS_Arms_AnimBP_C
// 0x0210 (0x0560 - 0x0350)
class UFPS_Arms_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0358(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0360(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0368(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0388(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x03B0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x03D8(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0418(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0438(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0478(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0498(0x00B8)()
	bool                                          Is_Firing;                                         // 0x0550(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnNewFunction_0(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& Node);
	void ExecuteUbergraph_FPS_Arms_AnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FPS_Arms_AnimBP_C">();
	}
	static class UFPS_Arms_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFPS_Arms_AnimBP_C>();
	}
};
static_assert(alignof(UFPS_Arms_AnimBP_C) == 0x000010, "Wrong alignment on UFPS_Arms_AnimBP_C");
static_assert(sizeof(UFPS_Arms_AnimBP_C) == 0x000560, "Wrong size on UFPS_Arms_AnimBP_C");
static_assert(offsetof(UFPS_Arms_AnimBP_C, UberGraphFrame) == 0x000350, "Member 'UFPS_Arms_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFPS_Arms_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000358, "Member 'UFPS_Arms_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UFPS_Arms_AnimBP_C, AnimBlueprintExtension_Base) == 0x000360, "Member 'UFPS_Arms_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UFPS_Arms_AnimBP_C, AnimGraphNode_Root) == 0x000368, "Member 'UFPS_Arms_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UFPS_Arms_AnimBP_C, AnimGraphNode_TransitionResult_1) == 0x000388, "Member 'UFPS_Arms_AnimBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UFPS_Arms_AnimBP_C, AnimGraphNode_TransitionResult) == 0x0003B0, "Member 'UFPS_Arms_AnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UFPS_Arms_AnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x0003D8, "Member 'UFPS_Arms_AnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UFPS_Arms_AnimBP_C, AnimGraphNode_StateResult_1) == 0x000418, "Member 'UFPS_Arms_AnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UFPS_Arms_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x000438, "Member 'UFPS_Arms_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UFPS_Arms_AnimBP_C, AnimGraphNode_StateResult) == 0x000478, "Member 'UFPS_Arms_AnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UFPS_Arms_AnimBP_C, AnimGraphNode_StateMachine) == 0x000498, "Member 'UFPS_Arms_AnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UFPS_Arms_AnimBP_C, Is_Firing) == 0x000550, "Member 'UFPS_Arms_AnimBP_C::Is_Firing' has a wrong offset!");

}

