#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "AdvancedSessions_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GameMenu.GameMenu_C
// 0x00B8 (0x0348 - 0x0290)
class UGameMenu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       StartAnim;                                         // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       StartHovered;                                      // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                AppearanceButton;                                  // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAppearanceMaster_C*                    AppearanceMaster;                                  // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                BackButtonOptions;                                 // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBlackListMenu_C*                       BlackListMenu;                                     // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ContinueBtn;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Countdown;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ExitBtn;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ExitWeapon;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                KickButton;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKickMenu_C*                            KickMenu;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             KickText;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                LoadoutButton;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                OptionsBtn;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOptionsMaster_C*                       OptionsMaster;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_0;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWeapon_choosing_1_C*                   Weapon_choosing_1;                                 // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Cosmetics_Open_;                                   // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Weapons_Open_;                                     // 0x0331(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Authority;                                         // 0x0332(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Ongoing_vote_;                                     // 0x0333(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Counter;                                           // 0x0334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Skybunger;                                         // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Open_Loadout();
	void Open_Appearance_Menu();
	void OnSuccess_7A9A90F44D7A768593F288932A4645A6();
	void OnFailure_7A9A90F44D7A768593F288932A4645A6();
	void ExecuteUbergraph_GameMenu(int32 EntryPoint);
	void Counter_skybuddy(int32 Counter_0, bool Ongoing_vote__0);
	void Construct();
	void BndEvt__MainMenu_StartBtn_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__MainMenu_OptionsBtn_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__MainMenu_ExitBtn_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__GameMenu_LoadoutButton_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__GameMenu_KickButton_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__GameMenu_ExitWeapon_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__GameMenu_BackButtonOptions_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__GameMenu_AppearanceButton_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GameMenu_C">();
	}
	static class UGameMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameMenu_C>();
	}
};
static_assert(alignof(UGameMenu_C) == 0x000008, "Wrong alignment on UGameMenu_C");
static_assert(sizeof(UGameMenu_C) == 0x000348, "Wrong size on UGameMenu_C");
static_assert(offsetof(UGameMenu_C, UberGraphFrame) == 0x000290, "Member 'UGameMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGameMenu_C, StartAnim) == 0x000298, "Member 'UGameMenu_C::StartAnim' has a wrong offset!");
static_assert(offsetof(UGameMenu_C, StartHovered) == 0x0002A0, "Member 'UGameMenu_C::StartHovered' has a wrong offset!");
static_assert(offsetof(UGameMenu_C, AppearanceButton) == 0x0002A8, "Member 'UGameMenu_C::AppearanceButton' has a wrong offset!");
static_assert(offsetof(UGameMenu_C, AppearanceMaster) == 0x0002B0, "Member 'UGameMenu_C::AppearanceMaster' has a wrong offset!");
static_assert(offsetof(UGameMenu_C, BackButtonOptions) == 0x0002B8, "Member 'UGameMenu_C::BackButtonOptions' has a wrong offset!");
static_assert(offsetof(UGameMenu_C, BlackListMenu) == 0x0002C0, "Member 'UGameMenu_C::BlackListMenu' has a wrong offset!");
static_assert(offsetof(UGameMenu_C, ContinueBtn) == 0x0002C8, "Member 'UGameMenu_C::ContinueBtn' has a wrong offset!");
static_assert(offsetof(UGameMenu_C, Countdown) == 0x0002D0, "Member 'UGameMenu_C::Countdown' has a wrong offset!");
static_assert(offsetof(UGameMenu_C, ExitBtn) == 0x0002D8, "Member 'UGameMenu_C::ExitBtn' has a wrong offset!");
static_assert(offsetof(UGameMenu_C, ExitWeapon) == 0x0002E0, "Member 'UGameMenu_C::ExitWeapon' has a wrong offset!");
static_assert(offsetof(UGameMenu_C, Image_0) == 0x0002E8, "Member 'UGameMenu_C::Image_0' has a wrong offset!");
static_assert(offsetof(UGameMenu_C, KickButton) == 0x0002F0, "Member 'UGameMenu_C::KickButton' has a wrong offset!");
static_assert(offsetof(UGameMenu_C, KickMenu) == 0x0002F8, "Member 'UGameMenu_C::KickMenu' has a wrong offset!");
static_assert(offsetof(UGameMenu_C, KickText) == 0x000300, "Member 'UGameMenu_C::KickText' has a wrong offset!");
static_assert(offsetof(UGameMenu_C, LoadoutButton) == 0x000308, "Member 'UGameMenu_C::LoadoutButton' has a wrong offset!");
static_assert(offsetof(UGameMenu_C, OptionsBtn) == 0x000310, "Member 'UGameMenu_C::OptionsBtn' has a wrong offset!");
static_assert(offsetof(UGameMenu_C, OptionsMaster) == 0x000318, "Member 'UGameMenu_C::OptionsMaster' has a wrong offset!");
static_assert(offsetof(UGameMenu_C, VerticalBox_0) == 0x000320, "Member 'UGameMenu_C::VerticalBox_0' has a wrong offset!");
static_assert(offsetof(UGameMenu_C, Weapon_choosing_1) == 0x000328, "Member 'UGameMenu_C::Weapon_choosing_1' has a wrong offset!");
static_assert(offsetof(UGameMenu_C, Cosmetics_Open_) == 0x000330, "Member 'UGameMenu_C::Cosmetics_Open_' has a wrong offset!");
static_assert(offsetof(UGameMenu_C, Weapons_Open_) == 0x000331, "Member 'UGameMenu_C::Weapons_Open_' has a wrong offset!");
static_assert(offsetof(UGameMenu_C, Authority) == 0x000332, "Member 'UGameMenu_C::Authority' has a wrong offset!");
static_assert(offsetof(UGameMenu_C, Ongoing_vote_) == 0x000333, "Member 'UGameMenu_C::Ongoing_vote_' has a wrong offset!");
static_assert(offsetof(UGameMenu_C, Counter) == 0x000334, "Member 'UGameMenu_C::Counter' has a wrong offset!");
static_assert(offsetof(UGameMenu_C, Skybunger) == 0x000338, "Member 'UGameMenu_C::Skybunger' has a wrong offset!");

}

