#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameStateBP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GameStateBP.GameStateBP_C.Vanished server
// 0x0070 (0x0070 - 0x0000)
struct GameStateBP_C_Vanished_server final
{
public:
	struct FTransform                             SpawnTransform;                                    // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	class AActor*                                 Target;                                            // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GameStateBP_C_Vanished_server) == 0x000010, "Wrong alignment on GameStateBP_C_Vanished_server");
static_assert(sizeof(GameStateBP_C_Vanished_server) == 0x000070, "Wrong size on GameStateBP_C_Vanished_server");
static_assert(offsetof(GameStateBP_C_Vanished_server, SpawnTransform) == 0x000000, "Member 'GameStateBP_C_Vanished_server::SpawnTransform' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_Vanished_server, Target) == 0x000060, "Member 'GameStateBP_C_Vanished_server::Target' has a wrong offset!");

// Function GameStateBP.GameStateBP_C.Send Message Server
// 0x0030 (0x0030 - 0x0000)
struct GameStateBP_C_Send_Message_Server final
{
public:
	class APlayerState*                           Player_State;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Message;                                           // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 Name_0;                                            // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(GameStateBP_C_Send_Message_Server) == 0x000008, "Wrong alignment on GameStateBP_C_Send_Message_Server");
static_assert(sizeof(GameStateBP_C_Send_Message_Server) == 0x000030, "Wrong size on GameStateBP_C_Send_Message_Server");
static_assert(offsetof(GameStateBP_C_Send_Message_Server, Player_State) == 0x000000, "Member 'GameStateBP_C_Send_Message_Server::Player_State' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_Send_Message_Server, Message) == 0x000008, "Member 'GameStateBP_C_Send_Message_Server::Message' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_Send_Message_Server, Name_0) == 0x000020, "Member 'GameStateBP_C_Send_Message_Server::Name_0' has a wrong offset!");

// Function GameStateBP.GameStateBP_C.On_Vanished
// 0x0070 (0x0070 - 0x0000)
struct GameStateBP_C_On_Vanished final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	class ACharacter*                             Real;                                              // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GameStateBP_C_On_Vanished) == 0x000010, "Wrong alignment on GameStateBP_C_On_Vanished");
static_assert(sizeof(GameStateBP_C_On_Vanished) == 0x000070, "Wrong size on GameStateBP_C_On_Vanished");
static_assert(offsetof(GameStateBP_C_On_Vanished, Transform) == 0x000000, "Member 'GameStateBP_C_On_Vanished::Transform' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_On_Vanished, Real) == 0x000060, "Member 'GameStateBP_C_On_Vanished::Real' has a wrong offset!");

// Function GameStateBP.GameStateBP_C.On_Bannana
// 0x0020 (0x0020 - 0x0000)
struct GameStateBP_C_On_Bannana final
{
public:
	struct FRotator                               NewParam;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      NewParam1;                                         // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GameStateBP_C_On_Bannana) == 0x000008, "Wrong alignment on GameStateBP_C_On_Bannana");
static_assert(sizeof(GameStateBP_C_On_Bannana) == 0x000020, "Wrong size on GameStateBP_C_On_Bannana");
static_assert(offsetof(GameStateBP_C_On_Bannana, NewParam) == 0x000000, "Member 'GameStateBP_C_On_Bannana::NewParam' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_On_Bannana, NewParam1) == 0x000018, "Member 'GameStateBP_C_On_Bannana::NewParam1' has a wrong offset!");

// Function GameStateBP.GameStateBP_C.ExecuteUbergraph_GameStateBP
// 0x0280 (0x0280 - 0x0000)
struct GameStateBP_C_ExecuteUbergraph_GameStateBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_CustomEvent_SpawnTransform;                 // 0x0010(0x0060)(IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_Target;                         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00D0(0x0060)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACannon_C*                              CallFunc_FinishSpawningActor_ReturnValue;          // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0144(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_Event_NewParam;                             // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      K2Node_Event_NewParam1;                            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           CallFunc_Array_Get_Item;                           // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerControllerBP_C*                  K2Node_DynamicCast_AsPlayer_Controller_BP;         // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           K2Node_CustomEvent_Player_State;                   // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Message;                        // 0x01B0(0x0018)()
	class FString                                 K2Node_CustomEvent_Name;                           // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_Array_Get_Item_1;                         // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP;              // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             K2Node_Event_Transform;                            // 0x0210(0x0060)(IsPlainOldData, NoDestructor)
	class ACharacter*                             K2Node_Event_Real;                                 // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GameStateBP_C_ExecuteUbergraph_GameStateBP) == 0x000010, "Wrong alignment on GameStateBP_C_ExecuteUbergraph_GameStateBP");
static_assert(sizeof(GameStateBP_C_ExecuteUbergraph_GameStateBP) == 0x000280, "Wrong size on GameStateBP_C_ExecuteUbergraph_GameStateBP");
static_assert(offsetof(GameStateBP_C_ExecuteUbergraph_GameStateBP, EntryPoint) == 0x000000, "Member 'GameStateBP_C_ExecuteUbergraph_GameStateBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_ExecuteUbergraph_GameStateBP, K2Node_CustomEvent_SpawnTransform) == 0x000010, "Member 'GameStateBP_C_ExecuteUbergraph_GameStateBP::K2Node_CustomEvent_SpawnTransform' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_ExecuteUbergraph_GameStateBP, K2Node_CustomEvent_Target) == 0x000070, "Member 'GameStateBP_C_ExecuteUbergraph_GameStateBP::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_ExecuteUbergraph_GameStateBP, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'GameStateBP_C_ExecuteUbergraph_GameStateBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_ExecuteUbergraph_GameStateBP, CallFunc_BreakTransform_Location) == 0x000080, "Member 'GameStateBP_C_ExecuteUbergraph_GameStateBP::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_ExecuteUbergraph_GameStateBP, CallFunc_BreakTransform_Rotation) == 0x000098, "Member 'GameStateBP_C_ExecuteUbergraph_GameStateBP::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_ExecuteUbergraph_GameStateBP, CallFunc_BreakTransform_Scale) == 0x0000B0, "Member 'GameStateBP_C_ExecuteUbergraph_GameStateBP::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_ExecuteUbergraph_GameStateBP, CallFunc_MakeTransform_ReturnValue) == 0x0000D0, "Member 'GameStateBP_C_ExecuteUbergraph_GameStateBP::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_ExecuteUbergraph_GameStateBP, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000130, "Member 'GameStateBP_C_ExecuteUbergraph_GameStateBP::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_ExecuteUbergraph_GameStateBP, CallFunc_FinishSpawningActor_ReturnValue) == 0x000138, "Member 'GameStateBP_C_ExecuteUbergraph_GameStateBP::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_ExecuteUbergraph_GameStateBP, Temp_int_Array_Index_Variable) == 0x000140, "Member 'GameStateBP_C_ExecuteUbergraph_GameStateBP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_ExecuteUbergraph_GameStateBP, K2Node_CreateDelegate_OutputDelegate) == 0x000144, "Member 'GameStateBP_C_ExecuteUbergraph_GameStateBP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_ExecuteUbergraph_GameStateBP, Temp_int_Loop_Counter_Variable) == 0x000154, "Member 'GameStateBP_C_ExecuteUbergraph_GameStateBP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_ExecuteUbergraph_GameStateBP, CallFunc_Add_IntInt_ReturnValue) == 0x000158, "Member 'GameStateBP_C_ExecuteUbergraph_GameStateBP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_ExecuteUbergraph_GameStateBP, Temp_int_Array_Index_Variable_1) == 0x00015C, "Member 'GameStateBP_C_ExecuteUbergraph_GameStateBP::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_ExecuteUbergraph_GameStateBP, K2Node_Event_NewParam) == 0x000160, "Member 'GameStateBP_C_ExecuteUbergraph_GameStateBP::K2Node_Event_NewParam' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_ExecuteUbergraph_GameStateBP, K2Node_Event_NewParam1) == 0x000178, "Member 'GameStateBP_C_ExecuteUbergraph_GameStateBP::K2Node_Event_NewParam1' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_ExecuteUbergraph_GameStateBP, CallFunc_Array_Get_Item) == 0x000180, "Member 'GameStateBP_C_ExecuteUbergraph_GameStateBP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_ExecuteUbergraph_GameStateBP, CallFunc_Array_Length_ReturnValue) == 0x000188, "Member 'GameStateBP_C_ExecuteUbergraph_GameStateBP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_ExecuteUbergraph_GameStateBP, CallFunc_GetPlayerController_ReturnValue) == 0x000190, "Member 'GameStateBP_C_ExecuteUbergraph_GameStateBP::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_ExecuteUbergraph_GameStateBP, K2Node_DynamicCast_AsPlayer_Controller_BP) == 0x000198, "Member 'GameStateBP_C_ExecuteUbergraph_GameStateBP::K2Node_DynamicCast_AsPlayer_Controller_BP' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_ExecuteUbergraph_GameStateBP, K2Node_DynamicCast_bSuccess) == 0x0001A0, "Member 'GameStateBP_C_ExecuteUbergraph_GameStateBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_ExecuteUbergraph_GameStateBP, K2Node_CustomEvent_Player_State) == 0x0001A8, "Member 'GameStateBP_C_ExecuteUbergraph_GameStateBP::K2Node_CustomEvent_Player_State' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_ExecuteUbergraph_GameStateBP, K2Node_CustomEvent_Message) == 0x0001B0, "Member 'GameStateBP_C_ExecuteUbergraph_GameStateBP::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_ExecuteUbergraph_GameStateBP, K2Node_CustomEvent_Name) == 0x0001C8, "Member 'GameStateBP_C_ExecuteUbergraph_GameStateBP::K2Node_CustomEvent_Name' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_ExecuteUbergraph_GameStateBP, Temp_int_Loop_Counter_Variable_1) == 0x0001D8, "Member 'GameStateBP_C_ExecuteUbergraph_GameStateBP::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_ExecuteUbergraph_GameStateBP, CallFunc_GetGameState_ReturnValue) == 0x0001E0, "Member 'GameStateBP_C_ExecuteUbergraph_GameStateBP::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_ExecuteUbergraph_GameStateBP, CallFunc_Less_IntInt_ReturnValue) == 0x0001E8, "Member 'GameStateBP_C_ExecuteUbergraph_GameStateBP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_ExecuteUbergraph_GameStateBP, CallFunc_Array_Get_Item_1) == 0x0001F0, "Member 'GameStateBP_C_ExecuteUbergraph_GameStateBP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_ExecuteUbergraph_GameStateBP, K2Node_DynamicCast_AsPlayer_State_BP) == 0x0001F8, "Member 'GameStateBP_C_ExecuteUbergraph_GameStateBP::K2Node_DynamicCast_AsPlayer_State_BP' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_ExecuteUbergraph_GameStateBP, K2Node_DynamicCast_bSuccess_1) == 0x000200, "Member 'GameStateBP_C_ExecuteUbergraph_GameStateBP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_ExecuteUbergraph_GameStateBP, CallFunc_Array_Length_ReturnValue_1) == 0x000204, "Member 'GameStateBP_C_ExecuteUbergraph_GameStateBP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_ExecuteUbergraph_GameStateBP, CallFunc_Less_IntInt_ReturnValue_1) == 0x000208, "Member 'GameStateBP_C_ExecuteUbergraph_GameStateBP::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_ExecuteUbergraph_GameStateBP, CallFunc_Add_IntInt_ReturnValue_1) == 0x00020C, "Member 'GameStateBP_C_ExecuteUbergraph_GameStateBP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_ExecuteUbergraph_GameStateBP, K2Node_Event_Transform) == 0x000210, "Member 'GameStateBP_C_ExecuteUbergraph_GameStateBP::K2Node_Event_Transform' has a wrong offset!");
static_assert(offsetof(GameStateBP_C_ExecuteUbergraph_GameStateBP, K2Node_Event_Real) == 0x000270, "Member 'GameStateBP_C_ExecuteUbergraph_GameStateBP::K2Node_Event_Real' has a wrong offset!");

}

