#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GraphicsMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GraphicsMenu.GraphicsMenu_C
// 0x0810 (0x0AA0 - 0x0290)
class UGraphicsMenu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                ApplyButton;                                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              CheckBox_0;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                FoliageQualityLeft;                                // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                FoliageQualityRight;                               // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                FrameRateLeft;                                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                FrameRateRight;                                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ResolutionLeft;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ResolutionRight;                                   // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ResolutionTextOut;                                 // 0x02D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ShadowQualityLeft;                                 // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ShadowQualityRight;                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ShadowQualityTextOut;                              // 0x02F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_14;                                      // 0x02F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_18;                                      // 0x0300(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_22;                                      // 0x0308(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_26;                                      // 0x0310(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                TextureQualityLeft;                                // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                TextureQualityRight;                               // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                VsyncLeft;                                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                VSyncRight;                                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                WindowModeLeft;                                    // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                WindowModeRight;                                   // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             WindowTextOut;                                     // 0x0348(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ATrainGusPlayer_C*                      Char_REF;                                          // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BFOV;                                              // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Sens2;                                             // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARocketeer_C*                           Char_REF_0;                                        // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          VSync;                                             // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x3];                                      // 0x0371(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Frame_Limit;                                       // 0x0374(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWindowMode                                   In_Fullscreen_Mode;                                // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x3];                                      // 0x0379(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Foliage_Quality;                                   // 0x037C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Shadow_Quality;                                    // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Texture_Quality;                                   // 0x0384(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              Resolution;                                        // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ResolutionIndex;                                   // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0xC];                                      // 0x0394(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   Post_Process_Settings;                             // 0x03A0(0x06C0)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USaveGame*                              SaveOptions;                                       // 0x0A60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Lumin_;                                            // 0x0A68(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A69[0x3];                                      // 0x0A69(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Sens;                                              // 0x0A6C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Sniper_Sens;                                       // 0x0A70(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Kill_Confirmed_Widget;                             // 0x0A74(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A75[0x3];                                      // 0x0A75(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Hitmarker_Size;                                    // 0x0A78(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Hitmarker_Type;                                    // 0x0A88(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	bool Save_game(bool Lumin, double Field_Of_Vision, double MouseSens, bool Kill_Confirmed_Widget_0, const class FString& Hitmarker_Size_0, const class FString& Hitmarker_Type_0);
	void Load_game(bool* Lumen, double* Field_Of_Vision, bool* Kill_Confirmed_Widget_0, double* MouseSens, class FString* Hitmarker_Size_0, class FString* Hitmarker_Type_0, double* Snipersens);
	class FText GetWindowMode();
	class FText GetVsync();
	class FText GetTexture();
	class FText GetText_3();
	class FText GetText_2();
	class FText GetText_1();
	class FText GetText_0();
	class FText GetResolution();
	class FText GetFoliage();
	ECheckBoxState GetCheckedState_0();
	class FText Get_Shadow();
	void ExecuteUbergraph_GraphicsMenu(int32 EntryPoint);
	void Destruct();
	void Construct();
	void BndEvt__GraphicsMenu_WindowModeRight_K2Node_ComponentBoundEvent_19_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__GraphicsMenu_WindowModeLeft_K2Node_ComponentBoundEvent_18_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__GraphicsMenu_VSyncRight_K2Node_ComponentBoundEvent_17_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__GraphicsMenu_VsyncLeft_K2Node_ComponentBoundEvent_16_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__GraphicsMenu_TextureQualityRight_K2Node_ComponentBoundEvent_15_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__GraphicsMenu_TextureQualityLeft_K2Node_ComponentBoundEvent_14_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__GraphicsMenu_ShadowQualityRight_K2Node_ComponentBoundEvent_13_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__GraphicsMenu_ShadowQualityLeft_K2Node_ComponentBoundEvent_12_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__GraphicsMenu_ResolutionRight_K2Node_ComponentBoundEvent_11_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__GraphicsMenu_ResolutionLeft_K2Node_ComponentBoundEvent_10_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__GraphicsMenu_FrameRateRight_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__GraphicsMenu_FrameRateLeft_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__GraphicsMenu_FoliageQualityRight_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__GraphicsMenu_FoliageQualityLeft_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__GraphicsMenu_CheckBox_0_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void BndEvt__GraphicsMenu_ApplyButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GraphicsMenu_C">();
	}
	static class UGraphicsMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGraphicsMenu_C>();
	}
};
static_assert(alignof(UGraphicsMenu_C) == 0x000010, "Wrong alignment on UGraphicsMenu_C");
static_assert(sizeof(UGraphicsMenu_C) == 0x000AA0, "Wrong size on UGraphicsMenu_C");
static_assert(offsetof(UGraphicsMenu_C, UberGraphFrame) == 0x000290, "Member 'UGraphicsMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, ApplyButton) == 0x000298, "Member 'UGraphicsMenu_C::ApplyButton' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, CheckBox_0) == 0x0002A0, "Member 'UGraphicsMenu_C::CheckBox_0' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, FoliageQualityLeft) == 0x0002A8, "Member 'UGraphicsMenu_C::FoliageQualityLeft' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, FoliageQualityRight) == 0x0002B0, "Member 'UGraphicsMenu_C::FoliageQualityRight' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, FrameRateLeft) == 0x0002B8, "Member 'UGraphicsMenu_C::FrameRateLeft' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, FrameRateRight) == 0x0002C0, "Member 'UGraphicsMenu_C::FrameRateRight' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, ResolutionLeft) == 0x0002C8, "Member 'UGraphicsMenu_C::ResolutionLeft' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, ResolutionRight) == 0x0002D0, "Member 'UGraphicsMenu_C::ResolutionRight' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, ResolutionTextOut) == 0x0002D8, "Member 'UGraphicsMenu_C::ResolutionTextOut' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, ShadowQualityLeft) == 0x0002E0, "Member 'UGraphicsMenu_C::ShadowQualityLeft' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, ShadowQualityRight) == 0x0002E8, "Member 'UGraphicsMenu_C::ShadowQualityRight' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, ShadowQualityTextOut) == 0x0002F0, "Member 'UGraphicsMenu_C::ShadowQualityTextOut' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, TextBlock_14) == 0x0002F8, "Member 'UGraphicsMenu_C::TextBlock_14' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, TextBlock_18) == 0x000300, "Member 'UGraphicsMenu_C::TextBlock_18' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, TextBlock_22) == 0x000308, "Member 'UGraphicsMenu_C::TextBlock_22' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, TextBlock_26) == 0x000310, "Member 'UGraphicsMenu_C::TextBlock_26' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, TextureQualityLeft) == 0x000318, "Member 'UGraphicsMenu_C::TextureQualityLeft' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, TextureQualityRight) == 0x000320, "Member 'UGraphicsMenu_C::TextureQualityRight' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, VsyncLeft) == 0x000328, "Member 'UGraphicsMenu_C::VsyncLeft' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, VSyncRight) == 0x000330, "Member 'UGraphicsMenu_C::VSyncRight' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, WindowModeLeft) == 0x000338, "Member 'UGraphicsMenu_C::WindowModeLeft' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, WindowModeRight) == 0x000340, "Member 'UGraphicsMenu_C::WindowModeRight' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, WindowTextOut) == 0x000348, "Member 'UGraphicsMenu_C::WindowTextOut' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, Char_REF) == 0x000350, "Member 'UGraphicsMenu_C::Char_REF' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, BFOV) == 0x000358, "Member 'UGraphicsMenu_C::BFOV' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, Sens2) == 0x000360, "Member 'UGraphicsMenu_C::Sens2' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, Char_REF_0) == 0x000368, "Member 'UGraphicsMenu_C::Char_REF_0' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, VSync) == 0x000370, "Member 'UGraphicsMenu_C::VSync' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, Frame_Limit) == 0x000374, "Member 'UGraphicsMenu_C::Frame_Limit' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, In_Fullscreen_Mode) == 0x000378, "Member 'UGraphicsMenu_C::In_Fullscreen_Mode' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, Foliage_Quality) == 0x00037C, "Member 'UGraphicsMenu_C::Foliage_Quality' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, Shadow_Quality) == 0x000380, "Member 'UGraphicsMenu_C::Shadow_Quality' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, Texture_Quality) == 0x000384, "Member 'UGraphicsMenu_C::Texture_Quality' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, Resolution) == 0x000388, "Member 'UGraphicsMenu_C::Resolution' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, ResolutionIndex) == 0x000390, "Member 'UGraphicsMenu_C::ResolutionIndex' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, Post_Process_Settings) == 0x0003A0, "Member 'UGraphicsMenu_C::Post_Process_Settings' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, SaveOptions) == 0x000A60, "Member 'UGraphicsMenu_C::SaveOptions' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, Lumin_) == 0x000A68, "Member 'UGraphicsMenu_C::Lumin_' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, Sens) == 0x000A6C, "Member 'UGraphicsMenu_C::Sens' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, Sniper_Sens) == 0x000A70, "Member 'UGraphicsMenu_C::Sniper_Sens' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, Kill_Confirmed_Widget) == 0x000A74, "Member 'UGraphicsMenu_C::Kill_Confirmed_Widget' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, Hitmarker_Size) == 0x000A78, "Member 'UGraphicsMenu_C::Hitmarker_Size' has a wrong offset!");
static_assert(offsetof(UGraphicsMenu_C, Hitmarker_Type) == 0x000A88, "Member 'UGraphicsMenu_C::Hitmarker_Type' has a wrong offset!");

}

