#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GremlinAnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GremlinAnimBP_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass GremlinAnimBP.GremlinAnimBP_C
// 0x0140 (0x0490 - 0x0350)
class UGremlinAnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct GremlinAnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                // 0x0358(0x0008)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0360(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0368(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0370(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0390(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x03D8(0x0040)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0418(0x0068)()
	double                                        Speed;                                             // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dead_;                                             // 0x0488(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GremlinAnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GremlinAnimBP_C">();
	}
	static class UGremlinAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGremlinAnimBP_C>();
	}
};
static_assert(alignof(UGremlinAnimBP_C) == 0x000010, "Wrong alignment on UGremlinAnimBP_C");
static_assert(sizeof(UGremlinAnimBP_C) == 0x000490, "Wrong size on UGremlinAnimBP_C");
static_assert(offsetof(UGremlinAnimBP_C, UberGraphFrame) == 0x000350, "Member 'UGremlinAnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGremlinAnimBP_C, __AnimBlueprintMutables) == 0x000358, "Member 'UGremlinAnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UGremlinAnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000360, "Member 'UGremlinAnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UGremlinAnimBP_C, AnimBlueprintExtension_Base) == 0x000368, "Member 'UGremlinAnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UGremlinAnimBP_C, AnimGraphNode_Root) == 0x000370, "Member 'UGremlinAnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UGremlinAnimBP_C, AnimGraphNode_BlendListByBool) == 0x000390, "Member 'UGremlinAnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UGremlinAnimBP_C, AnimGraphNode_SequencePlayer) == 0x0003D8, "Member 'UGremlinAnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UGremlinAnimBP_C, AnimGraphNode_BlendSpacePlayer) == 0x000418, "Member 'UGremlinAnimBP_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UGremlinAnimBP_C, Speed) == 0x000480, "Member 'UGremlinAnimBP_C::Speed' has a wrong offset!");
static_assert(offsetof(UGremlinAnimBP_C, Dead_) == 0x000488, "Member 'UGremlinAnimBP_C::Dead_' has a wrong offset!");

}

