#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GunKnockback

#include "Basic.hpp"


namespace SDK::Params
{

// Function GunKnockback.GunKnockback_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct GunKnockback_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GunKnockback_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on GunKnockback_C_ReceiveActorBeginOverlap");
static_assert(sizeof(GunKnockback_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on GunKnockback_C_ReceiveActorBeginOverlap");
static_assert(offsetof(GunKnockback_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'GunKnockback_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function GunKnockback.GunKnockback_C.ExecuteUbergraph_GunKnockback
// 0x0018 (0x0018 - 0x0000)
struct GunKnockback_C_ExecuteUbergraph_GunKnockback final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GunKnockback_C_ExecuteUbergraph_GunKnockback) == 0x000008, "Wrong alignment on GunKnockback_C_ExecuteUbergraph_GunKnockback");
static_assert(sizeof(GunKnockback_C_ExecuteUbergraph_GunKnockback) == 0x000018, "Wrong size on GunKnockback_C_ExecuteUbergraph_GunKnockback");
static_assert(offsetof(GunKnockback_C_ExecuteUbergraph_GunKnockback, EntryPoint) == 0x000000, "Member 'GunKnockback_C_ExecuteUbergraph_GunKnockback::EntryPoint' has a wrong offset!");
static_assert(offsetof(GunKnockback_C_ExecuteUbergraph_GunKnockback, K2Node_Event_OtherActor) == 0x000008, "Member 'GunKnockback_C_ExecuteUbergraph_GunKnockback::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(GunKnockback_C_ExecuteUbergraph_GunKnockback, Temp_bool_Has_Been_Initd_Variable) == 0x000010, "Member 'GunKnockback_C_ExecuteUbergraph_GunKnockback::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GunKnockback_C_ExecuteUbergraph_GunKnockback, Temp_bool_IsClosed_Variable) == 0x000011, "Member 'GunKnockback_C_ExecuteUbergraph_GunKnockback::Temp_bool_IsClosed_Variable' has a wrong offset!");

}

