#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GunKnockback

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GunKnockback.GunKnockback_C
// 0x0020 (0x0298 - 0x0278)
class AGunKnockback_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URadialForceComponent*                  RadialForce;                                       // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ExecuteUbergraph_GunKnockback(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GunKnockback_C">();
	}
	static class AGunKnockback_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGunKnockback_C>();
	}
};
static_assert(alignof(AGunKnockback_C) == 0x000008, "Wrong alignment on AGunKnockback_C");
static_assert(sizeof(AGunKnockback_C) == 0x000298, "Wrong size on AGunKnockback_C");
static_assert(offsetof(AGunKnockback_C, UberGraphFrame) == 0x000278, "Member 'AGunKnockback_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGunKnockback_C, RadialForce) == 0x000280, "Member 'AGunKnockback_C::RadialForce' has a wrong offset!");
static_assert(offsetof(AGunKnockback_C, Sphere) == 0x000288, "Member 'AGunKnockback_C::Sphere' has a wrong offset!");
static_assert(offsetof(AGunKnockback_C, DefaultSceneRoot) == 0x000290, "Member 'AGunKnockback_C::DefaultSceneRoot' has a wrong offset!");

}

