#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GunReload

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function GunReload.GunReload_C.Tick
// 0x0048 (0x0048 - 0x0000)
struct GunReload_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GunReload_C_Tick) == 0x000008, "Wrong alignment on GunReload_C_Tick");
static_assert(sizeof(GunReload_C_Tick) == 0x000048, "Wrong size on GunReload_C_Tick");
static_assert(offsetof(GunReload_C_Tick, MyGeometry) == 0x000000, "Member 'GunReload_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(GunReload_C_Tick, InDeltaTime) == 0x000040, "Member 'GunReload_C_Tick::InDeltaTime' has a wrong offset!");

// Function GunReload.GunReload_C.ExecuteUbergraph_GunReload
// 0x0060 (0x0060 - 0x0000)
struct GunReload_C_ExecuteUbergraph_GunReload final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0040)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Delay_Duration_NarrowingCast;             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GunReload_C_ExecuteUbergraph_GunReload) == 0x000008, "Wrong alignment on GunReload_C_ExecuteUbergraph_GunReload");
static_assert(sizeof(GunReload_C_ExecuteUbergraph_GunReload) == 0x000060, "Wrong size on GunReload_C_ExecuteUbergraph_GunReload");
static_assert(offsetof(GunReload_C_ExecuteUbergraph_GunReload, EntryPoint) == 0x000000, "Member 'GunReload_C_ExecuteUbergraph_GunReload::EntryPoint' has a wrong offset!");
static_assert(offsetof(GunReload_C_ExecuteUbergraph_GunReload, K2Node_Event_MyGeometry) == 0x000008, "Member 'GunReload_C_ExecuteUbergraph_GunReload::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(GunReload_C_ExecuteUbergraph_GunReload, K2Node_Event_InDeltaTime) == 0x000048, "Member 'GunReload_C_ExecuteUbergraph_GunReload::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(GunReload_C_ExecuteUbergraph_GunReload, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000050, "Member 'GunReload_C_ExecuteUbergraph_GunReload::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GunReload_C_ExecuteUbergraph_GunReload, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000058, "Member 'GunReload_C_ExecuteUbergraph_GunReload::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GunReload_C_ExecuteUbergraph_GunReload, CallFunc_Delay_Duration_NarrowingCast) == 0x00005C, "Member 'GunReload_C_ExecuteUbergraph_GunReload::CallFunc_Delay_Duration_NarrowingCast' has a wrong offset!");

}

