#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GusAnimBpNewer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GusAnimBpNewer.GusAnimBpNewer_C.OnNewFunction_0
// 0x0020 (0x0020 - 0x0000)
struct GusAnimBpNewer_C_OnNewFunction_0 final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(GusAnimBpNewer_C_OnNewFunction_0) == 0x000008, "Wrong alignment on GusAnimBpNewer_C_OnNewFunction_0");
static_assert(sizeof(GusAnimBpNewer_C_OnNewFunction_0) == 0x000020, "Wrong size on GusAnimBpNewer_C_OnNewFunction_0");
static_assert(offsetof(GusAnimBpNewer_C_OnNewFunction_0, Context) == 0x000000, "Member 'GusAnimBpNewer_C_OnNewFunction_0::Context' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_OnNewFunction_0, Node) == 0x000010, "Member 'GusAnimBpNewer_C_OnNewFunction_0::Node' has a wrong offset!");

// Function GusAnimBpNewer.GusAnimBpNewer_C.Footstep Sound Server
// 0x0020 (0x0020 - 0x0000)
struct GusAnimBpNewer_C_Footstep_Sound_Server final
{
public:
	EPhysicalSurface                              Selection;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GusAnimBpNewer_C_Footstep_Sound_Server) == 0x000008, "Wrong alignment on GusAnimBpNewer_C_Footstep_Sound_Server");
static_assert(sizeof(GusAnimBpNewer_C_Footstep_Sound_Server) == 0x000020, "Wrong size on GusAnimBpNewer_C_Footstep_Sound_Server");
static_assert(offsetof(GusAnimBpNewer_C_Footstep_Sound_Server, Selection) == 0x000000, "Member 'GusAnimBpNewer_C_Footstep_Sound_Server::Selection' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_Footstep_Sound_Server, Location) == 0x000008, "Member 'GusAnimBpNewer_C_Footstep_Sound_Server::Location' has a wrong offset!");

// Function GusAnimBpNewer.GusAnimBpNewer_C.Footstep Sound Multicast
// 0x0020 (0x0020 - 0x0000)
struct GusAnimBpNewer_C_Footstep_Sound_Multicast final
{
public:
	EPhysicalSurface                              Selection;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GusAnimBpNewer_C_Footstep_Sound_Multicast) == 0x000008, "Wrong alignment on GusAnimBpNewer_C_Footstep_Sound_Multicast");
static_assert(sizeof(GusAnimBpNewer_C_Footstep_Sound_Multicast) == 0x000020, "Wrong size on GusAnimBpNewer_C_Footstep_Sound_Multicast");
static_assert(offsetof(GusAnimBpNewer_C_Footstep_Sound_Multicast, Selection) == 0x000000, "Member 'GusAnimBpNewer_C_Footstep_Sound_Multicast::Selection' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_Footstep_Sound_Multicast, Location) == 0x000008, "Member 'GusAnimBpNewer_C_Footstep_Sound_Multicast::Location' has a wrong offset!");

// Function GusAnimBpNewer.GusAnimBpNewer_C.ExecuteUbergraph_GusAnimBpNewer
// 0x0360 (0x0360 - 0x0000)
struct GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player_1;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player_2;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0088(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0098(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue_1;            // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPawnMovementComponent*                 CallFunc_GetMovementComponent_ReturnValue;         // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              CallFunc_GetSurfaceType_ReturnValue;               // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19A[0x6];                                      // 0x019A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_VSize_ReturnValue;                        // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AB[0x1];                                      // 0x01AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0228(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0268(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue_1;       // 0x0290(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue_2;       // 0x0298(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue_3;       // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Body_Pitch_X__Roll_;            // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x02B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              K2Node_CustomEvent_Selection_1;                    // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CA[0x6];                                      // 0x02CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Location_1;                     // 0x02D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              K2Node_CustomEvent_Selection;                      // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue_2;            // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue_4;       // 0x0310(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENetRole                                      CallFunc_GetLocalRole_ReturnValue;                 // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue_5;       // 0x0320(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue_6;       // 0x0330(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue_7;       // 0x0338(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue_3;            // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player_3;           // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0359(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x035A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer) == 0x000008, "Wrong alignment on GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer");
static_assert(sizeof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer) == 0x000360, "Wrong size on GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, EntryPoint) == 0x000000, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::EntryPoint' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000008, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, K2Node_DynamicCast_AsTrain_Gus_Player) == 0x000010, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::K2Node_DynamicCast_AsTrain_Gus_Player' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, K2Node_DynamicCast_AsTrain_Gus_Player_1) == 0x000020, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::K2Node_DynamicCast_AsTrain_Gus_Player_1' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000030, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, K2Node_DynamicCast_AsTrain_Gus_Player_2) == 0x000038, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::K2Node_DynamicCast_AsTrain_Gus_Player_2' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, K2Node_DynamicCast_bSuccess_2) == 0x000040, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_GetPlayerCharacter_ReturnValue_1) == 0x000048, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_GetPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000058, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000070, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, Temp_object_Variable) == 0x000088, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_LineTraceSingle_OutHit) == 0x000098, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_LineTraceSingle_ReturnValue) == 0x000180, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_TryGetPawnOwner_ReturnValue_1) == 0x000188, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_TryGetPawnOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_GetMovementComponent_ReturnValue) == 0x000190, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_GetMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_GetSurfaceType_ReturnValue) == 0x000198, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_GetSurfaceType_ReturnValue' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, K2Node_SwitchEnum_CmpSuccess) == 0x000199, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_VSize_ReturnValue) == 0x0001A0, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_IsFalling_ReturnValue) == 0x0001A8, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_IsFalling_ReturnValue' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_BreakHitResult_bBlockingHit) == 0x0001A9, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001AA, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_BreakHitResult_Time) == 0x0001AC, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_BreakHitResult_Distance) == 0x0001B0, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_BreakHitResult_Location) == 0x0001B8, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_BreakHitResult_ImpactPoint) == 0x0001D0, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_BreakHitResult_Normal) == 0x0001E8, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_BreakHitResult_ImpactNormal) == 0x000200, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_BreakHitResult_PhysMat) == 0x000218, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_BreakHitResult_HitActor) == 0x000220, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_BreakHitResult_HitComponent) == 0x000228, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_BreakHitResult_HitBoneName) == 0x000230, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_BreakHitResult_BoneName) == 0x000238, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_BreakHitResult_HitItem) == 0x000240, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_BreakHitResult_ElementIndex) == 0x000244, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_BreakHitResult_FaceIndex) == 0x000248, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_BreakHitResult_TraceStart) == 0x000250, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_BreakHitResult_TraceEnd) == 0x000268, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, K2Node_Event_DeltaTimeX) == 0x000280, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000288, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_SpawnSoundAtLocation_ReturnValue_1) == 0x000290, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_SpawnSoundAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_SpawnSoundAtLocation_ReturnValue_2) == 0x000298, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_SpawnSoundAtLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_SpawnSoundAtLocation_ReturnValue_3) == 0x0002A0, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_SpawnSoundAtLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_Not_PreBool_ReturnValue) == 0x0002A8, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, K2Node_CustomEvent_Body_Pitch_X__Roll_) == 0x0002AC, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::K2Node_CustomEvent_Body_Pitch_X__Roll_' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_MakeRotator_ReturnValue) == 0x0002B0, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_BooleanAND_ReturnValue) == 0x0002C8, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, K2Node_CustomEvent_Selection_1) == 0x0002C9, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::K2Node_CustomEvent_Selection_1' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, K2Node_CustomEvent_Location_1) == 0x0002D0, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::K2Node_CustomEvent_Location_1' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, K2Node_CustomEvent_Selection) == 0x0002E8, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::K2Node_CustomEvent_Selection' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, K2Node_CustomEvent_Location) == 0x0002F0, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_TryGetPawnOwner_ReturnValue_2) == 0x000308, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_TryGetPawnOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_SpawnSoundAtLocation_ReturnValue_4) == 0x000310, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_SpawnSoundAtLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_GetLocalRole_ReturnValue) == 0x000318, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_GetLocalRole_ReturnValue' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_SpawnSoundAtLocation_ReturnValue_5) == 0x000320, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_SpawnSoundAtLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000328, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_SpawnSoundAtLocation_ReturnValue_6) == 0x000330, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_SpawnSoundAtLocation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_SpawnSoundAtLocation_ReturnValue_7) == 0x000338, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_SpawnSoundAtLocation_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, K2Node_SwitchEnum_CmpSuccess_1) == 0x000340, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_TryGetPawnOwner_ReturnValue_3) == 0x000348, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_TryGetPawnOwner_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, K2Node_DynamicCast_AsTrain_Gus_Player_3) == 0x000350, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::K2Node_DynamicCast_AsTrain_Gus_Player_3' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, K2Node_DynamicCast_bSuccess_3) == 0x000358, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_Not_PreBool_ReturnValue_1) == 0x000359, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer, CallFunc_BooleanAND_ReturnValue_1) == 0x00035A, "Member 'GusAnimBpNewer_C_ExecuteUbergraph_GusAnimBpNewer::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function GusAnimBpNewer.GusAnimBpNewer_C.BodyPitchServer
// 0x0004 (0x0004 - 0x0000)
struct GusAnimBpNewer_C_BodyPitchServer final
{
public:
	float                                         Body_Pitch_X__Roll_;                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GusAnimBpNewer_C_BodyPitchServer) == 0x000004, "Wrong alignment on GusAnimBpNewer_C_BodyPitchServer");
static_assert(sizeof(GusAnimBpNewer_C_BodyPitchServer) == 0x000004, "Wrong size on GusAnimBpNewer_C_BodyPitchServer");
static_assert(offsetof(GusAnimBpNewer_C_BodyPitchServer, Body_Pitch_X__Roll_) == 0x000000, "Member 'GusAnimBpNewer_C_BodyPitchServer::Body_Pitch_X__Roll_' has a wrong offset!");

// Function GusAnimBpNewer.GusAnimBpNewer_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct GusAnimBpNewer_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GusAnimBpNewer_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on GusAnimBpNewer_C_BlueprintUpdateAnimation");
static_assert(sizeof(GusAnimBpNewer_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on GusAnimBpNewer_C_BlueprintUpdateAnimation");
static_assert(offsetof(GusAnimBpNewer_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'GusAnimBpNewer_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function GusAnimBpNewer.GusAnimBpNewer_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct GusAnimBpNewer_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(GusAnimBpNewer_C_AnimGraph) == 0x000008, "Wrong alignment on GusAnimBpNewer_C_AnimGraph");
static_assert(sizeof(GusAnimBpNewer_C_AnimGraph) == 0x000010, "Wrong size on GusAnimBpNewer_C_AnimGraph");
static_assert(offsetof(GusAnimBpNewer_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'GusAnimBpNewer_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

