#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GusPlayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GusPlayer.GusPlayer_C.WeaponSway
// 0x0240 (0x0240 - 0x0000)
struct GusPlayer_C_WeaponSway final
{
public:
	double                                        Delta_Time;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInputAxisValue_ReturnValue;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInputAxisValue_ReturnValue_1;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x00E0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_RInterpTo_DeltaTime_NarrowingCast;        // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_B_WideningCast;          // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_WideningCast;     // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_WideningCast_1;        // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_WideningCast;     // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_WideningCast;          // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_WideningCast;     // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_WideningCast_1;        // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_NarrowingCast;            // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_NarrowingCast;          // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_NarrowingCast_1;        // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_NarrowingCast;           // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_WideningCast_1;   // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_NarrowingCast_1;         // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_NarrowingCast_1;          // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Value_WideningCast;                // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Value_WideningCast_1;              // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_NarrowingCast_2;        // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_NarrowingCast_2;         // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GusPlayer_C_WeaponSway) == 0x000008, "Wrong alignment on GusPlayer_C_WeaponSway");
static_assert(sizeof(GusPlayer_C_WeaponSway) == 0x000240, "Wrong size on GusPlayer_C_WeaponSway");
static_assert(offsetof(GusPlayer_C_WeaponSway, Delta_Time) == 0x000000, "Member 'GusPlayer_C_WeaponSway::Delta_Time' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'GusPlayer_C_WeaponSway::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_BreakRotator_Roll) == 0x000010, "Member 'GusPlayer_C_WeaponSway::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_BreakRotator_Pitch) == 0x000014, "Member 'GusPlayer_C_WeaponSway::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_BreakRotator_Yaw) == 0x000018, "Member 'GusPlayer_C_WeaponSway::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_GetInputAxisValue_ReturnValue) == 0x00001C, "Member 'GusPlayer_C_WeaponSway::CallFunc_GetInputAxisValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_BreakRotator_Roll_1) == 0x000020, "Member 'GusPlayer_C_WeaponSway::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_BreakRotator_Pitch_1) == 0x000024, "Member 'GusPlayer_C_WeaponSway::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_BreakRotator_Yaw_1) == 0x000028, "Member 'GusPlayer_C_WeaponSway::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000030, "Member 'GusPlayer_C_WeaponSway::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000038, "Member 'GusPlayer_C_WeaponSway::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000040, "Member 'GusPlayer_C_WeaponSway::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000048, "Member 'GusPlayer_C_WeaponSway::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_GetInputAxisValue_ReturnValue_1) == 0x000050, "Member 'GusPlayer_C_WeaponSway::CallFunc_GetInputAxisValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_MakeRotator_ReturnValue) == 0x000058, "Member 'GusPlayer_C_WeaponSway::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000070, "Member 'GusPlayer_C_WeaponSway::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_RInterpTo_ReturnValue) == 0x000078, "Member 'GusPlayer_C_WeaponSway::CallFunc_RInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_MakeRotator_ReturnValue_1) == 0x000090, "Member 'GusPlayer_C_WeaponSway::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_BreakRotator_Roll_2) == 0x0000A8, "Member 'GusPlayer_C_WeaponSway::CallFunc_BreakRotator_Roll_2' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_BreakRotator_Pitch_2) == 0x0000AC, "Member 'GusPlayer_C_WeaponSway::CallFunc_BreakRotator_Pitch_2' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_BreakRotator_Yaw_2) == 0x0000B0, "Member 'GusPlayer_C_WeaponSway::CallFunc_BreakRotator_Yaw_2' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_FClamp_ReturnValue) == 0x0000B8, "Member 'GusPlayer_C_WeaponSway::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_FClamp_ReturnValue_1) == 0x0000C0, "Member 'GusPlayer_C_WeaponSway::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_MakeRotator_ReturnValue_2) == 0x0000C8, "Member 'GusPlayer_C_WeaponSway::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x0000E0, "Member 'GusPlayer_C_WeaponSway::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_RInterpTo_DeltaTime_NarrowingCast) == 0x0001C8, "Member 'GusPlayer_C_WeaponSway::CallFunc_RInterpTo_DeltaTime_NarrowingCast' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_Add_DoubleDouble_B_WideningCast) == 0x0001D0, "Member 'GusPlayer_C_WeaponSway::CallFunc_Add_DoubleDouble_B_WideningCast' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_Subtract_DoubleDouble_B_WideningCast) == 0x0001D8, "Member 'GusPlayer_C_WeaponSway::CallFunc_Subtract_DoubleDouble_B_WideningCast' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_Add_DoubleDouble_B_WideningCast_1) == 0x0001E0, "Member 'GusPlayer_C_WeaponSway::CallFunc_Add_DoubleDouble_B_WideningCast_1' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_Multiply_DoubleDouble_A_WideningCast) == 0x0001E8, "Member 'GusPlayer_C_WeaponSway::CallFunc_Multiply_DoubleDouble_A_WideningCast' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_Add_DoubleDouble_A_WideningCast) == 0x0001F0, "Member 'GusPlayer_C_WeaponSway::CallFunc_Add_DoubleDouble_A_WideningCast' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_Subtract_DoubleDouble_A_WideningCast) == 0x0001F8, "Member 'GusPlayer_C_WeaponSway::CallFunc_Subtract_DoubleDouble_A_WideningCast' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_Add_DoubleDouble_A_WideningCast_1) == 0x000200, "Member 'GusPlayer_C_WeaponSway::CallFunc_Add_DoubleDouble_A_WideningCast_1' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_MakeRotator_Yaw_NarrowingCast) == 0x000208, "Member 'GusPlayer_C_WeaponSway::CallFunc_MakeRotator_Yaw_NarrowingCast' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_MakeRotator_Pitch_NarrowingCast) == 0x00020C, "Member 'GusPlayer_C_WeaponSway::CallFunc_MakeRotator_Pitch_NarrowingCast' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_MakeRotator_Pitch_NarrowingCast_1) == 0x000210, "Member 'GusPlayer_C_WeaponSway::CallFunc_MakeRotator_Pitch_NarrowingCast_1' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_MakeRotator_Roll_NarrowingCast) == 0x000214, "Member 'GusPlayer_C_WeaponSway::CallFunc_MakeRotator_Roll_NarrowingCast' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_Multiply_DoubleDouble_A_WideningCast_1) == 0x000218, "Member 'GusPlayer_C_WeaponSway::CallFunc_Multiply_DoubleDouble_A_WideningCast_1' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_MakeRotator_Roll_NarrowingCast_1) == 0x000220, "Member 'GusPlayer_C_WeaponSway::CallFunc_MakeRotator_Roll_NarrowingCast_1' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_MakeRotator_Yaw_NarrowingCast_1) == 0x000224, "Member 'GusPlayer_C_WeaponSway::CallFunc_MakeRotator_Yaw_NarrowingCast_1' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_FClamp_Value_WideningCast) == 0x000228, "Member 'GusPlayer_C_WeaponSway::CallFunc_FClamp_Value_WideningCast' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_FClamp_Value_WideningCast_1) == 0x000230, "Member 'GusPlayer_C_WeaponSway::CallFunc_FClamp_Value_WideningCast_1' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_MakeRotator_Pitch_NarrowingCast_2) == 0x000238, "Member 'GusPlayer_C_WeaponSway::CallFunc_MakeRotator_Pitch_NarrowingCast_2' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_WeaponSway, CallFunc_MakeRotator_Roll_NarrowingCast_2) == 0x00023C, "Member 'GusPlayer_C_WeaponSway::CallFunc_MakeRotator_Roll_NarrowingCast_2' has a wrong offset!");

// Function GusPlayer.GusPlayer_C.Update Head rotation
// 0x0320 (0x0320 - 0x0000)
struct GusPlayer_C_Update_Head_rotation final
{
public:
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue_1;         // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_3;                      // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_3;                     // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_3;                       // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll_4;                      // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_4;                     // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_4;                       // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_3;                // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue_1;                  // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue_1;        // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_2;        // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue_2;        // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18A[0x2];                                      // 0x018A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_2;       // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_3;        // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue_2;         // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_5;                      // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_5;                     // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_5;                       // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_4;                // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue_2;                  // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue_3;        // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_222[0x6];                                      // 0x0222(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_4;        // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_6;                      // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_6;                     // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_6;                       // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue_3;         // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_7;                      // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_7;                     // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_7;                       // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGusAnimBpNew_C*                        K2Node_DynamicCast_AsGus_Anim_Bp_New;              // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_ClampAngle_ReturnValue;                   // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_3;      // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_5;                // 0x02A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Add_DoubleDouble_B_WideningCast;          // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_WideningCast;     // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_NarrowingCast;            // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_B_WideningCast_1;        // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_WideningCast_1;   // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_WideningCast;         // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_NarrowingCast_1;          // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_WideningCast;      // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_WideningCast;     // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_WideningCast_2;   // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_WideningCast_3;   // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_NarrowingCast_2;          // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_NarrowingCast;           // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GusPlayer_C_Update_Head_rotation) == 0x000008, "Wrong alignment on GusPlayer_C_Update_Head_rotation");
static_assert(sizeof(GusPlayer_C_Update_Head_rotation) == 0x000320, "Wrong size on GusPlayer_C_Update_Head_rotation");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_BreakRotator_Roll) == 0x000000, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_BreakRotator_Pitch) == 0x000004, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_BreakRotator_Yaw) == 0x000008, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x00000C, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_GetControlRotation_ReturnValue) == 0x000010, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_GetControlRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000028, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_BreakRotator_Roll_1) == 0x000040, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_BreakRotator_Pitch_1) == 0x000044, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_BreakRotator_Yaw_1) == 0x000048, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_BreakRotator_Roll_2) == 0x00004C, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_BreakRotator_Roll_2' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_BreakRotator_Pitch_2) == 0x000050, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_BreakRotator_Pitch_2' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_BreakRotator_Yaw_2) == 0x000054, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_BreakRotator_Yaw_2' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_MakeRotator_ReturnValue) == 0x000058, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x000070, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000078, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_GetControlRotation_ReturnValue_1) == 0x000080, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_GetControlRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000098, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_BreakRotator_Roll_3) == 0x0000A0, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_BreakRotator_Roll_3' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_BreakRotator_Pitch_3) == 0x0000A4, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_BreakRotator_Pitch_3' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_BreakRotator_Yaw_3) == 0x0000A8, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_BreakRotator_Yaw_3' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_MakeRotator_ReturnValue_1) == 0x0000B0, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_MakeRotator_ReturnValue_2) == 0x0000C8, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_RInterpTo_ReturnValue) == 0x0000E0, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_RInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_K2_GetActorRotation_ReturnValue_1) == 0x0000F8, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_K2_GetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000110, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_BreakRotator_Roll_4) == 0x000114, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_BreakRotator_Roll_4' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_BreakRotator_Pitch_4) == 0x000118, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_BreakRotator_Pitch_4' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_BreakRotator_Yaw_4) == 0x00011C, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_BreakRotator_Yaw_4' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000120, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000128, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000130, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_MakeRotator_ReturnValue_3) == 0x000138, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_MakeRotator_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_RInterpTo_ReturnValue_1) == 0x000150, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_RInterpTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_K2_SetActorRotation_ReturnValue_1) == 0x000168, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_K2_SetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_K2_GetActorRotation_ReturnValue_2) == 0x000170, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_K2_GetActorRotation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000188, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_K2_SetActorRotation_ReturnValue_2) == 0x000189, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_K2_SetActorRotation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_GetWorldDeltaSeconds_ReturnValue_2) == 0x00018C, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_GetWorldDeltaSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_K2_GetActorRotation_ReturnValue_3) == 0x000190, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_K2_GetActorRotation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_GetControlRotation_ReturnValue_2) == 0x0001A8, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_GetControlRotation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_BreakRotator_Roll_5) == 0x0001C0, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_BreakRotator_Roll_5' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_BreakRotator_Pitch_5) == 0x0001C4, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_BreakRotator_Pitch_5' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_BreakRotator_Yaw_5) == 0x0001C8, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_BreakRotator_Yaw_5' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_GetVelocity_ReturnValue) == 0x0001D0, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_MakeRotator_ReturnValue_4) == 0x0001E8, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_MakeRotator_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_VSize_ReturnValue) == 0x000200, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_RInterpTo_ReturnValue_2) == 0x000208, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_RInterpTo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000220, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_K2_SetActorRotation_ReturnValue_3) == 0x000221, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_K2_SetActorRotation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_K2_GetActorRotation_ReturnValue_4) == 0x000228, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_K2_GetActorRotation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_BreakRotator_Roll_6) == 0x000240, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_BreakRotator_Roll_6' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_BreakRotator_Pitch_6) == 0x000244, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_BreakRotator_Pitch_6' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_BreakRotator_Yaw_6) == 0x000248, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_BreakRotator_Yaw_6' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_GetControlRotation_ReturnValue_3) == 0x000250, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_GetControlRotation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_BreakRotator_Roll_7) == 0x000268, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_BreakRotator_Roll_7' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_BreakRotator_Pitch_7) == 0x00026C, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_BreakRotator_Pitch_7' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_BreakRotator_Yaw_7) == 0x000270, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_BreakRotator_Yaw_7' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_GetAnimInstance_ReturnValue) == 0x000278, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x000280, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, K2Node_DynamicCast_AsGus_Anim_Bp_New) == 0x000288, "Member 'GusPlayer_C_Update_Head_rotation::K2Node_DynamicCast_AsGus_Anim_Bp_New' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, K2Node_DynamicCast_bSuccess) == 0x000290, "Member 'GusPlayer_C_Update_Head_rotation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_ClampAngle_ReturnValue) == 0x000298, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_ClampAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_Subtract_DoubleDouble_ReturnValue_3) == 0x0002A0, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_Subtract_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_MakeRotator_ReturnValue_5) == 0x0002A8, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_MakeRotator_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_Add_DoubleDouble_B_WideningCast) == 0x0002C0, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_Add_DoubleDouble_B_WideningCast' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_Subtract_DoubleDouble_A_WideningCast) == 0x0002C8, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_Subtract_DoubleDouble_A_WideningCast' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_MakeRotator_Yaw_NarrowingCast) == 0x0002D0, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_MakeRotator_Yaw_NarrowingCast' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_Add_DoubleDouble_B_WideningCast_1) == 0x0002D8, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_Add_DoubleDouble_B_WideningCast_1' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_Subtract_DoubleDouble_A_WideningCast_1) == 0x0002E0, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_Subtract_DoubleDouble_A_WideningCast_1' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_Less_DoubleDouble_A_WideningCast) == 0x0002E8, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_Less_DoubleDouble_A_WideningCast' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_MakeRotator_Yaw_NarrowingCast_1) == 0x0002F0, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_MakeRotator_Yaw_NarrowingCast_1' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_Greater_DoubleDouble_A_WideningCast) == 0x0002F8, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_Greater_DoubleDouble_A_WideningCast' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_Subtract_DoubleDouble_B_WideningCast) == 0x000300, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_Subtract_DoubleDouble_B_WideningCast' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_Subtract_DoubleDouble_A_WideningCast_2) == 0x000308, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_Subtract_DoubleDouble_A_WideningCast_2' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_Subtract_DoubleDouble_A_WideningCast_3) == 0x000310, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_Subtract_DoubleDouble_A_WideningCast_3' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_MakeRotator_Yaw_NarrowingCast_2) == 0x000318, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_MakeRotator_Yaw_NarrowingCast_2' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Update_Head_rotation, CallFunc_MakeRotator_Roll_NarrowingCast) == 0x00031C, "Member 'GusPlayer_C_Update_Head_rotation::CallFunc_MakeRotator_Roll_NarrowingCast' has a wrong offset!");

// Function GusPlayer.GusPlayer_C.Stop sprint
// 0x0004 (0x0004 - 0x0000)
struct GusPlayer_C_Stop_sprint final
{
public:
	float                                         K2Node_VariableSet_MaxWalkSpeed_NarrowingCast;     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GusPlayer_C_Stop_sprint) == 0x000004, "Wrong alignment on GusPlayer_C_Stop_sprint");
static_assert(sizeof(GusPlayer_C_Stop_sprint) == 0x000004, "Wrong size on GusPlayer_C_Stop_sprint");
static_assert(offsetof(GusPlayer_C_Stop_sprint, K2Node_VariableSet_MaxWalkSpeed_NarrowingCast) == 0x000000, "Member 'GusPlayer_C_Stop_sprint::K2Node_VariableSet_MaxWalkSpeed_NarrowingCast' has a wrong offset!");

// Function GusPlayer.GusPlayer_C.Start sprint
// 0x0004 (0x0004 - 0x0000)
struct GusPlayer_C_Start_sprint final
{
public:
	float                                         K2Node_VariableSet_MaxWalkSpeed_NarrowingCast;     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GusPlayer_C_Start_sprint) == 0x000004, "Wrong alignment on GusPlayer_C_Start_sprint");
static_assert(sizeof(GusPlayer_C_Start_sprint) == 0x000004, "Wrong size on GusPlayer_C_Start_sprint");
static_assert(offsetof(GusPlayer_C_Start_sprint, K2Node_VariableSet_MaxWalkSpeed_NarrowingCast) == 0x000000, "Member 'GusPlayer_C_Start_sprint::K2Node_VariableSet_MaxWalkSpeed_NarrowingCast' has a wrong offset!");

// Function GusPlayer.GusPlayer_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct GusPlayer_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GusPlayer_C_ReceiveTick) == 0x000004, "Wrong alignment on GusPlayer_C_ReceiveTick");
static_assert(sizeof(GusPlayer_C_ReceiveTick) == 0x000004, "Wrong size on GusPlayer_C_ReceiveTick");
static_assert(offsetof(GusPlayer_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'GusPlayer_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function GusPlayer.GusPlayer_C.ReceiveAnyDamage
// 0x0020 (0x0020 - 0x0000)
struct GusPlayer_C_ReceiveAnyDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UDamageType*                      DamageType;                                        // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GusPlayer_C_ReceiveAnyDamage) == 0x000008, "Wrong alignment on GusPlayer_C_ReceiveAnyDamage");
static_assert(sizeof(GusPlayer_C_ReceiveAnyDamage) == 0x000020, "Wrong size on GusPlayer_C_ReceiveAnyDamage");
static_assert(offsetof(GusPlayer_C_ReceiveAnyDamage, Damage) == 0x000000, "Member 'GusPlayer_C_ReceiveAnyDamage::Damage' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_ReceiveAnyDamage, DamageType) == 0x000008, "Member 'GusPlayer_C_ReceiveAnyDamage::DamageType' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_ReceiveAnyDamage, InstigatedBy) == 0x000010, "Member 'GusPlayer_C_ReceiveAnyDamage::InstigatedBy' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_ReceiveAnyDamage, DamageCauser) == 0x000018, "Member 'GusPlayer_C_ReceiveAnyDamage::DamageCauser' has a wrong offset!");

// Function GusPlayer.GusPlayer_C.Perspective function
// 0x0002 (0x0002 - 0x0000)
struct GusPlayer_C_Perspective_function final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GusPlayer_C_Perspective_function) == 0x000001, "Wrong alignment on GusPlayer_C_Perspective_function");
static_assert(sizeof(GusPlayer_C_Perspective_function) == 0x000002, "Wrong size on GusPlayer_C_Perspective_function");
static_assert(offsetof(GusPlayer_C_Perspective_function, Temp_bool_Variable) == 0x000000, "Member 'GusPlayer_C_Perspective_function::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_Perspective_function, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'GusPlayer_C_Perspective_function::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function GusPlayer.GusPlayer_C.On_Pant
// 0x0010 (0x0010 - 0x0000)
struct GusPlayer_C_On_Pant final
{
public:
	class FString                                 Pant;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(GusPlayer_C_On_Pant) == 0x000008, "Wrong alignment on GusPlayer_C_On_Pant");
static_assert(sizeof(GusPlayer_C_On_Pant) == 0x000010, "Wrong size on GusPlayer_C_On_Pant");
static_assert(offsetof(GusPlayer_C_On_Pant, Pant) == 0x000000, "Member 'GusPlayer_C_On_Pant::Pant' has a wrong offset!");

// Function GusPlayer.GusPlayer_C.looking up and down server
// 0x0004 (0x0004 - 0x0000)
struct GusPlayer_C_looking_up_and_down_server final
{
public:
	float                                         Val;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GusPlayer_C_looking_up_and_down_server) == 0x000004, "Wrong alignment on GusPlayer_C_looking_up_and_down_server");
static_assert(sizeof(GusPlayer_C_looking_up_and_down_server) == 0x000004, "Wrong size on GusPlayer_C_looking_up_and_down_server");
static_assert(offsetof(GusPlayer_C_looking_up_and_down_server, Val) == 0x000000, "Member 'GusPlayer_C_looking_up_and_down_server::Val' has a wrong offset!");

// Function GusPlayer.GusPlayer_C.InpTchEvt_Released
// 0x0020 (0x0020 - 0x0000)
struct GusPlayer_C_InpTchEvt_Released final
{
public:
	ETouchIndex                                   FingerIndex;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GusPlayer_C_InpTchEvt_Released) == 0x000008, "Wrong alignment on GusPlayer_C_InpTchEvt_Released");
static_assert(sizeof(GusPlayer_C_InpTchEvt_Released) == 0x000020, "Wrong size on GusPlayer_C_InpTchEvt_Released");
static_assert(offsetof(GusPlayer_C_InpTchEvt_Released, FingerIndex) == 0x000000, "Member 'GusPlayer_C_InpTchEvt_Released::FingerIndex' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_InpTchEvt_Released, Location) == 0x000008, "Member 'GusPlayer_C_InpTchEvt_Released::Location' has a wrong offset!");

// Function GusPlayer.GusPlayer_C.InpTchEvt_Pressed
// 0x0020 (0x0020 - 0x0000)
struct GusPlayer_C_InpTchEvt_Pressed final
{
public:
	ETouchIndex                                   FingerIndex;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GusPlayer_C_InpTchEvt_Pressed) == 0x000008, "Wrong alignment on GusPlayer_C_InpTchEvt_Pressed");
static_assert(sizeof(GusPlayer_C_InpTchEvt_Pressed) == 0x000020, "Wrong size on GusPlayer_C_InpTchEvt_Pressed");
static_assert(offsetof(GusPlayer_C_InpTchEvt_Pressed, FingerIndex) == 0x000000, "Member 'GusPlayer_C_InpTchEvt_Pressed::FingerIndex' has a wrong offset!");
static_assert(offsetof(GusPlayer_C_InpTchEvt_Pressed, Location) == 0x000008, "Member 'GusPlayer_C_InpTchEvt_Pressed::Location' has a wrong offset!");

// Function GusPlayer.GusPlayer_C. Left Mouse_K2Node_InputAxisEvent_16
// 0x0004 (0x0004 - 0x0000)
struct GusPlayer_C__Left_Mouse_K2Node_InputAxisEvent_16 final
{
public:
