#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HatMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HatMenu.HatMenu_C
// 0x00E8 (0x0378 - 0x0290)
class UHatMenu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         One20KillsBox;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Two0KillsBox;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Five0KillsBox;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Eight0KillsBox;                                    // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                BucketHeadHat;                                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                CheeseHat;                                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                HatMeksButton;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                HatNoneButton;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                HeisenGusButton;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_6;                                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_7;                                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                GusRefrence;                                       // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Attach_mekshat;                                    // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         Local_Hat_Number;                                  // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveGame*                              SaveOptions;                                       // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Player_Kills;                                      // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Title_Number;                                      // 0x0354(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HatNumber;                                         // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Skin_Number;                                       // 0x035C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Weapon_1;                                          // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Weapon_2;                                          // 0x0364(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Pant_Type;                                         // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void Save_Item(int32 Title, int32 Hat, int32 Skin, const class FString& PantType);
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_HatMenu(int32 EntryPoint);
	bool EnableNoHat();
	bool EnableMeksHat();
	bool EnableHeisengusHat();
	bool EnableCheeseHat();
	bool EnableBucketHat();
	void Construct();
	void BndEvt__HatMenu_HeisenGusButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__HatMenu_HatNoneButton_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__HatMenu_Hat1_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__HatMenu_CheeseHat_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__HatMenu_BucketheadHat_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HatMenu_C">();
	}
	static class UHatMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHatMenu_C>();
	}
};
static_assert(alignof(UHatMenu_C) == 0x000008, "Wrong alignment on UHatMenu_C");
static_assert(sizeof(UHatMenu_C) == 0x000378, "Wrong size on UHatMenu_C");
static_assert(offsetof(UHatMenu_C, UberGraphFrame) == 0x000290, "Member 'UHatMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHatMenu_C, One20KillsBox) == 0x000298, "Member 'UHatMenu_C::One20KillsBox' has a wrong offset!");
static_assert(offsetof(UHatMenu_C, Two0KillsBox) == 0x0002A0, "Member 'UHatMenu_C::Two0KillsBox' has a wrong offset!");
static_assert(offsetof(UHatMenu_C, Five0KillsBox) == 0x0002A8, "Member 'UHatMenu_C::Five0KillsBox' has a wrong offset!");
static_assert(offsetof(UHatMenu_C, Eight0KillsBox) == 0x0002B0, "Member 'UHatMenu_C::Eight0KillsBox' has a wrong offset!");
static_assert(offsetof(UHatMenu_C, BucketHeadHat) == 0x0002B8, "Member 'UHatMenu_C::BucketHeadHat' has a wrong offset!");
static_assert(offsetof(UHatMenu_C, CheeseHat) == 0x0002C0, "Member 'UHatMenu_C::CheeseHat' has a wrong offset!");
static_assert(offsetof(UHatMenu_C, HatMeksButton) == 0x0002C8, "Member 'UHatMenu_C::HatMeksButton' has a wrong offset!");
static_assert(offsetof(UHatMenu_C, HatNoneButton) == 0x0002D0, "Member 'UHatMenu_C::HatNoneButton' has a wrong offset!");
static_assert(offsetof(UHatMenu_C, HeisenGusButton) == 0x0002D8, "Member 'UHatMenu_C::HeisenGusButton' has a wrong offset!");
static_assert(offsetof(UHatMenu_C, Image) == 0x0002E0, "Member 'UHatMenu_C::Image' has a wrong offset!");
static_assert(offsetof(UHatMenu_C, Image_0) == 0x0002E8, "Member 'UHatMenu_C::Image_0' has a wrong offset!");
static_assert(offsetof(UHatMenu_C, Image_1) == 0x0002F0, "Member 'UHatMenu_C::Image_1' has a wrong offset!");
static_assert(offsetof(UHatMenu_C, Image_2) == 0x0002F8, "Member 'UHatMenu_C::Image_2' has a wrong offset!");
static_assert(offsetof(UHatMenu_C, Image_3) == 0x000300, "Member 'UHatMenu_C::Image_3' has a wrong offset!");
static_assert(offsetof(UHatMenu_C, Image_4) == 0x000308, "Member 'UHatMenu_C::Image_4' has a wrong offset!");
static_assert(offsetof(UHatMenu_C, Image_5) == 0x000310, "Member 'UHatMenu_C::Image_5' has a wrong offset!");
static_assert(offsetof(UHatMenu_C, Image_6) == 0x000318, "Member 'UHatMenu_C::Image_6' has a wrong offset!");
static_assert(offsetof(UHatMenu_C, Image_7) == 0x000320, "Member 'UHatMenu_C::Image_7' has a wrong offset!");
static_assert(offsetof(UHatMenu_C, GusRefrence) == 0x000328, "Member 'UHatMenu_C::GusRefrence' has a wrong offset!");
static_assert(offsetof(UHatMenu_C, Attach_mekshat) == 0x000330, "Member 'UHatMenu_C::Attach_mekshat' has a wrong offset!");
static_assert(offsetof(UHatMenu_C, Local_Hat_Number) == 0x000340, "Member 'UHatMenu_C::Local_Hat_Number' has a wrong offset!");
static_assert(offsetof(UHatMenu_C, SaveOptions) == 0x000348, "Member 'UHatMenu_C::SaveOptions' has a wrong offset!");
static_assert(offsetof(UHatMenu_C, Player_Kills) == 0x000350, "Member 'UHatMenu_C::Player_Kills' has a wrong offset!");
static_assert(offsetof(UHatMenu_C, Title_Number) == 0x000354, "Member 'UHatMenu_C::Title_Number' has a wrong offset!");
static_assert(offsetof(UHatMenu_C, HatNumber) == 0x000358, "Member 'UHatMenu_C::HatNumber' has a wrong offset!");
static_assert(offsetof(UHatMenu_C, Skin_Number) == 0x00035C, "Member 'UHatMenu_C::Skin_Number' has a wrong offset!");
static_assert(offsetof(UHatMenu_C, Weapon_1) == 0x000360, "Member 'UHatMenu_C::Weapon_1' has a wrong offset!");
static_assert(offsetof(UHatMenu_C, Weapon_2) == 0x000364, "Member 'UHatMenu_C::Weapon_2' has a wrong offset!");
static_assert(offsetof(UHatMenu_C, Pant_Type) == 0x000368, "Member 'UHatMenu_C::Pant_Type' has a wrong offset!");

}

