#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HatMenu

#include "Basic.hpp"


namespace SDK::Params
{

// Function HatMenu.HatMenu_C.Save Item
// 0x0030 (0x0030 - 0x0000)
struct HatMenu_C_Save_Item final
{
public:
	int32                                         Title;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Hat;                                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Skin;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PantType;                                          // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class USaveItems_C*                           CallFunc_CreateSaveGameObject_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HatMenu_C_Save_Item) == 0x000008, "Wrong alignment on HatMenu_C_Save_Item");
static_assert(sizeof(HatMenu_C_Save_Item) == 0x000030, "Wrong size on HatMenu_C_Save_Item");
static_assert(offsetof(HatMenu_C_Save_Item, Title) == 0x000000, "Member 'HatMenu_C_Save_Item::Title' has a wrong offset!");
static_assert(offsetof(HatMenu_C_Save_Item, Hat) == 0x000004, "Member 'HatMenu_C_Save_Item::Hat' has a wrong offset!");
static_assert(offsetof(HatMenu_C_Save_Item, Skin) == 0x000008, "Member 'HatMenu_C_Save_Item::Skin' has a wrong offset!");
static_assert(offsetof(HatMenu_C_Save_Item, PantType) == 0x000010, "Member 'HatMenu_C_Save_Item::PantType' has a wrong offset!");
static_assert(offsetof(HatMenu_C_Save_Item, CallFunc_CreateSaveGameObject_ReturnValue) == 0x000020, "Member 'HatMenu_C_Save_Item::CallFunc_CreateSaveGameObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatMenu_C_Save_Item, CallFunc_SaveGameToSlot_ReturnValue) == 0x000028, "Member 'HatMenu_C_Save_Item::CallFunc_SaveGameToSlot_ReturnValue' has a wrong offset!");

// Function HatMenu.HatMenu_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct HatMenu_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HatMenu_C_PreConstruct) == 0x000001, "Wrong alignment on HatMenu_C_PreConstruct");
static_assert(sizeof(HatMenu_C_PreConstruct) == 0x000001, "Wrong size on HatMenu_C_PreConstruct");
static_assert(offsetof(HatMenu_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'HatMenu_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function HatMenu.HatMenu_C.ExecuteUbergraph_HatMenu
// 0x00E0 (0x00E0 - 0x0000)
struct HatMenu_C_ExecuteUbergraph_HatMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue_1;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP_1;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue;            // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue_2;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP_2;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue_3;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP_3;            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue_4;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP_4;            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_2;        // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_3;        // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USavePlayerData_C*                      K2Node_DynamicCast_AsSave_Player_Data;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue_1;          // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue_1;           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveItems_C*                           K2Node_DynamicCast_AsSave_Items;                   // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue_2;          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue_2;           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveItems_C*                           K2Node_DynamicCast_AsSave_Items_1;                 // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HatMenu_C_ExecuteUbergraph_HatMenu) == 0x000008, "Wrong alignment on HatMenu_C_ExecuteUbergraph_HatMenu");
static_assert(sizeof(HatMenu_C_ExecuteUbergraph_HatMenu) == 0x0000E0, "Wrong size on HatMenu_C_ExecuteUbergraph_HatMenu");
static_assert(offsetof(HatMenu_C_ExecuteUbergraph_HatMenu, EntryPoint) == 0x000000, "Member 'HatMenu_C_ExecuteUbergraph_HatMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(HatMenu_C_ExecuteUbergraph_HatMenu, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000008, "Member 'HatMenu_C_ExecuteUbergraph_HatMenu::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatMenu_C_ExecuteUbergraph_HatMenu, K2Node_DynamicCast_AsTrain_Gus_Player) == 0x000010, "Member 'HatMenu_C_ExecuteUbergraph_HatMenu::K2Node_DynamicCast_AsTrain_Gus_Player' has a wrong offset!");
static_assert(offsetof(HatMenu_C_ExecuteUbergraph_HatMenu, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'HatMenu_C_ExecuteUbergraph_HatMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HatMenu_C_ExecuteUbergraph_HatMenu, CallFunc_GetPlayerState_ReturnValue) == 0x000020, "Member 'HatMenu_C_ExecuteUbergraph_HatMenu::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatMenu_C_ExecuteUbergraph_HatMenu, CallFunc_GetPlayerState_ReturnValue_1) == 0x000028, "Member 'HatMenu_C_ExecuteUbergraph_HatMenu::CallFunc_GetPlayerState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HatMenu_C_ExecuteUbergraph_HatMenu, K2Node_DynamicCast_AsPlayer_State_BP) == 0x000030, "Member 'HatMenu_C_ExecuteUbergraph_HatMenu::K2Node_DynamicCast_AsPlayer_State_BP' has a wrong offset!");
static_assert(offsetof(HatMenu_C_ExecuteUbergraph_HatMenu, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'HatMenu_C_ExecuteUbergraph_HatMenu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(HatMenu_C_ExecuteUbergraph_HatMenu, K2Node_DynamicCast_AsPlayer_State_BP_1) == 0x000040, "Member 'HatMenu_C_ExecuteUbergraph_HatMenu::K2Node_DynamicCast_AsPlayer_State_BP_1' has a wrong offset!");
static_assert(offsetof(HatMenu_C_ExecuteUbergraph_HatMenu, K2Node_DynamicCast_bSuccess_2) == 0x000048, "Member 'HatMenu_C_ExecuteUbergraph_HatMenu::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(HatMenu_C_ExecuteUbergraph_HatMenu, K2Node_Event_IsDesignTime) == 0x000049, "Member 'HatMenu_C_ExecuteUbergraph_HatMenu::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(HatMenu_C_ExecuteUbergraph_HatMenu, CallFunc_DoesSaveGameExist_ReturnValue) == 0x00004A, "Member 'HatMenu_C_ExecuteUbergraph_HatMenu::CallFunc_DoesSaveGameExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatMenu_C_ExecuteUbergraph_HatMenu, CallFunc_LoadGameFromSlot_ReturnValue) == 0x000050, "Member 'HatMenu_C_ExecuteUbergraph_HatMenu::CallFunc_LoadGameFromSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatMenu_C_ExecuteUbergraph_HatMenu, CallFunc_GetPlayerState_ReturnValue_2) == 0x000058, "Member 'HatMenu_C_ExecuteUbergraph_HatMenu::CallFunc_GetPlayerState_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HatMenu_C_ExecuteUbergraph_HatMenu, K2Node_DynamicCast_AsPlayer_State_BP_2) == 0x000060, "Member 'HatMenu_C_ExecuteUbergraph_HatMenu::K2Node_DynamicCast_AsPlayer_State_BP_2' has a wrong offset!");
static_assert(offsetof(HatMenu_C_ExecuteUbergraph_HatMenu, K2Node_DynamicCast_bSuccess_3) == 0x000068, "Member 'HatMenu_C_ExecuteUbergraph_HatMenu::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(HatMenu_C_ExecuteUbergraph_HatMenu, CallFunc_GetPlayerState_ReturnValue_3) == 0x000070, "Member 'HatMenu_C_ExecuteUbergraph_HatMenu::CallFunc_GetPlayerState_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(HatMenu_C_ExecuteUbergraph_HatMenu, K2Node_DynamicCast_AsPlayer_State_BP_3) == 0x000078, "Member 'HatMenu_C_ExecuteUbergraph_HatMenu::K2Node_DynamicCast_AsPlayer_State_BP_3' has a wrong offset!");
static_assert(offsetof(HatMenu_C_ExecuteUbergraph_HatMenu, K2Node_DynamicCast_bSuccess_4) == 0x000080, "Member 'HatMenu_C_ExecuteUbergraph_HatMenu::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(HatMenu_C_ExecuteUbergraph_HatMenu, CallFunc_GetPlayerState_ReturnValue_4) == 0x000088, "Member 'HatMenu_C_ExecuteUbergraph_HatMenu::CallFunc_GetPlayerState_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(HatMenu_C_ExecuteUbergraph_HatMenu, K2Node_DynamicCast_AsPlayer_State_BP_4) == 0x000090, "Member 'HatMenu_C_ExecuteUbergraph_HatMenu::K2Node_DynamicCast_AsPlayer_State_BP_4' has a wrong offset!");
static_assert(offsetof(HatMenu_C_ExecuteUbergraph_HatMenu, K2Node_DynamicCast_bSuccess_5) == 0x000098, "Member 'HatMenu_C_ExecuteUbergraph_HatMenu::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(HatMenu_C_ExecuteUbergraph_HatMenu, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000099, "Member 'HatMenu_C_ExecuteUbergraph_HatMenu::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatMenu_C_ExecuteUbergraph_HatMenu, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x00009A, "Member 'HatMenu_C_ExecuteUbergraph_HatMenu::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HatMenu_C_ExecuteUbergraph_HatMenu, CallFunc_GreaterEqual_IntInt_ReturnValue_2) == 0x00009B, "Member 'HatMenu_C_ExecuteUbergraph_HatMenu::CallFunc_GreaterEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HatMenu_C_ExecuteUbergraph_HatMenu, CallFunc_GreaterEqual_IntInt_ReturnValue_3) == 0x00009C, "Member 'HatMenu_C_ExecuteUbergraph_HatMenu::CallFunc_GreaterEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(HatMenu_C_ExecuteUbergraph_HatMenu, K2Node_DynamicCast_AsSave_Player_Data) == 0x0000A0, "Member 'HatMenu_C_ExecuteUbergraph_HatMenu::K2Node_DynamicCast_AsSave_Player_Data' has a wrong offset!");
static_assert(offsetof(HatMenu_C_ExecuteUbergraph_HatMenu, K2Node_DynamicCast_bSuccess_6) == 0x0000A8, "Member 'HatMenu_C_ExecuteUbergraph_HatMenu::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(HatMenu_C_ExecuteUbergraph_HatMenu, CallFunc_DoesSaveGameExist_ReturnValue_1) == 0x0000A9, "Member 'HatMenu_C_ExecuteUbergraph_HatMenu::CallFunc_DoesSaveGameExist_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HatMenu_C_ExecuteUbergraph_HatMenu, CallFunc_LoadGameFromSlot_ReturnValue_1) == 0x0000B0, "Member 'HatMenu_C_ExecuteUbergraph_HatMenu::CallFunc_LoadGameFromSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HatMenu_C_ExecuteUbergraph_HatMenu, K2Node_DynamicCast_AsSave_Items) == 0x0000B8, "Member 'HatMenu_C_ExecuteUbergraph_HatMenu::K2Node_DynamicCast_AsSave_Items' has a wrong offset!");
static_assert(offsetof(HatMenu_C_ExecuteUbergraph_HatMenu, K2Node_DynamicCast_bSuccess_7) == 0x0000C0, "Member 'HatMenu_C_ExecuteUbergraph_HatMenu::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(HatMenu_C_ExecuteUbergraph_HatMenu, CallFunc_DoesSaveGameExist_ReturnValue_2) == 0x0000C1, "Member 'HatMenu_C_ExecuteUbergraph_HatMenu::CallFunc_DoesSaveGameExist_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HatMenu_C_ExecuteUbergraph_HatMenu, CallFunc_LoadGameFromSlot_ReturnValue_2) == 0x0000C8, "Member 'HatMenu_C_ExecuteUbergraph_HatMenu::CallFunc_LoadGameFromSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HatMenu_C_ExecuteUbergraph_HatMenu, K2Node_DynamicCast_AsSave_Items_1) == 0x0000D0, "Member 'HatMenu_C_ExecuteUbergraph_HatMenu::K2Node_DynamicCast_AsSave_Items_1' has a wrong offset!");
static_assert(offsetof(HatMenu_C_ExecuteUbergraph_HatMenu, K2Node_DynamicCast_bSuccess_8) == 0x0000D8, "Member 'HatMenu_C_ExecuteUbergraph_HatMenu::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");

// Function HatMenu.HatMenu_C.EnableNoHat
// 0x0020 (0x0020 - 0x0000)
struct HatMenu_C_EnableNoHat final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HatMenu_C_EnableNoHat) == 0x000008, "Wrong alignment on HatMenu_C_EnableNoHat");
static_assert(sizeof(HatMenu_C_EnableNoHat) == 0x000020, "Wrong size on HatMenu_C_EnableNoHat");
static_assert(offsetof(HatMenu_C_EnableNoHat, ReturnValue) == 0x000000, "Member 'HatMenu_C_EnableNoHat::ReturnValue' has a wrong offset!");
static_assert(offsetof(HatMenu_C_EnableNoHat, CallFunc_GetPlayerState_ReturnValue) == 0x000008, "Member 'HatMenu_C_EnableNoHat::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatMenu_C_EnableNoHat, K2Node_DynamicCast_AsPlayer_State_BP) == 0x000010, "Member 'HatMenu_C_EnableNoHat::K2Node_DynamicCast_AsPlayer_State_BP' has a wrong offset!");
static_assert(offsetof(HatMenu_C_EnableNoHat, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'HatMenu_C_EnableNoHat::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HatMenu_C_EnableNoHat, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000019, "Member 'HatMenu_C_EnableNoHat::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function HatMenu.HatMenu_C.EnableMeksHat
// 0x0028 (0x0028 - 0x0000)
struct HatMenu_C_EnableMeksHat final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HatMenu_C_EnableMeksHat) == 0x000008, "Wrong alignment on HatMenu_C_EnableMeksHat");
static_assert(sizeof(HatMenu_C_EnableMeksHat) == 0x000028, "Wrong size on HatMenu_C_EnableMeksHat");
static_assert(offsetof(HatMenu_C_EnableMeksHat, ReturnValue) == 0x000000, "Member 'HatMenu_C_EnableMeksHat::ReturnValue' has a wrong offset!");
static_assert(offsetof(HatMenu_C_EnableMeksHat, CallFunc_GetPlayerState_ReturnValue) == 0x000008, "Member 'HatMenu_C_EnableMeksHat::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatMenu_C_EnableMeksHat, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000010, "Member 'HatMenu_C_EnableMeksHat::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatMenu_C_EnableMeksHat, K2Node_DynamicCast_AsPlayer_State_BP) == 0x000018, "Member 'HatMenu_C_EnableMeksHat::K2Node_DynamicCast_AsPlayer_State_BP' has a wrong offset!");
static_assert(offsetof(HatMenu_C_EnableMeksHat, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'HatMenu_C_EnableMeksHat::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HatMenu_C_EnableMeksHat, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000021, "Member 'HatMenu_C_EnableMeksHat::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function HatMenu.HatMenu_C.EnableHeisengusHat
// 0x0028 (0x0028 - 0x0000)
struct HatMenu_C_EnableHeisengusHat final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HatMenu_C_EnableHeisengusHat) == 0x000008, "Wrong alignment on HatMenu_C_EnableHeisengusHat");
static_assert(sizeof(HatMenu_C_EnableHeisengusHat) == 0x000028, "Wrong size on HatMenu_C_EnableHeisengusHat");
static_assert(offsetof(HatMenu_C_EnableHeisengusHat, ReturnValue) == 0x000000, "Member 'HatMenu_C_EnableHeisengusHat::ReturnValue' has a wrong offset!");
static_assert(offsetof(HatMenu_C_EnableHeisengusHat, CallFunc_GetPlayerState_ReturnValue) == 0x000008, "Member 'HatMenu_C_EnableHeisengusHat::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatMenu_C_EnableHeisengusHat, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000010, "Member 'HatMenu_C_EnableHeisengusHat::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatMenu_C_EnableHeisengusHat, K2Node_DynamicCast_AsPlayer_State_BP) == 0x000018, "Member 'HatMenu_C_EnableHeisengusHat::K2Node_DynamicCast_AsPlayer_State_BP' has a wrong offset!");
static_assert(offsetof(HatMenu_C_EnableHeisengusHat, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'HatMenu_C_EnableHeisengusHat::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HatMenu_C_EnableHeisengusHat, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000021, "Member 'HatMenu_C_EnableHeisengusHat::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function HatMenu.HatMenu_C.EnableCheeseHat
// 0x0028 (0x0028 - 0x0000)
struct HatMenu_C_EnableCheeseHat final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HatMenu_C_EnableCheeseHat) == 0x000008, "Wrong alignment on HatMenu_C_EnableCheeseHat");
static_assert(sizeof(HatMenu_C_EnableCheeseHat) == 0x000028, "Wrong size on HatMenu_C_EnableCheeseHat");
static_assert(offsetof(HatMenu_C_EnableCheeseHat, ReturnValue) == 0x000000, "Member 'HatMenu_C_EnableCheeseHat::ReturnValue' has a wrong offset!");
static_assert(offsetof(HatMenu_C_EnableCheeseHat, CallFunc_GetPlayerState_ReturnValue) == 0x000008, "Member 'HatMenu_C_EnableCheeseHat::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatMenu_C_EnableCheeseHat, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000010, "Member 'HatMenu_C_EnableCheeseHat::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatMenu_C_EnableCheeseHat, K2Node_DynamicCast_AsPlayer_State_BP) == 0x000018, "Member 'HatMenu_C_EnableCheeseHat::K2Node_DynamicCast_AsPlayer_State_BP' has a wrong offset!");
static_assert(offsetof(HatMenu_C_EnableCheeseHat, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'HatMenu_C_EnableCheeseHat::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HatMenu_C_EnableCheeseHat, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000021, "Member 'HatMenu_C_EnableCheeseHat::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function HatMenu.HatMenu_C.EnableBucketHat
// 0x0028 (0x0028 - 0x0000)
struct HatMenu_C_EnableBucketHat final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HatMenu_C_EnableBucketHat) == 0x000008, "Wrong alignment on HatMenu_C_EnableBucketHat");
static_assert(sizeof(HatMenu_C_EnableBucketHat) == 0x000028, "Wrong size on HatMenu_C_EnableBucketHat");
static_assert(offsetof(HatMenu_C_EnableBucketHat, ReturnValue) == 0x000000, "Member 'HatMenu_C_EnableBucketHat::ReturnValue' has a wrong offset!");
static_assert(offsetof(HatMenu_C_EnableBucketHat, CallFunc_GetPlayerState_ReturnValue) == 0x000008, "Member 'HatMenu_C_EnableBucketHat::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(HatMenu_C_EnableBucketHat, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000010, "Member 'HatMenu_C_EnableBucketHat::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
