#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: hitmarker

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function hitmarker.hitmarker_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct hitmarker_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(hitmarker_C_PreConstruct) == 0x000001, "Wrong alignment on hitmarker_C_PreConstruct");
static_assert(sizeof(hitmarker_C_PreConstruct) == 0x000001, "Wrong size on hitmarker_C_PreConstruct");
static_assert(offsetof(hitmarker_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'hitmarker_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function hitmarker.hitmarker_C.ExecuteUbergraph_hitmarker
// 0x0200 (0x0200 - 0x0000)
struct hitmarker_C_ExecuteUbergraph_hitmarker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0010(0x00D0)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue;             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveOptions_C*                         K2Node_DynamicCast_AsSave_Options;                 // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x010C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess_1;                  // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_123[0xD];                                      // 0x0123(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x0130(0x00D0)()
};
static_assert(alignof(hitmarker_C_ExecuteUbergraph_hitmarker) == 0x000010, "Wrong alignment on hitmarker_C_ExecuteUbergraph_hitmarker");
static_assert(sizeof(hitmarker_C_ExecuteUbergraph_hitmarker) == 0x000200, "Wrong size on hitmarker_C_ExecuteUbergraph_hitmarker");
static_assert(offsetof(hitmarker_C_ExecuteUbergraph_hitmarker, EntryPoint) == 0x000000, "Member 'hitmarker_C_ExecuteUbergraph_hitmarker::EntryPoint' has a wrong offset!");
static_assert(offsetof(hitmarker_C_ExecuteUbergraph_hitmarker, K2Node_MakeStruct_SlateBrush) == 0x000010, "Member 'hitmarker_C_ExecuteUbergraph_hitmarker::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(hitmarker_C_ExecuteUbergraph_hitmarker, K2Node_Event_IsDesignTime) == 0x0000E0, "Member 'hitmarker_C_ExecuteUbergraph_hitmarker::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(hitmarker_C_ExecuteUbergraph_hitmarker, CallFunc_PlayAnimation_ReturnValue) == 0x0000E8, "Member 'hitmarker_C_ExecuteUbergraph_hitmarker::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(hitmarker_C_ExecuteUbergraph_hitmarker, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000F0, "Member 'hitmarker_C_ExecuteUbergraph_hitmarker::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(hitmarker_C_ExecuteUbergraph_hitmarker, CallFunc_LoadGameFromSlot_ReturnValue) == 0x0000F8, "Member 'hitmarker_C_ExecuteUbergraph_hitmarker::CallFunc_LoadGameFromSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(hitmarker_C_ExecuteUbergraph_hitmarker, K2Node_DynamicCast_AsSave_Options) == 0x000100, "Member 'hitmarker_C_ExecuteUbergraph_hitmarker::K2Node_DynamicCast_AsSave_Options' has a wrong offset!");
static_assert(offsetof(hitmarker_C_ExecuteUbergraph_hitmarker, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'hitmarker_C_ExecuteUbergraph_hitmarker::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(hitmarker_C_ExecuteUbergraph_hitmarker, CallFunc_Conv_StringToName_ReturnValue) == 0x00010C, "Member 'hitmarker_C_ExecuteUbergraph_hitmarker::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(hitmarker_C_ExecuteUbergraph_hitmarker, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000114, "Member 'hitmarker_C_ExecuteUbergraph_hitmarker::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(hitmarker_C_ExecuteUbergraph_hitmarker, CallFunc_Conv_StringToName_ReturnValue_1) == 0x000118, "Member 'hitmarker_C_ExecuteUbergraph_hitmarker::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(hitmarker_C_ExecuteUbergraph_hitmarker, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000120, "Member 'hitmarker_C_ExecuteUbergraph_hitmarker::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(hitmarker_C_ExecuteUbergraph_hitmarker, K2Node_SwitchString_CmpSuccess) == 0x000121, "Member 'hitmarker_C_ExecuteUbergraph_hitmarker::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(hitmarker_C_ExecuteUbergraph_hitmarker, K2Node_SwitchString_CmpSuccess_1) == 0x000122, "Member 'hitmarker_C_ExecuteUbergraph_hitmarker::K2Node_SwitchString_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(hitmarker_C_ExecuteUbergraph_hitmarker, K2Node_MakeStruct_SlateBrush_1) == 0x000130, "Member 'hitmarker_C_ExecuteUbergraph_hitmarker::K2Node_MakeStruct_SlateBrush_1' has a wrong offset!");

}

