#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUD_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass HUD_BP.HUD_BP_C
// 0x0018 (0x0380 - 0x0368)
class AHUD_BP_C final : public AHUD
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCTF_Hud_C*                             CTFHUDREF;                                         // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void Give_me_spawn_points();
	void Gimmie_HUD();
	void Gimmie_CTF();
	void ExecuteUbergraph_HUD_BP(int32 EntryPoint);
	void Change_on_widget(int32 Red_score_Widget);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HUD_BP_C">();
	}
	static class AHUD_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHUD_BP_C>();
	}
};
static_assert(alignof(AHUD_BP_C) == 0x000008, "Wrong alignment on AHUD_BP_C");
static_assert(sizeof(AHUD_BP_C) == 0x000380, "Wrong size on AHUD_BP_C");
static_assert(offsetof(AHUD_BP_C, UberGraphFrame) == 0x000368, "Member 'AHUD_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AHUD_BP_C, DefaultSceneRoot) == 0x000370, "Member 'AHUD_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AHUD_BP_C, CTFHUDREF) == 0x000378, "Member 'AHUD_BP_C::CTFHUDREF' has a wrong offset!");

}

