#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUD_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function HUD_BP.HUD_BP_C.ExecuteUbergraph_HUD_BP
// 0x0008 (0x0008 - 0x0000)
struct HUD_BP_C_ExecuteUbergraph_HUD_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Red_score_Widget;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUD_BP_C_ExecuteUbergraph_HUD_BP) == 0x000004, "Wrong alignment on HUD_BP_C_ExecuteUbergraph_HUD_BP");
static_assert(sizeof(HUD_BP_C_ExecuteUbergraph_HUD_BP) == 0x000008, "Wrong size on HUD_BP_C_ExecuteUbergraph_HUD_BP");
static_assert(offsetof(HUD_BP_C_ExecuteUbergraph_HUD_BP, EntryPoint) == 0x000000, "Member 'HUD_BP_C_ExecuteUbergraph_HUD_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(HUD_BP_C_ExecuteUbergraph_HUD_BP, K2Node_CustomEvent_Red_score_Widget) == 0x000004, "Member 'HUD_BP_C_ExecuteUbergraph_HUD_BP::K2Node_CustomEvent_Red_score_Widget' has a wrong offset!");

// Function HUD_BP.HUD_BP_C.Change on widget
// 0x0004 (0x0004 - 0x0000)
struct HUD_BP_C_Change_on_widget final
{
public:
	int32                                         Red_score_Widget;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUD_BP_C_Change_on_widget) == 0x000004, "Wrong alignment on HUD_BP_C_Change_on_widget");
static_assert(sizeof(HUD_BP_C_Change_on_widget) == 0x000004, "Wrong size on HUD_BP_C_Change_on_widget");
static_assert(offsetof(HUD_BP_C_Change_on_widget, Red_score_Widget) == 0x000000, "Member 'HUD_BP_C_Change_on_widget::Red_score_Widget' has a wrong offset!");

}

