#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InteractBlunderbomb_Widget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass InteractBlunderbomb_Widget.InteractBlunderbomb_Widget_C
// 0x0020 (0x0298 - 0x0278)
class AInteractBlunderbomb_Widget_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetComponent*                       Widget;                                            // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABlunderbomb_Barrel_C*                  Barrel_Ref;                                        // 0x0290(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ExecuteUbergraph_InteractBlunderbomb_Widget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InteractBlunderbomb_Widget_C">();
	}
	static class AInteractBlunderbomb_Widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AInteractBlunderbomb_Widget_C>();
	}
};
static_assert(alignof(AInteractBlunderbomb_Widget_C) == 0x000008, "Wrong alignment on AInteractBlunderbomb_Widget_C");
static_assert(sizeof(AInteractBlunderbomb_Widget_C) == 0x000298, "Wrong size on AInteractBlunderbomb_Widget_C");
static_assert(offsetof(AInteractBlunderbomb_Widget_C, UberGraphFrame) == 0x000278, "Member 'AInteractBlunderbomb_Widget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AInteractBlunderbomb_Widget_C, Widget) == 0x000280, "Member 'AInteractBlunderbomb_Widget_C::Widget' has a wrong offset!");
static_assert(offsetof(AInteractBlunderbomb_Widget_C, DefaultSceneRoot) == 0x000288, "Member 'AInteractBlunderbomb_Widget_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AInteractBlunderbomb_Widget_C, Barrel_Ref) == 0x000290, "Member 'AInteractBlunderbomb_Widget_C::Barrel_Ref' has a wrong offset!");

}

