#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InteractBannana_Widget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass InteractBannana_Widget.InteractBannana_Widget_C
// 0x0020 (0x0298 - 0x0278)
class AInteractBannana_Widget_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetComponent*                       Widget;                                            // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABannana_Barrel_C*                      Barrel_Ref;                                        // 0x0290(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ExecuteUbergraph_InteractBannana_Widget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InteractBannana_Widget_C">();
	}
	static class AInteractBannana_Widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AInteractBannana_Widget_C>();
	}
};
static_assert(alignof(AInteractBannana_Widget_C) == 0x000008, "Wrong alignment on AInteractBannana_Widget_C");
static_assert(sizeof(AInteractBannana_Widget_C) == 0x000298, "Wrong size on AInteractBannana_Widget_C");
static_assert(offsetof(AInteractBannana_Widget_C, UberGraphFrame) == 0x000278, "Member 'AInteractBannana_Widget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AInteractBannana_Widget_C, Widget) == 0x000280, "Member 'AInteractBannana_Widget_C::Widget' has a wrong offset!");
static_assert(offsetof(AInteractBannana_Widget_C, DefaultSceneRoot) == 0x000288, "Member 'AInteractBannana_Widget_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AInteractBannana_Widget_C, Barrel_Ref) == 0x000290, "Member 'AInteractBannana_Widget_C::Barrel_Ref' has a wrong offset!");

}

