#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InteractBannana_Widget

#include "Basic.hpp"


namespace SDK::Params
{

// Function InteractBannana_Widget.InteractBannana_Widget_C.ExecuteUbergraph_InteractBannana_Widget
// 0x0038 (0x0038 - 0x0000)
struct InteractBannana_Widget_C_ExecuteUbergraph_InteractBannana_Widget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBannana_widget_C*                      K2Node_DynamicCast_AsBannana_Widget;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InteractBannana_Widget_C_ExecuteUbergraph_InteractBannana_Widget) == 0x000008, "Wrong alignment on InteractBannana_Widget_C_ExecuteUbergraph_InteractBannana_Widget");
static_assert(sizeof(InteractBannana_Widget_C_ExecuteUbergraph_InteractBannana_Widget) == 0x000038, "Wrong size on InteractBannana_Widget_C_ExecuteUbergraph_InteractBannana_Widget");
static_assert(offsetof(InteractBannana_Widget_C_ExecuteUbergraph_InteractBannana_Widget, EntryPoint) == 0x000000, "Member 'InteractBannana_Widget_C_ExecuteUbergraph_InteractBannana_Widget::EntryPoint' has a wrong offset!");
static_assert(offsetof(InteractBannana_Widget_C_ExecuteUbergraph_InteractBannana_Widget, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'InteractBannana_Widget_C_ExecuteUbergraph_InteractBannana_Widget::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractBannana_Widget_C_ExecuteUbergraph_InteractBannana_Widget, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000010, "Member 'InteractBannana_Widget_C_ExecuteUbergraph_InteractBannana_Widget::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractBannana_Widget_C_ExecuteUbergraph_InteractBannana_Widget, K2Node_DynamicCast_AsTrain_Gus_Player) == 0x000018, "Member 'InteractBannana_Widget_C_ExecuteUbergraph_InteractBannana_Widget::K2Node_DynamicCast_AsTrain_Gus_Player' has a wrong offset!");
static_assert(offsetof(InteractBannana_Widget_C_ExecuteUbergraph_InteractBannana_Widget, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'InteractBannana_Widget_C_ExecuteUbergraph_InteractBannana_Widget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(InteractBannana_Widget_C_ExecuteUbergraph_InteractBannana_Widget, K2Node_DynamicCast_AsBannana_Widget) == 0x000028, "Member 'InteractBannana_Widget_C_ExecuteUbergraph_InteractBannana_Widget::K2Node_DynamicCast_AsBannana_Widget' has a wrong offset!");
static_assert(offsetof(InteractBannana_Widget_C_ExecuteUbergraph_InteractBannana_Widget, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'InteractBannana_Widget_C_ExecuteUbergraph_InteractBannana_Widget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

