#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InteractBlunderbomb_Widget

#include "Basic.hpp"


namespace SDK::Params
{

// Function InteractBlunderbomb_Widget.InteractBlunderbomb_Widget_C.ExecuteUbergraph_InteractBlunderbomb_Widget
// 0x0038 (0x0038 - 0x0000)
struct InteractBlunderbomb_Widget_C_ExecuteUbergraph_InteractBlunderbomb_Widget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlunderbomb_widget_C*                  K2Node_DynamicCast_AsBlunderbomb_Widget;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InteractBlunderbomb_Widget_C_ExecuteUbergraph_InteractBlunderbomb_Widget) == 0x000008, "Wrong alignment on InteractBlunderbomb_Widget_C_ExecuteUbergraph_InteractBlunderbomb_Widget");
static_assert(sizeof(InteractBlunderbomb_Widget_C_ExecuteUbergraph_InteractBlunderbomb_Widget) == 0x000038, "Wrong size on InteractBlunderbomb_Widget_C_ExecuteUbergraph_InteractBlunderbomb_Widget");
static_assert(offsetof(InteractBlunderbomb_Widget_C_ExecuteUbergraph_InteractBlunderbomb_Widget, EntryPoint) == 0x000000, "Member 'InteractBlunderbomb_Widget_C_ExecuteUbergraph_InteractBlunderbomb_Widget::EntryPoint' has a wrong offset!");
static_assert(offsetof(InteractBlunderbomb_Widget_C_ExecuteUbergraph_InteractBlunderbomb_Widget, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000008, "Member 'InteractBlunderbomb_Widget_C_ExecuteUbergraph_InteractBlunderbomb_Widget::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractBlunderbomb_Widget_C_ExecuteUbergraph_InteractBlunderbomb_Widget, K2Node_DynamicCast_AsBlunderbomb_Widget) == 0x000010, "Member 'InteractBlunderbomb_Widget_C_ExecuteUbergraph_InteractBlunderbomb_Widget::K2Node_DynamicCast_AsBlunderbomb_Widget' has a wrong offset!");
static_assert(offsetof(InteractBlunderbomb_Widget_C_ExecuteUbergraph_InteractBlunderbomb_Widget, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'InteractBlunderbomb_Widget_C_ExecuteUbergraph_InteractBlunderbomb_Widget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(InteractBlunderbomb_Widget_C_ExecuteUbergraph_InteractBlunderbomb_Widget, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'InteractBlunderbomb_Widget_C_ExecuteUbergraph_InteractBlunderbomb_Widget::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractBlunderbomb_Widget_C_ExecuteUbergraph_InteractBlunderbomb_Widget, K2Node_DynamicCast_AsTrain_Gus_Player) == 0x000028, "Member 'InteractBlunderbomb_Widget_C_ExecuteUbergraph_InteractBlunderbomb_Widget::K2Node_DynamicCast_AsTrain_Gus_Player' has a wrong offset!");
static_assert(offsetof(InteractBlunderbomb_Widget_C_ExecuteUbergraph_InteractBlunderbomb_Widget, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'InteractBlunderbomb_Widget_C_ExecuteUbergraph_InteractBlunderbomb_Widget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

