#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KeybindMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function KeybindMenu.KeybindMenu_C.UpdateSens
// 0x0004 (0x0004 - 0x0000)
struct KeybindMenu_C_UpdateSens final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KeybindMenu_C_UpdateSens) == 0x000004, "Wrong alignment on KeybindMenu_C_UpdateSens");
static_assert(sizeof(KeybindMenu_C_UpdateSens) == 0x000004, "Wrong size on KeybindMenu_C_UpdateSens");
static_assert(offsetof(KeybindMenu_C_UpdateSens, InValue) == 0x000000, "Member 'KeybindMenu_C_UpdateSens::InValue' has a wrong offset!");

// Function KeybindMenu.KeybindMenu_C.Update Widget
// 0x0008 (0x0008 - 0x0000)
struct KeybindMenu_C_Update_Widget final
{
public:
	double                                        Field_Of_Vision;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KeybindMenu_C_Update_Widget) == 0x000008, "Wrong alignment on KeybindMenu_C_Update_Widget");
static_assert(sizeof(KeybindMenu_C_Update_Widget) == 0x000008, "Wrong size on KeybindMenu_C_Update_Widget");
static_assert(offsetof(KeybindMenu_C_Update_Widget, Field_Of_Vision) == 0x000000, "Member 'KeybindMenu_C_Update_Widget::Field_Of_Vision' has a wrong offset!");

// Function KeybindMenu.KeybindMenu_C.SniperSensSliderValue
// 0x00B0 (0x00B0 - 0x0000)
struct KeybindMenu_C_SniperSensSliderValue final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0090(0x0018)()
	double                                        CallFunc_Multiply_DoubleDouble_A_WideningCast;     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KeybindMenu_C_SniperSensSliderValue) == 0x000008, "Wrong alignment on KeybindMenu_C_SniperSensSliderValue");
static_assert(sizeof(KeybindMenu_C_SniperSensSliderValue) == 0x0000B0, "Wrong size on KeybindMenu_C_SniperSensSliderValue");
static_assert(offsetof(KeybindMenu_C_SniperSensSliderValue, ReturnValue) == 0x000000, "Member 'KeybindMenu_C_SniperSensSliderValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_SniperSensSliderValue, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000018, "Member 'KeybindMenu_C_SniperSensSliderValue::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_SniperSensSliderValue, CallFunc_Round_ReturnValue) == 0x000020, "Member 'KeybindMenu_C_SniperSensSliderValue::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_SniperSensSliderValue, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000028, "Member 'KeybindMenu_C_SniperSensSliderValue::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_SniperSensSliderValue, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'KeybindMenu_C_SniperSensSliderValue::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_SniperSensSliderValue, K2Node_MakeArray_Array) == 0x000080, "Member 'KeybindMenu_C_SniperSensSliderValue::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_SniperSensSliderValue, CallFunc_Format_ReturnValue) == 0x000090, "Member 'KeybindMenu_C_SniperSensSliderValue::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_SniperSensSliderValue, CallFunc_Multiply_DoubleDouble_A_WideningCast) == 0x0000A8, "Member 'KeybindMenu_C_SniperSensSliderValue::CallFunc_Multiply_DoubleDouble_A_WideningCast' has a wrong offset!");

// Function KeybindMenu.KeybindMenu_C.Sniper Sens Updateinator
// 0x0004 (0x0004 - 0x0000)
struct KeybindMenu_C_Sniper_Sens_Updateinator final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KeybindMenu_C_Sniper_Sens_Updateinator) == 0x000004, "Wrong alignment on KeybindMenu_C_Sniper_Sens_Updateinator");
static_assert(sizeof(KeybindMenu_C_Sniper_Sens_Updateinator) == 0x000004, "Wrong size on KeybindMenu_C_Sniper_Sens_Updateinator");
static_assert(offsetof(KeybindMenu_C_Sniper_Sens_Updateinator, InValue) == 0x000000, "Member 'KeybindMenu_C_Sniper_Sens_Updateinator::InValue' has a wrong offset!");

// Function KeybindMenu.KeybindMenu_C.SensSliderValue
// 0x00B0 (0x00B0 - 0x0000)
struct KeybindMenu_C_SensSliderValue final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0090(0x0018)()
	double                                        CallFunc_Multiply_DoubleDouble_A_WideningCast;     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KeybindMenu_C_SensSliderValue) == 0x000008, "Wrong alignment on KeybindMenu_C_SensSliderValue");
static_assert(sizeof(KeybindMenu_C_SensSliderValue) == 0x0000B0, "Wrong size on KeybindMenu_C_SensSliderValue");
static_assert(offsetof(KeybindMenu_C_SensSliderValue, ReturnValue) == 0x000000, "Member 'KeybindMenu_C_SensSliderValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_SensSliderValue, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000018, "Member 'KeybindMenu_C_SensSliderValue::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_SensSliderValue, CallFunc_Round_ReturnValue) == 0x000020, "Member 'KeybindMenu_C_SensSliderValue::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_SensSliderValue, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000028, "Member 'KeybindMenu_C_SensSliderValue::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_SensSliderValue, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'KeybindMenu_C_SensSliderValue::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_SensSliderValue, K2Node_MakeArray_Array) == 0x000080, "Member 'KeybindMenu_C_SensSliderValue::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_SensSliderValue, CallFunc_Format_ReturnValue) == 0x000090, "Member 'KeybindMenu_C_SensSliderValue::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_SensSliderValue, CallFunc_Multiply_DoubleDouble_A_WideningCast) == 0x0000A8, "Member 'KeybindMenu_C_SensSliderValue::CallFunc_Multiply_DoubleDouble_A_WideningCast' has a wrong offset!");

// Function KeybindMenu.KeybindMenu_C.SensSliderPlacement
// 0x0008 (0x0008 - 0x0000)
struct KeybindMenu_C_SensSliderPlacement final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_NarrowingCast;   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KeybindMenu_C_SensSliderPlacement) == 0x000004, "Wrong alignment on KeybindMenu_C_SensSliderPlacement");
static_assert(sizeof(KeybindMenu_C_SensSliderPlacement) == 0x000008, "Wrong size on KeybindMenu_C_SensSliderPlacement");
static_assert(offsetof(KeybindMenu_C_SensSliderPlacement, ReturnValue) == 0x000000, "Member 'KeybindMenu_C_SensSliderPlacement::ReturnValue' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_SensSliderPlacement, K2Node_FunctionResult_ReturnValue_NarrowingCast) == 0x000004, "Member 'KeybindMenu_C_SensSliderPlacement::K2Node_FunctionResult_ReturnValue_NarrowingCast' has a wrong offset!");

// Function KeybindMenu.KeybindMenu_C.Save Hitmarker Settings
// 0x0018 (0x0018 - 0x0000)
struct KeybindMenu_C_Save_Hitmarker_Settings final
{
public:
	class USaveOptions_C*                         CallFunc_CreateSaveGameObject_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveOptions_C*                         K2Node_DynamicCast_AsSave_Options;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KeybindMenu_C_Save_Hitmarker_Settings) == 0x000008, "Wrong alignment on KeybindMenu_C_Save_Hitmarker_Settings");
static_assert(sizeof(KeybindMenu_C_Save_Hitmarker_Settings) == 0x000018, "Wrong size on KeybindMenu_C_Save_Hitmarker_Settings");
static_assert(offsetof(KeybindMenu_C_Save_Hitmarker_Settings, CallFunc_CreateSaveGameObject_ReturnValue) == 0x000000, "Member 'KeybindMenu_C_Save_Hitmarker_Settings::CallFunc_CreateSaveGameObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_Save_Hitmarker_Settings, K2Node_DynamicCast_AsSave_Options) == 0x000008, "Member 'KeybindMenu_C_Save_Hitmarker_Settings::K2Node_DynamicCast_AsSave_Options' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_Save_Hitmarker_Settings, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'KeybindMenu_C_Save_Hitmarker_Settings::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function KeybindMenu.KeybindMenu_C.Save game
// 0x0070 (0x0070 - 0x0000)
struct KeybindMenu_C_Save_game final
{
public:
	double                                        Field_Of_Vision;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Mouse_sens;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Snipersens;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BlunderPistolSens;                                 // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Kill_Confirmed_Widget_0;                           // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Hitmarker_Size_0;                                  // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Hitmarker_Type_0;                                  // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Lumin_0;                                           // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveOptions_C*                         K2Node_DynamicCast_AsSave_Options;                 // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveOptions_C*                         CallFunc_CreateSaveGameObject_ReturnValue;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KeybindMenu_C_Save_game) == 0x000008, "Wrong alignment on KeybindMenu_C_Save_game");
static_assert(sizeof(KeybindMenu_C_Save_game) == 0x000070, "Wrong size on KeybindMenu_C_Save_game");
static_assert(offsetof(KeybindMenu_C_Save_game, Field_Of_Vision) == 0x000000, "Member 'KeybindMenu_C_Save_game::Field_Of_Vision' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_Save_game, Mouse_sens) == 0x000008, "Member 'KeybindMenu_C_Save_game::Mouse_sens' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_Save_game, Snipersens) == 0x000010, "Member 'KeybindMenu_C_Save_game::Snipersens' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_Save_game, BlunderPistolSens) == 0x000018, "Member 'KeybindMenu_C_Save_game::BlunderPistolSens' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_Save_game, Kill_Confirmed_Widget_0) == 0x000020, "Member 'KeybindMenu_C_Save_game::Kill_Confirmed_Widget_0' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_Save_game, Hitmarker_Size_0) == 0x000028, "Member 'KeybindMenu_C_Save_game::Hitmarker_Size_0' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_Save_game, Hitmarker_Type_0) == 0x000038, "Member 'KeybindMenu_C_Save_game::Hitmarker_Type_0' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_Save_game, Lumin_0) == 0x000048, "Member 'KeybindMenu_C_Save_game::Lumin_0' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_Save_game, K2Node_DynamicCast_AsSave_Options) == 0x000050, "Member 'KeybindMenu_C_Save_game::K2Node_DynamicCast_AsSave_Options' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_Save_game, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'KeybindMenu_C_Save_game::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_Save_game, CallFunc_CreateSaveGameObject_ReturnValue) == 0x000060, "Member 'KeybindMenu_C_Save_game::CallFunc_CreateSaveGameObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_Save_game, CallFunc_SaveGameToSlot_ReturnValue) == 0x000068, "Member 'KeybindMenu_C_Save_game::CallFunc_SaveGameToSlot_ReturnValue' has a wrong offset!");

// Function KeybindMenu.KeybindMenu_C.PistolBussSensSliderValue
// 0x00A8 (0x00A8 - 0x0000)
struct KeybindMenu_C_PistolBussSensSliderValue final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0090(0x0018)()
};
static_assert(alignof(KeybindMenu_C_PistolBussSensSliderValue) == 0x000008, "Wrong alignment on KeybindMenu_C_PistolBussSensSliderValue");
static_assert(sizeof(KeybindMenu_C_PistolBussSensSliderValue) == 0x0000A8, "Wrong size on KeybindMenu_C_PistolBussSensSliderValue");
static_assert(offsetof(KeybindMenu_C_PistolBussSensSliderValue, ReturnValue) == 0x000000, "Member 'KeybindMenu_C_PistolBussSensSliderValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_PistolBussSensSliderValue, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000018, "Member 'KeybindMenu_C_PistolBussSensSliderValue::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_PistolBussSensSliderValue, CallFunc_Round_ReturnValue) == 0x000020, "Member 'KeybindMenu_C_PistolBussSensSliderValue::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_PistolBussSensSliderValue, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000028, "Member 'KeybindMenu_C_PistolBussSensSliderValue::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_PistolBussSensSliderValue, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'KeybindMenu_C_PistolBussSensSliderValue::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_PistolBussSensSliderValue, K2Node_MakeArray_Array) == 0x000080, "Member 'KeybindMenu_C_PistolBussSensSliderValue::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_PistolBussSensSliderValue, CallFunc_Format_ReturnValue) == 0x000090, "Member 'KeybindMenu_C_PistolBussSensSliderValue::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function KeybindMenu.KeybindMenu_C.Pistol Buss Updateinator
// 0x0004 (0x0004 - 0x0000)
struct KeybindMenu_C_Pistol_Buss_Updateinator final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KeybindMenu_C_Pistol_Buss_Updateinator) == 0x000004, "Wrong alignment on KeybindMenu_C_Pistol_Buss_Updateinator");
static_assert(sizeof(KeybindMenu_C_Pistol_Buss_Updateinator) == 0x000004, "Wrong size on KeybindMenu_C_Pistol_Buss_Updateinator");
static_assert(offsetof(KeybindMenu_C_Pistol_Buss_Updateinator, InValue) == 0x000000, "Member 'KeybindMenu_C_Pistol_Buss_Updateinator::InValue' has a wrong offset!");

// Function KeybindMenu.KeybindMenu_C.Load game
// 0x0060 (0x0060 - 0x0000)
struct KeybindMenu_C_Load_game final
{
public:
	double                                        Field_Of_Vision;                                   // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Mouse_sens;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Sniper_Sens_0;                                     // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BlunderPistolSens;                                 // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Kill_Confirmed_Widget_0;                           // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Lumin_0;                                           // 0x0021(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Hitmarker_Size_0;                                  // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Hitmarker_Type_0;                                  // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveOptions_C*                         K2Node_DynamicCast_AsSave_Options;                 // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue;            // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KeybindMenu_C_Load_game) == 0x000008, "Wrong alignment on KeybindMenu_C_Load_game");
static_assert(sizeof(KeybindMenu_C_Load_game) == 0x000060, "Wrong size on KeybindMenu_C_Load_game");
static_assert(offsetof(KeybindMenu_C_Load_game, Field_Of_Vision) == 0x000000, "Member 'KeybindMenu_C_Load_game::Field_Of_Vision' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_Load_game, Mouse_sens) == 0x000008, "Member 'KeybindMenu_C_Load_game::Mouse_sens' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_Load_game, Sniper_Sens_0) == 0x000010, "Member 'KeybindMenu_C_Load_game::Sniper_Sens_0' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_Load_game, BlunderPistolSens) == 0x000018, "Member 'KeybindMenu_C_Load_game::BlunderPistolSens' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_Load_game, Kill_Confirmed_Widget_0) == 0x000020, "Member 'KeybindMenu_C_Load_game::Kill_Confirmed_Widget_0' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_Load_game, Lumin_0) == 0x000021, "Member 'KeybindMenu_C_Load_game::Lumin_0' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_Load_game, Hitmarker_Size_0) == 0x000028, "Member 'KeybindMenu_C_Load_game::Hitmarker_Size_0' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_Load_game, Hitmarker_Type_0) == 0x000038, "Member 'KeybindMenu_C_Load_game::Hitmarker_Type_0' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_Load_game, CallFunc_LoadGameFromSlot_ReturnValue) == 0x000048, "Member 'KeybindMenu_C_Load_game::CallFunc_LoadGameFromSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_Load_game, K2Node_DynamicCast_AsSave_Options) == 0x000050, "Member 'KeybindMenu_C_Load_game::K2Node_DynamicCast_AsSave_Options' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_Load_game, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'KeybindMenu_C_Load_game::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_Load_game, CallFunc_DoesSaveGameExist_ReturnValue) == 0x000059, "Member 'KeybindMenu_C_Load_game::CallFunc_DoesSaveGameExist_ReturnValue' has a wrong offset!");

// Function KeybindMenu.KeybindMenu_C.GetText_2
// 0x0090 (0x0090 - 0x0000)
struct KeybindMenu_C_GetText_2 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0078(0x0018)()
};
static_assert(alignof(KeybindMenu_C_GetText_2) == 0x000008, "Wrong alignment on KeybindMenu_C_GetText_2");
static_assert(sizeof(KeybindMenu_C_GetText_2) == 0x000090, "Wrong size on KeybindMenu_C_GetText_2");
static_assert(offsetof(KeybindMenu_C_GetText_2, ReturnValue) == 0x000000, "Member 'KeybindMenu_C_GetText_2::ReturnValue' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_GetText_2, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'KeybindMenu_C_GetText_2::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_GetText_2, K2Node_MakeArray_Array) == 0x000068, "Member 'KeybindMenu_C_GetText_2::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_GetText_2, CallFunc_Format_ReturnValue) == 0x000078, "Member 'KeybindMenu_C_GetText_2::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function KeybindMenu.KeybindMenu_C.GetText_1
// 0x0090 (0x0090 - 0x0000)
struct KeybindMenu_C_GetText_1 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0078(0x0018)()
};
static_assert(alignof(KeybindMenu_C_GetText_1) == 0x000008, "Wrong alignment on KeybindMenu_C_GetText_1");
static_assert(sizeof(KeybindMenu_C_GetText_1) == 0x000090, "Wrong size on KeybindMenu_C_GetText_1");
static_assert(offsetof(KeybindMenu_C_GetText_1, ReturnValue) == 0x000000, "Member 'KeybindMenu_C_GetText_1::ReturnValue' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_GetText_1, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'KeybindMenu_C_GetText_1::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_GetText_1, K2Node_MakeArray_Array) == 0x000068, "Member 'KeybindMenu_C_GetText_1::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_GetText_1, CallFunc_Format_ReturnValue) == 0x000078, "Member 'KeybindMenu_C_GetText_1::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function KeybindMenu.KeybindMenu_C.GetText_0
// 0x0098 (0x0098 - 0x0000)
struct KeybindMenu_C_GetText_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	int64                                         CallFunc_Round64_ReturnValue;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0080(0x0018)()
};
static_assert(alignof(KeybindMenu_C_GetText_0) == 0x000008, "Wrong alignment on KeybindMenu_C_GetText_0");
static_assert(sizeof(KeybindMenu_C_GetText_0) == 0x000098, "Wrong size on KeybindMenu_C_GetText_0");
static_assert(offsetof(KeybindMenu_C_GetText_0, ReturnValue) == 0x000000, "Member 'KeybindMenu_C_GetText_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_GetText_0, CallFunc_Round64_ReturnValue) == 0x000018, "Member 'KeybindMenu_C_GetText_0::CallFunc_Round64_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_GetText_0, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'KeybindMenu_C_GetText_0::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_GetText_0, K2Node_MakeArray_Array) == 0x000070, "Member 'KeybindMenu_C_GetText_0::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_GetText_0, CallFunc_Format_ReturnValue) == 0x000080, "Member 'KeybindMenu_C_GetText_0::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function KeybindMenu.KeybindMenu_C.GetCheckedState_0
// 0x0001 (0x0001 - 0x0000)
struct KeybindMenu_C_GetCheckedState_0 final
{
public:
	ECheckBoxState                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KeybindMenu_C_GetCheckedState_0) == 0x000001, "Wrong alignment on KeybindMenu_C_GetCheckedState_0");
static_assert(sizeof(KeybindMenu_C_GetCheckedState_0) == 0x000001, "Wrong size on KeybindMenu_C_GetCheckedState_0");
static_assert(offsetof(KeybindMenu_C_GetCheckedState_0, ReturnValue) == 0x000000, "Member 'KeybindMenu_C_GetCheckedState_0::ReturnValue' has a wrong offset!");

// Function KeybindMenu.KeybindMenu_C.Get_SniperSensSlider_Value_0
// 0x0004 (0x0004 - 0x0000)
struct KeybindMenu_C_Get_SniperSensSlider_Value_0 final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KeybindMenu_C_Get_SniperSensSlider_Value_0) == 0x000004, "Wrong alignment on KeybindMenu_C_Get_SniperSensSlider_Value_0");
static_assert(sizeof(KeybindMenu_C_Get_SniperSensSlider_Value_0) == 0x000004, "Wrong size on KeybindMenu_C_Get_SniperSensSlider_Value_0");
static_assert(offsetof(KeybindMenu_C_Get_SniperSensSlider_Value_0, InValue) == 0x000000, "Member 'KeybindMenu_C_Get_SniperSensSlider_Value_0::InValue' has a wrong offset!");

// Function KeybindMenu.KeybindMenu_C.ExecuteUbergraph_KeybindMenu
// 0x0E48 (0x0E48 - 0x0000)
struct KeybindMenu_C_ExecuteUbergraph_KeybindMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputChord                            K2Node_MakeStruct_InputChord;                      // 0x0010(0x0020)(HasGetValueTypeHash)
	struct FInputChord                            K2Node_ComponentBoundEvent_SelectedKey_9;          // 0x0030(0x0020)(HasGetValueTypeHash)
	struct FInputActionKeyMapping                 K2Node_MakeStruct_InputActionKeyMapping;           // 0x0050(0x0028)()
	struct FInputActionKeyMapping                 K2Node_MakeStruct_InputActionKeyMapping_1;         // 0x0078(0x0028)()
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_1;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_2;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputChord                            K2Node_MakeStruct_InputChord_1;                    // 0x00B0(0x0020)(HasGetValueTypeHash)
	TArray<struct FInputActionKeyMapping>         CallFunc_GetActionMappingByName_OutMappings;       // 0x00D0(0x0010)(ReferenceParm)
	struct FInputActionKeyMapping                 CallFunc_Array_Get_Item;                           // 0x00E0(0x0028)()
	struct FInputChord                            K2Node_ComponentBoundEvent_SelectedKey_8;          // 0x0108(0x0020)(HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_3;           // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionKeyMapping                 K2Node_MakeStruct_InputActionKeyMapping_2;         // 0x0130(0x0028)()
	struct FInputActionKeyMapping                 K2Node_MakeStruct_InputActionKeyMapping_3;         // 0x0158(0x0028)()
	struct FInputChord                            K2Node_ComponentBoundEvent_SelectedKey_7;          // 0x0180(0x0020)(HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_4;           // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionKeyMapping                 K2Node_MakeStruct_InputActionKeyMapping_4;         // 0x01A8(0x0028)()
	struct FInputActionKeyMapping                 K2Node_MakeStruct_InputActionKeyMapping_5;         // 0x01D0(0x0028)()
	struct FInputChord                            K2Node_MakeStruct_InputChord_2;                    // 0x01F8(0x0020)(HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_5;           // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputActionKeyMapping>         CallFunc_GetActionMappingByName_OutMappings_1;     // 0x0220(0x0010)(ReferenceParm)
	struct FInputActionKeyMapping                 CallFunc_Array_Get_Item_1;                         // 0x0230(0x0028)()
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_6;           // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputActionKeyMapping>         CallFunc_GetActionMappingByName_OutMappings_2;     // 0x0260(0x0010)(ReferenceParm)
	struct FInputActionKeyMapping                 CallFunc_Array_Get_Item_2;                         // 0x0270(0x0028)()
	struct FInputChord                            K2Node_MakeStruct_InputChord_3;                    // 0x0298(0x0020)(HasGetValueTypeHash)
	struct FInputChord                            K2Node_ComponentBoundEvent_SelectedKey_6;          // 0x02B8(0x0020)(HasGetValueTypeHash)
	struct FInputActionKeyMapping                 K2Node_MakeStruct_InputActionKeyMapping_6;         // 0x02D8(0x0028)()
	struct FInputActionKeyMapping                 K2Node_MakeStruct_InputActionKeyMapping_7;         // 0x0300(0x0028)()
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_7;           // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputChord                            K2Node_ComponentBoundEvent_SelectedKey_5;          // 0x0330(0x0020)(HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_8;           // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionKeyMapping                 K2Node_MakeStruct_InputActionKeyMapping_8;         // 0x0358(0x0028)()
	struct FInputActionKeyMapping                 K2Node_MakeStruct_InputActionKeyMapping_9;         // 0x0380(0x0028)()
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_9;           // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputActionKeyMapping>         CallFunc_GetActionMappingByName_OutMappings_3;     // 0x03B0(0x0010)(ReferenceParm)
	struct FInputActionKeyMapping                 CallFunc_Array_Get_Item_3;                         // 0x03C0(0x0028)()
	struct FInputChord                            K2Node_MakeStruct_InputChord_4;                    // 0x03E8(0x0020)(HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_10;          // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputActionKeyMapping>         CallFunc_GetActionMappingByName_OutMappings_4;     // 0x0410(0x0010)(ReferenceParm)
	struct FInputActionKeyMapping                 CallFunc_Array_Get_Item_4;                         // 0x0420(0x0028)()
	struct FInputChord                            K2Node_MakeStruct_InputChord_5;                    // 0x0448(0x0020)(HasGetValueTypeHash)
	struct FInputChord                            K2Node_ComponentBoundEvent_SelectedKey_4;          // 0x0468(0x0020)(HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_11;          // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionKeyMapping                 K2Node_MakeStruct_InputActionKeyMapping_10;        // 0x0490(0x0028)()
	struct FInputActionKeyMapping                 K2Node_MakeStruct_InputActionKeyMapping_11;        // 0x04B8(0x0028)()
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_12;          // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputAxisKeyMapping>           CallFunc_GetAxisMappingByName_OutMappings;         // 0x04E8(0x0010)(ReferenceParm)
	struct FInputAxisKeyMapping                   CallFunc_Array_Get_Item_5;                         // 0x04F8(0x0028)()
	struct FInputChord                            K2Node_MakeStruct_InputChord_6;                    // 0x0520(0x0020)(HasGetValueTypeHash)
	struct FInputChord                            K2Node_ComponentBoundEvent_SelectedKey_3;          // 0x0540(0x0020)(HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_13;          // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputAxisKeyMapping                   K2Node_MakeStruct_InputAxisKeyMapping;             // 0x0568(0x0028)()
	struct FInputAxisKeyMapping                   K2Node_MakeStruct_InputAxisKeyMapping_1;           // 0x0590(0x0028)()
	struct FInputChord                            K2Node_ComponentBoundEvent_SelectedKey_2;          // 0x05B8(0x0020)(HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_14;          // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputAxisKeyMapping                   K2Node_MakeStruct_InputAxisKeyMapping_2;           // 0x05E0(0x0028)()
	struct FInputAxisKeyMapping                   K2Node_MakeStruct_InputAxisKeyMapping_3;           // 0x0608(0x0028)()
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_15;          // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_16;          // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputActionKeyMapping>         CallFunc_GetActionMappingByName_OutMappings_5;     // 0x0640(0x0010)(ReferenceParm)
	TArray<struct FInputAxisKeyMapping>           CallFunc_GetAxisMappingByName_OutMappings_1;       // 0x0650(0x0010)(ReferenceParm)
	struct FInputActionKeyMapping                 CallFunc_Array_Get_Item_6;                         // 0x0660(0x0028)()
	struct FInputAxisKeyMapping                   CallFunc_Array_Get_Item_7;                         // 0x0688(0x0028)()
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_17;          // 0x06B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputAxisKeyMapping>           CallFunc_GetAxisMappingByName_OutMappings_2;       // 0x06B8(0x0010)(ReferenceParm)
	struct FInputChord                            K2Node_MakeStruct_InputChord_7;                    // 0x06C8(0x0020)(HasGetValueTypeHash)
	struct FInputAxisKeyMapping                   CallFunc_Array_Get_Item_8;                         // 0x06E8(0x0028)()
	struct FInputChord                            K2Node_ComponentBoundEvent_SelectedKey_1;          // 0x0710(0x0020)(HasGetValueTypeHash)
	struct FInputChord                            K2Node_MakeStruct_InputChord_8;                    // 0x0730(0x0020)(HasGetValueTypeHash)
	struct FInputAxisKeyMapping                   K2Node_MakeStruct_InputAxisKeyMapping_4;           // 0x0750(0x0028)()
	struct FInputAxisKeyMapping                   K2Node_MakeStruct_InputAxisKeyMapping_5;           // 0x0778(0x0028)()
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_18;          // 0x07A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputChord                            K2Node_ComponentBoundEvent_SelectedKey;            // 0x07A8(0x0020)(HasGetValueTypeHash)
	struct FInputAxisKeyMapping                   K2Node_MakeStruct_InputAxisKeyMapping_6;           // 0x07C8(0x0028)()
	struct FInputAxisKeyMapping                   K2Node_MakeStruct_InputAxisKeyMapping_7;           // 0x07F0(0x0028)()
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_19;          // 0x0818(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_20;          // 0x0820(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputAxisKeyMapping>           CallFunc_GetAxisMappingByName_OutMappings_3;       // 0x0828(0x0010)(ReferenceParm)
	struct FInputAxisKeyMapping                   CallFunc_Array_Get_Item_9;                         // 0x0838(0x0028)()
	struct FInputChord                            K2Node_MakeStruct_InputChord_9;                    // 0x0860(0x0020)(HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_21;          // 0x0880(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputChord                            K2Node_MakeStruct_InputChord_10;                   // 0x0888(0x0020)(HasGetValueTypeHash)
	TArray<struct FInputActionKeyMapping>         CallFunc_GetActionMappingByName_OutMappings_6;     // 0x08A8(0x0010)(ReferenceParm)
	struct FInputActionKeyMapping                 CallFunc_Array_Get_Item_10;                        // 0x08B8(0x0028)()
	struct FInputActionKeyMapping                 K2Node_MakeStruct_InputActionKeyMapping_12;        // 0x08E0(0x0028)()
	struct FInputActionKeyMapping                 K2Node_MakeStruct_InputActionKeyMapping_13;        // 0x0908(0x0028)()
	struct FInputChord                            K2Node_MakeStruct_InputChord_11;                   // 0x0930(0x0020)(HasGetValueTypeHash)
	struct FInputActionKeyMapping                 K2Node_MakeStruct_InputActionKeyMapping_14;        // 0x0950(0x0028)()
	struct FInputActionKeyMapping                 K2Node_MakeStruct_InputActionKeyMapping_15;        // 0x0978(0x0028)()
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_22;          // 0x09A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputActionKeyMapping>         CallFunc_GetActionMappingByName_OutMappings_7;     // 0x09A8(0x0010)(ReferenceParm)
	struct FInputChord                            K2Node_MakeStruct_InputChord_12;                   // 0x09B8(0x0020)(HasGetValueTypeHash)
	struct FInputActionKeyMapping                 CallFunc_Array_Get_Item_11;                        // 0x09D8(0x0028)()
	struct FInputActionKeyMapping                 K2Node_MakeStruct_InputActionKeyMapping_16;        // 0x0A00(0x0028)()
	struct FInputActionKeyMapping                 K2Node_MakeStruct_InputActionKeyMapping_17;        // 0x0A28(0x0028)()
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_23;          // 0x0A50(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputChord                            K2Node_MakeStruct_InputChord_13;                   // 0x0A58(0x0020)(HasGetValueTypeHash)
	TArray<struct FInputActionKeyMapping>         CallFunc_GetActionMappingByName_OutMappings_8;     // 0x0A78(0x0010)(ReferenceParm)
	struct FInputActionKeyMapping                 CallFunc_Array_Get_Item_12;                        // 0x0A88(0x0028)()
	struct FInputActionKeyMapping                 K2Node_MakeStruct_InputActionKeyMapping_18;        // 0x0AB0(0x0028)()
	struct FInputActionKeyMapping                 K2Node_MakeStruct_InputActionKeyMapping_19;        // 0x0AD8(0x0028)()
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_24;          // 0x0B00(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputChord                            K2Node_MakeStruct_InputChord_14;                   // 0x0B08(0x0020)(HasGetValueTypeHash)
	TArray<struct FInputActionKeyMapping>         CallFunc_GetActionMappingByName_OutMappings_9;     // 0x0B28(0x0010)(ReferenceParm)
	struct FInputActionKeyMapping                 CallFunc_Array_Get_Item_13;                        // 0x0B38(0x0028)()
	struct FInputActionKeyMapping                 K2Node_MakeStruct_InputActionKeyMapping_20;        // 0x0B60(0x0028)()
	struct FInputActionKeyMapping                 K2Node_MakeStruct_InputActionKeyMapping_21;        // 0x0B88(0x0028)()
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_25;          // 0x0BB0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_26;          // 0x0BB8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputActionKeyMapping>         CallFunc_GetActionMappingByName_OutMappings_10;    // 0x0BC0(0x0010)(ReferenceParm)
	TArray<struct FInputActionKeyMapping>         CallFunc_GetActionMappingByName_OutMappings_11;    // 0x0BD0(0x0010)(ReferenceParm)
	struct FInputActionKeyMapping                 CallFunc_Array_Get_Item_14;                        // 0x0BE0(0x0028)()
	struct FInputActionKeyMapping                 CallFunc_Array_Get_Item_15;                        // 0x0C08(0x0028)()
	struct FInputChord                            K2Node_MakeStruct_InputChord_15;                   // 0x0C30(0x0020)(HasGetValueTypeHash)
	struct FInputActionKeyMapping                 K2Node_MakeStruct_InputActionKeyMapping_22;        // 0x0C50(0x0028)()
	struct FInputActionKeyMapping                 K2Node_MakeStruct_InputActionKeyMapping_23;        // 0x0C78(0x0028)()
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_27;          // 0x0CA0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputChord                            K2Node_MakeStruct_InputChord_16;                   // 0x0CA8(0x0020)(HasGetValueTypeHash)
	TArray<struct FInputAxisKeyMapping>           CallFunc_GetAxisMappingByName_OutMappings_4;       // 0x0CC8(0x0010)(ReferenceParm)
	struct FInputAxisKeyMapping                   CallFunc_Array_Get_Item_16;                        // 0x0CD8(0x0028)()
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_28;          // 0x0D00(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputChord                            K2Node_MakeStruct_InputChord_17;                   // 0x0D08(0x0020)(HasGetValueTypeHash)
	TArray<struct FInputAxisKeyMapping>           CallFunc_GetAxisMappingByName_OutMappings_5;       // 0x0D28(0x0010)(ReferenceParm)
	struct FInputAxisKeyMapping                   CallFunc_Array_Get_Item_17;                        // 0x0D38(0x0028)()
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_29;          // 0x0D60(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputChord                            K2Node_MakeStruct_InputChord_18;                   // 0x0D68(0x0020)(HasGetValueTypeHash)
	TArray<struct FInputAxisKeyMapping>           CallFunc_GetAxisMappingByName_OutMappings_6;       // 0x0D88(0x0010)(ReferenceParm)
	struct FInputAxisKeyMapping                   CallFunc_Array_Get_Item_18;                        // 0x0D98(0x0028)()
	struct FInputChord                            K2Node_MakeStruct_InputChord_19;                   // 0x0DC0(0x0020)(HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_30;          // 0x0DE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputAxisKeyMapping>           CallFunc_GetAxisMappingByName_OutMappings_7;       // 0x0DE8(0x0010)(ReferenceParm)
	struct FInputAxisKeyMapping                   CallFunc_Array_Get_Item_19;                        // 0x0DF8(0x0028)()
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_31;          // 0x0E20(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_32;          // 0x0E28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_33;          // 0x0E30(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_34;          // 0x0E38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_35;          // 0x0E40(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KeybindMenu_C_ExecuteUbergraph_KeybindMenu) == 0x000008, "Wrong alignment on KeybindMenu_C_ExecuteUbergraph_KeybindMenu");
static_assert(sizeof(KeybindMenu_C_ExecuteUbergraph_KeybindMenu) == 0x000E48, "Wrong size on KeybindMenu_C_ExecuteUbergraph_KeybindMenu");
static_assert(offsetof(KeybindMenu_C_ExecuteUbergraph_KeybindMenu, EntryPoint) == 0x000000, "Member 'KeybindMenu_C_ExecuteUbergraph_KeybindMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_ExecuteUbergraph_KeybindMenu, CallFunc_GetInputSettings_ReturnValue) == 0x000008, "Member 'KeybindMenu_C_ExecuteUbergraph_KeybindMenu::CallFunc_GetInputSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_ExecuteUbergraph_KeybindMenu, K2Node_MakeStruct_InputChord) == 0x000010, "Member 'KeybindMenu_C_ExecuteUbergraph_KeybindMenu::K2Node_MakeStruct_InputChord' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_ExecuteUbergraph_KeybindMenu, K2Node_ComponentBoundEvent_SelectedKey_9) == 0x000030, "Member 'KeybindMenu_C_ExecuteUbergraph_KeybindMenu::K2Node_ComponentBoundEvent_SelectedKey_9' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_ExecuteUbergraph_KeybindMenu, K2Node_MakeStruct_InputActionKeyMapping) == 0x000050, "Member 'KeybindMenu_C_ExecuteUbergraph_KeybindMenu::K2Node_MakeStruct_InputActionKeyMapping' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_ExecuteUbergraph_KeybindMenu, K2Node_MakeStruct_InputActionKeyMapping_1) == 0x000078, "Member 'KeybindMenu_C_ExecuteUbergraph_KeybindMenu::K2Node_MakeStruct_InputActionKeyMapping_1' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_ExecuteUbergraph_KeybindMenu, CallFunc_GetInputSettings_ReturnValue_1) == 0x0000A0, "Member 'KeybindMenu_C_ExecuteUbergraph_KeybindMenu::CallFunc_GetInputSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_ExecuteUbergraph_KeybindMenu, CallFunc_GetInputSettings_ReturnValue_2) == 0x0000A8, "Member 'KeybindMenu_C_ExecuteUbergraph_KeybindMenu::CallFunc_GetInputSettings_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_ExecuteUbergraph_KeybindMenu, K2Node_MakeStruct_InputChord_1) == 0x0000B0, "Member 'KeybindMenu_C_ExecuteUbergraph_KeybindMenu::K2Node_MakeStruct_InputChord_1' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_ExecuteUbergraph_KeybindMenu, CallFunc_GetActionMappingByName_OutMappings) == 0x0000D0, "Member 'KeybindMenu_C_ExecuteUbergraph_KeybindMenu::CallFunc_GetActionMappingByName_OutMappings' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_ExecuteUbergraph_KeybindMenu, CallFunc_Array_Get_Item) == 0x0000E0, "Member 'KeybindMenu_C_ExecuteUbergraph_KeybindMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_ExecuteUbergraph_KeybindMenu, K2Node_ComponentBoundEvent_SelectedKey_8) == 0x000108, "Member 'KeybindMenu_C_ExecuteUbergraph_KeybindMenu::K2Node_ComponentBoundEvent_SelectedKey_8' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_ExecuteUbergraph_KeybindMenu, CallFunc_GetInputSettings_ReturnValue_3) == 0x000128, "Member 'KeybindMenu_C_ExecuteUbergraph_KeybindMenu::CallFunc_GetInputSettings_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_ExecuteUbergraph_KeybindMenu, K2Node_MakeStruct_InputActionKeyMapping_2) == 0x000130, "Member 'KeybindMenu_C_ExecuteUbergraph_KeybindMenu::K2Node_MakeStruct_InputActionKeyMapping_2' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_ExecuteUbergraph_KeybindMenu, K2Node_MakeStruct_InputActionKeyMapping_3) == 0x000158, "Member 'KeybindMenu_C_ExecuteUbergraph_KeybindMenu::K2Node_MakeStruct_InputActionKeyMapping_3' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_ExecuteUbergraph_KeybindMenu, K2Node_ComponentBoundEvent_SelectedKey_7) == 0x000180, "Member 'KeybindMenu_C_ExecuteUbergraph_KeybindMenu::K2Node_ComponentBoundEvent_SelectedKey_7' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_ExecuteUbergraph_KeybindMenu, CallFunc_GetInputSettings_ReturnValue_4) == 0x0001A0, "Member 'KeybindMenu_C_ExecuteUbergraph_KeybindMenu::CallFunc_GetInputSettings_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_ExecuteUbergraph_KeybindMenu, K2Node_MakeStruct_InputActionKeyMapping_4) == 0x0001A8, "Member 'KeybindMenu_C_ExecuteUbergraph_KeybindMenu::K2Node_MakeStruct_InputActionKeyMapping_4' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_ExecuteUbergraph_KeybindMenu, K2Node_MakeStruct_InputActionKeyMapping_5) == 0x0001D0, "Member 'KeybindMenu_C_ExecuteUbergraph_KeybindMenu::K2Node_MakeStruct_InputActionKeyMapping_5' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_ExecuteUbergraph_KeybindMenu, K2Node_MakeStruct_InputChord_2) == 0x0001F8, "Member 'KeybindMenu_C_ExecuteUbergraph_KeybindMenu::K2Node_MakeStruct_InputChord_2' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_ExecuteUbergraph_KeybindMenu, CallFunc_GetInputSettings_ReturnValue_5) == 0x000218, "Member 'KeybindMenu_C_ExecuteUbergraph_KeybindMenu::CallFunc_GetInputSettings_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_ExecuteUbergraph_KeybindMenu, CallFunc_GetActionMappingByName_OutMappings_1) == 0x000220, "Member 'KeybindMenu_C_ExecuteUbergraph_KeybindMenu::CallFunc_GetActionMappingByName_OutMappings_1' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_ExecuteUbergraph_KeybindMenu, CallFunc_Array_Get_Item_1) == 0x000230, "Member 'KeybindMenu_C_ExecuteUbergraph_KeybindMenu::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_ExecuteUbergraph_KeybindMenu, CallFunc_GetInputSettings_ReturnValue_6) == 0x000258, "Member 'KeybindMenu_C_ExecuteUbergraph_KeybindMenu::CallFunc_GetInputSettings_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_ExecuteUbergraph_KeybindMenu, CallFunc_GetActionMappingByName_OutMappings_2) == 0x000260, "Member 'KeybindMenu_C_ExecuteUbergraph_KeybindMenu::CallFunc_GetActionMappingByName_OutMappings_2' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_ExecuteUbergraph_KeybindMenu, CallFunc_Array_Get_Item_2) == 0x000270, "Member 'KeybindMenu_C_ExecuteUbergraph_KeybindMenu::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_ExecuteUbergraph_KeybindMenu, K2Node_MakeStruct_InputChord_3) == 0x000298, "Member 'KeybindMenu_C_ExecuteUbergraph_KeybindMenu::K2Node_MakeStruct_InputChord_3' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_ExecuteUbergraph_KeybindMenu, K2Node_ComponentBoundEvent_SelectedKey_6) == 0x0002B8, "Member 'KeybindMenu_C_ExecuteUbergraph_KeybindMenu::K2Node_ComponentBoundEvent_SelectedKey_6' has a wrong offset!");
static_assert(offsetof(KeybindMenu_C_ExecuteUbergraph_KeybindMenu, K2Node_MakeStruct_InputActionKeyMapping_6) == 0x0002D8, "Member 'KeybindMenu_C_ExecuteUbergraph_KeybindMenu::K2Node_MakeStruct_InputActionKeyMapping_6' has a wrong offset!");
