#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KickMenu

#include "Basic.hpp"


namespace SDK::Params
{

// Function KickMenu.KickMenu_C.ExecuteUbergraph_KickMenu
// 0x0090 (0x0090 - 0x0000)
struct KickMenu_C_ExecuteUbergraph_KickMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerControllerBP_C*                  K2Node_DynamicCast_AsPlayer_Controller_BP;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UKick_spot_C*                           CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerControllerBP_C*                  K2Node_DynamicCast_AsPlayer_Controller_BP_1;       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KickMenu_C_ExecuteUbergraph_KickMenu) == 0x000008, "Wrong alignment on KickMenu_C_ExecuteUbergraph_KickMenu");
static_assert(sizeof(KickMenu_C_ExecuteUbergraph_KickMenu) == 0x000090, "Wrong size on KickMenu_C_ExecuteUbergraph_KickMenu");
static_assert(offsetof(KickMenu_C_ExecuteUbergraph_KickMenu, EntryPoint) == 0x000000, "Member 'KickMenu_C_ExecuteUbergraph_KickMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(KickMenu_C_ExecuteUbergraph_KickMenu, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'KickMenu_C_ExecuteUbergraph_KickMenu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(KickMenu_C_ExecuteUbergraph_KickMenu, K2Node_DynamicCast_AsPlayer_Controller_BP) == 0x000010, "Member 'KickMenu_C_ExecuteUbergraph_KickMenu::K2Node_DynamicCast_AsPlayer_Controller_BP' has a wrong offset!");
static_assert(offsetof(KickMenu_C_ExecuteUbergraph_KickMenu, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'KickMenu_C_ExecuteUbergraph_KickMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(KickMenu_C_ExecuteUbergraph_KickMenu, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'KickMenu_C_ExecuteUbergraph_KickMenu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(KickMenu_C_ExecuteUbergraph_KickMenu, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'KickMenu_C_ExecuteUbergraph_KickMenu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(KickMenu_C_ExecuteUbergraph_KickMenu, CallFunc_Create_ReturnValue) == 0x000028, "Member 'KickMenu_C_ExecuteUbergraph_KickMenu::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(KickMenu_C_ExecuteUbergraph_KickMenu, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'KickMenu_C_ExecuteUbergraph_KickMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KickMenu_C_ExecuteUbergraph_KickMenu, CallFunc_GetGameState_ReturnValue) == 0x000038, "Member 'KickMenu_C_ExecuteUbergraph_KickMenu::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(KickMenu_C_ExecuteUbergraph_KickMenu, CallFunc_AddChild_ReturnValue) == 0x000040, "Member 'KickMenu_C_ExecuteUbergraph_KickMenu::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(KickMenu_C_ExecuteUbergraph_KickMenu, CallFunc_Array_Get_Item) == 0x000048, "Member 'KickMenu_C_ExecuteUbergraph_KickMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(KickMenu_C_ExecuteUbergraph_KickMenu, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'KickMenu_C_ExecuteUbergraph_KickMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(KickMenu_C_ExecuteUbergraph_KickMenu, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'KickMenu_C_ExecuteUbergraph_KickMenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KickMenu_C_ExecuteUbergraph_KickMenu, CallFunc_GetPlayerName_ReturnValue) == 0x000058, "Member 'KickMenu_C_ExecuteUbergraph_KickMenu::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(KickMenu_C_ExecuteUbergraph_KickMenu, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000068, "Member 'KickMenu_C_ExecuteUbergraph_KickMenu::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(KickMenu_C_ExecuteUbergraph_KickMenu, CallFunc_Conv_StringToName_ReturnValue) == 0x00006C, "Member 'KickMenu_C_ExecuteUbergraph_KickMenu::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(KickMenu_C_ExecuteUbergraph_KickMenu, CallFunc_GetPlayerController_ReturnValue_1) == 0x000078, "Member 'KickMenu_C_ExecuteUbergraph_KickMenu::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KickMenu_C_ExecuteUbergraph_KickMenu, K2Node_DynamicCast_AsPlayer_Controller_BP_1) == 0x000080, "Member 'KickMenu_C_ExecuteUbergraph_KickMenu::K2Node_DynamicCast_AsPlayer_Controller_BP_1' has a wrong offset!");
static_assert(offsetof(KickMenu_C_ExecuteUbergraph_KickMenu, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'KickMenu_C_ExecuteUbergraph_KickMenu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

