#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KickWidget_Initiate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass KickWidget_Initiate.KickWidget_Initiate_C
// 0x0070 (0x0300 - 0x0290)
class UKickWidget_Initiate_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                CancelVoteButton;                                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Confirm_Button;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboBoxString*                        ReasonComboBox;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_0;                                       // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Kick_;                                             // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Player_name;                                       // 0x02D0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   Text;                                              // 0x02E8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_KickWidget_Initiate(int32 EntryPoint);
	void Construct();
	void BndEvt__KickWidget_Initiate_ReasonComboBox_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void BndEvt__KickWidget_Initiate_Button_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__KickWidget_Initiate_Button_0_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"KickWidget_Initiate_C">();
	}
	static class UKickWidget_Initiate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKickWidget_Initiate_C>();
	}
};
static_assert(alignof(UKickWidget_Initiate_C) == 0x000008, "Wrong alignment on UKickWidget_Initiate_C");
static_assert(sizeof(UKickWidget_Initiate_C) == 0x000300, "Wrong size on UKickWidget_Initiate_C");
static_assert(offsetof(UKickWidget_Initiate_C, UberGraphFrame) == 0x000290, "Member 'UKickWidget_Initiate_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UKickWidget_Initiate_C, CancelVoteButton) == 0x000298, "Member 'UKickWidget_Initiate_C::CancelVoteButton' has a wrong offset!");
static_assert(offsetof(UKickWidget_Initiate_C, Confirm_Button) == 0x0002A0, "Member 'UKickWidget_Initiate_C::Confirm_Button' has a wrong offset!");
static_assert(offsetof(UKickWidget_Initiate_C, Image_0) == 0x0002A8, "Member 'UKickWidget_Initiate_C::Image_0' has a wrong offset!");
static_assert(offsetof(UKickWidget_Initiate_C, Image_1) == 0x0002B0, "Member 'UKickWidget_Initiate_C::Image_1' has a wrong offset!");
static_assert(offsetof(UKickWidget_Initiate_C, ReasonComboBox) == 0x0002B8, "Member 'UKickWidget_Initiate_C::ReasonComboBox' has a wrong offset!");
static_assert(offsetof(UKickWidget_Initiate_C, TextBlock_0) == 0x0002C0, "Member 'UKickWidget_Initiate_C::TextBlock_0' has a wrong offset!");
static_assert(offsetof(UKickWidget_Initiate_C, Kick_) == 0x0002C8, "Member 'UKickWidget_Initiate_C::Kick_' has a wrong offset!");
static_assert(offsetof(UKickWidget_Initiate_C, Player_name) == 0x0002D0, "Member 'UKickWidget_Initiate_C::Player_name' has a wrong offset!");
static_assert(offsetof(UKickWidget_Initiate_C, Text) == 0x0002E8, "Member 'UKickWidget_Initiate_C::Text' has a wrong offset!");

}

