#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Kick_spot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "AdvancedSessions_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Kick_spot.Kick_spot_C
// 0x0040 (0x02D0 - 0x0290)
class UKick_spot_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                BanBTN;                                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                KickBtn;                                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_0;                                       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   Name_0;                                            // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class APlayerState*                           Player;                                            // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsOwner_;                                          // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Team;                                              // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Authority;                                         // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	class FText Player_name();
	class FText Ping();
	class FText Kills();
	class FText KD();
	ESlateVisibility GetVisibility_0();
	struct FSlateColor GetColorAndOpacity_0();
	struct FSlateBrush GetBrush_0();
	void ExecuteUbergraph_Kick_spot(int32 EntryPoint);
	class FText Deaths();
	void Construct();
	void BndEvt__Kick_spot_KickBtn_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Kick_spot_BanBTN_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Kick_spot_C">();
	}
	static class UKick_spot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKick_spot_C>();
	}
};
static_assert(alignof(UKick_spot_C) == 0x000008, "Wrong alignment on UKick_spot_C");
static_assert(sizeof(UKick_spot_C) == 0x0002D0, "Wrong size on UKick_spot_C");
static_assert(offsetof(UKick_spot_C, UberGraphFrame) == 0x000290, "Member 'UKick_spot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UKick_spot_C, BanBTN) == 0x000298, "Member 'UKick_spot_C::BanBTN' has a wrong offset!");
static_assert(offsetof(UKick_spot_C, KickBtn) == 0x0002A0, "Member 'UKick_spot_C::KickBtn' has a wrong offset!");
static_assert(offsetof(UKick_spot_C, TextBlock_0) == 0x0002A8, "Member 'UKick_spot_C::TextBlock_0' has a wrong offset!");
static_assert(offsetof(UKick_spot_C, Name_0) == 0x0002B0, "Member 'UKick_spot_C::Name_0' has a wrong offset!");
static_assert(offsetof(UKick_spot_C, Player) == 0x0002B8, "Member 'UKick_spot_C::Player' has a wrong offset!");
static_assert(offsetof(UKick_spot_C, IsOwner_) == 0x0002C0, "Member 'UKick_spot_C::IsOwner_' has a wrong offset!");
static_assert(offsetof(UKick_spot_C, Team) == 0x0002C4, "Member 'UKick_spot_C::Team' has a wrong offset!");
static_assert(offsetof(UKick_spot_C, Authority) == 0x0002C8, "Member 'UKick_spot_C::Authority' has a wrong offset!");

}

