#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KickWidget_Initiate

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function KickWidget_Initiate.KickWidget_Initiate_C.ExecuteUbergraph_KickWidget_Initiate
// 0x00E8 (0x00E8 - 0x0000)
struct KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerBP_C*                  K2Node_DynamicCast_AsPlayer_Controller_BP;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default;                             // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0078(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerControllerBP_C*                  K2Node_DynamicCast_AsPlayer_Controller_BP_1;       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem;           // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType;          // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00D0(0x0018)()
};
static_assert(alignof(KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate) == 0x000008, "Wrong alignment on KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate");
static_assert(sizeof(KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate) == 0x0000E8, "Wrong size on KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate");
static_assert(offsetof(KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate, EntryPoint) == 0x000000, "Member 'KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate::EntryPoint' has a wrong offset!");
static_assert(offsetof(KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate, Temp_bool_Variable) == 0x000010, "Member 'KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate, K2Node_DynamicCast_AsPlayer_Controller_BP) == 0x000018, "Member 'KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate::K2Node_DynamicCast_AsPlayer_Controller_BP' has a wrong offset!");
static_assert(offsetof(KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate, Temp_string_Variable) == 0x000028, "Member 'KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate, Temp_string_Variable_1) == 0x000038, "Member 'KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate, CallFunc_Conv_TextToString_ReturnValue) == 0x000048, "Member 'KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate, K2Node_Select_Default) == 0x000058, "Member 'KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate, CallFunc_Concat_StrStr_ReturnValue) == 0x000068, "Member 'KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate, CallFunc_Conv_StringToText_ReturnValue) == 0x000078, "Member 'KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000090, "Member 'KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate, CallFunc_GetPlayerController_ReturnValue_1) == 0x0000A0, "Member 'KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate, K2Node_DynamicCast_AsPlayer_Controller_BP_1) == 0x0000A8, "Member 'KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate::K2Node_DynamicCast_AsPlayer_Controller_BP_1' has a wrong offset!");
static_assert(offsetof(KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate, K2Node_DynamicCast_bSuccess_1) == 0x0000B0, "Member 'KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate, K2Node_ComponentBoundEvent_SelectedItem) == 0x0000B8, "Member 'KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate::K2Node_ComponentBoundEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate, K2Node_ComponentBoundEvent_SelectionType) == 0x0000C8, "Member 'KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate::K2Node_ComponentBoundEvent_SelectionType' has a wrong offset!");
static_assert(offsetof(KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000D0, "Member 'KickWidget_Initiate_C_ExecuteUbergraph_KickWidget_Initiate::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");

// Function KickWidget_Initiate.KickWidget_Initiate_C.BndEvt__KickWidget_Initiate_ReasonComboBox_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct KickWidget_Initiate_C_BndEvt__KickWidget_Initiate_ReasonComboBox_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KickWidget_Initiate_C_BndEvt__KickWidget_Initiate_ReasonComboBox_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on KickWidget_Initiate_C_BndEvt__KickWidget_Initiate_ReasonComboBox_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(KickWidget_Initiate_C_BndEvt__KickWidget_Initiate_ReasonComboBox_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on KickWidget_Initiate_C_BndEvt__KickWidget_Initiate_ReasonComboBox_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(KickWidget_Initiate_C_BndEvt__KickWidget_Initiate_ReasonComboBox_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'KickWidget_Initiate_C_BndEvt__KickWidget_Initiate_ReasonComboBox_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(KickWidget_Initiate_C_BndEvt__KickWidget_Initiate_ReasonComboBox_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'KickWidget_Initiate_C_BndEvt__KickWidget_Initiate_ReasonComboBox_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

}

