#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KickMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass KickMenu.KickMenu_C
// 0x0018 (0x02A8 - 0x0290)
class UKickMenu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_0;                                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ListofPlayers;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_KickMenu(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"KickMenu_C">();
	}
	static class UKickMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKickMenu_C>();
	}
};
static_assert(alignof(UKickMenu_C) == 0x000008, "Wrong alignment on UKickMenu_C");
static_assert(sizeof(UKickMenu_C) == 0x0002A8, "Wrong size on UKickMenu_C");
static_assert(offsetof(UKickMenu_C, UberGraphFrame) == 0x000290, "Member 'UKickMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UKickMenu_C, Image_0) == 0x000298, "Member 'UKickMenu_C::Image_0' has a wrong offset!");
static_assert(offsetof(UKickMenu_C, ListofPlayers) == 0x0002A0, "Member 'UKickMenu_C::ListofPlayers' has a wrong offset!");

}

