#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KillConfirmSmaller

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function KillConfirmSmaller.KillConfirmSmaller_C.GetText_0
// 0x0050 (0x0050 - 0x0000)
struct KillConfirmSmaller_C_GetText_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0018)()
};
static_assert(alignof(KillConfirmSmaller_C_GetText_0) == 0x000008, "Wrong alignment on KillConfirmSmaller_C_GetText_0");
static_assert(sizeof(KillConfirmSmaller_C_GetText_0) == 0x000050, "Wrong size on KillConfirmSmaller_C_GetText_0");
static_assert(offsetof(KillConfirmSmaller_C_GetText_0, ReturnValue) == 0x000000, "Member 'KillConfirmSmaller_C_GetText_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(KillConfirmSmaller_C_GetText_0, CallFunc_Conv_TextToString_ReturnValue) == 0x000018, "Member 'KillConfirmSmaller_C_GetText_0::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillConfirmSmaller_C_GetText_0, CallFunc_Concat_StrStr_ReturnValue) == 0x000028, "Member 'KillConfirmSmaller_C_GetText_0::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillConfirmSmaller_C_GetText_0, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'KillConfirmSmaller_C_GetText_0::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function KillConfirmSmaller.KillConfirmSmaller_C.GetColorAndOpacity_0
// 0x00B8 (0x00B8 - 0x0000)
struct KillConfirmSmaller_C_GetColorAndOpacity_0 final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0014)(Parm, OutParm, ReturnParm)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0014(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0028(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x003C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0050(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x0064(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_5;                    // 0x0078(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_6;                    // 0x008C(0x0014)()
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_7;                    // 0x00A4(0x0014)()
};
static_assert(alignof(KillConfirmSmaller_C_GetColorAndOpacity_0) == 0x000004, "Wrong alignment on KillConfirmSmaller_C_GetColorAndOpacity_0");
static_assert(sizeof(KillConfirmSmaller_C_GetColorAndOpacity_0) == 0x0000B8, "Wrong size on KillConfirmSmaller_C_GetColorAndOpacity_0");
static_assert(offsetof(KillConfirmSmaller_C_GetColorAndOpacity_0, ReturnValue) == 0x000000, "Member 'KillConfirmSmaller_C_GetColorAndOpacity_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(KillConfirmSmaller_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateColor) == 0x000014, "Member 'KillConfirmSmaller_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(KillConfirmSmaller_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateColor_1) == 0x000028, "Member 'KillConfirmSmaller_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(KillConfirmSmaller_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateColor_2) == 0x00003C, "Member 'KillConfirmSmaller_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(KillConfirmSmaller_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateColor_3) == 0x000050, "Member 'KillConfirmSmaller_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(KillConfirmSmaller_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateColor_4) == 0x000064, "Member 'KillConfirmSmaller_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateColor_4' has a wrong offset!");
static_assert(offsetof(KillConfirmSmaller_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateColor_5) == 0x000078, "Member 'KillConfirmSmaller_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateColor_5' has a wrong offset!");
static_assert(offsetof(KillConfirmSmaller_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateColor_6) == 0x00008C, "Member 'KillConfirmSmaller_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateColor_6' has a wrong offset!");
static_assert(offsetof(KillConfirmSmaller_C_GetColorAndOpacity_0, K2Node_SwitchInteger_CmpSuccess) == 0x0000A0, "Member 'KillConfirmSmaller_C_GetColorAndOpacity_0::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(KillConfirmSmaller_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateColor_7) == 0x0000A4, "Member 'KillConfirmSmaller_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateColor_7' has a wrong offset!");

// Function KillConfirmSmaller.KillConfirmSmaller_C.ExecuteUbergraph_KillConfirmSmaller
// 0x0070 (0x0070 - 0x0000)
struct KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue_1;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP_1;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller) == 0x000008, "Wrong alignment on KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller");
static_assert(sizeof(KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller) == 0x000070, "Wrong size on KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller");
static_assert(offsetof(KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller, EntryPoint) == 0x000000, "Member 'KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller::EntryPoint' has a wrong offset!");
static_assert(offsetof(KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller, Temp_int_Array_Index_Variable) == 0x000010, "Member 'KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller, CallFunc_PlayAnimation_ReturnValue_1) == 0x000018, "Member 'KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller, CallFunc_PlayAnimation_ReturnValue_2) == 0x000020, "Member 'KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller, CallFunc_GetPlayerState_ReturnValue) == 0x000030, "Member 'KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller, K2Node_DynamicCast_AsPlayer_State_BP) == 0x000038, "Member 'KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller::K2Node_DynamicCast_AsPlayer_State_BP' has a wrong offset!");
static_assert(offsetof(KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller, CallFunc_GetPlayerState_ReturnValue_1) == 0x000048, "Member 'KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller::CallFunc_GetPlayerState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller, K2Node_DynamicCast_AsPlayer_State_BP_1) == 0x000050, "Member 'KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller::K2Node_DynamicCast_AsPlayer_State_BP_1' has a wrong offset!");
static_assert(offsetof(KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller, CallFunc_Array_RemoveItem_ReturnValue) == 0x000059, "Member 'KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller, CallFunc_Array_Get_Item) == 0x000060, "Member 'KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00006C, "Member 'KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller, CallFunc_Less_IntInt_ReturnValue) == 0x00006D, "Member 'KillConfirmSmaller_C_ExecuteUbergraph_KillConfirmSmaller::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

