#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KillConfirm

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass KillConfirm.KillConfirm_C
// 0x0050 (0x02E0 - 0x0290)
class UKillConfirm_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Dominating;                                        // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       fade_in;                                           // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_0;                                       // 0x02B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Killed_player;                                     // 0x02B8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	int32                                         Team;                                              // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           Victim_Player_State;                               // 0x02D8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	class FText GetText_0();
	struct FSlateColor GetColorAndOpacity_0();
	void ExecuteUbergraph_KillConfirm(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"KillConfirm_C">();
	}
	static class UKillConfirm_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKillConfirm_C>();
	}
};
static_assert(alignof(UKillConfirm_C) == 0x000008, "Wrong alignment on UKillConfirm_C");
static_assert(sizeof(UKillConfirm_C) == 0x0002E0, "Wrong size on UKillConfirm_C");
static_assert(offsetof(UKillConfirm_C, UberGraphFrame) == 0x000290, "Member 'UKillConfirm_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UKillConfirm_C, Dominating) == 0x000298, "Member 'UKillConfirm_C::Dominating' has a wrong offset!");
static_assert(offsetof(UKillConfirm_C, fade_in) == 0x0002A0, "Member 'UKillConfirm_C::fade_in' has a wrong offset!");
static_assert(offsetof(UKillConfirm_C, Image_0) == 0x0002A8, "Member 'UKillConfirm_C::Image_0' has a wrong offset!");
static_assert(offsetof(UKillConfirm_C, TextBlock_0) == 0x0002B0, "Member 'UKillConfirm_C::TextBlock_0' has a wrong offset!");
static_assert(offsetof(UKillConfirm_C, Killed_player) == 0x0002B8, "Member 'UKillConfirm_C::Killed_player' has a wrong offset!");
static_assert(offsetof(UKillConfirm_C, Team) == 0x0002D0, "Member 'UKillConfirm_C::Team' has a wrong offset!");
static_assert(offsetof(UKillConfirm_C, Victim_Player_State) == 0x0002D8, "Member 'UKillConfirm_C::Victim_Player_State' has a wrong offset!");

}

