#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KoTCScoreboardSpot

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function KoTCScoreboardSpot.KoTCScoreboardSpot_C.Player name
// 0x0030 (0x0030 - 0x0000)
struct KoTCScoreboardSpot_C_Player_name final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0018(0x0018)()
};
static_assert(alignof(KoTCScoreboardSpot_C_Player_name) == 0x000008, "Wrong alignment on KoTCScoreboardSpot_C_Player_name");
static_assert(sizeof(KoTCScoreboardSpot_C_Player_name) == 0x000030, "Wrong size on KoTCScoreboardSpot_C_Player_name");
static_assert(offsetof(KoTCScoreboardSpot_C_Player_name, ReturnValue) == 0x000000, "Member 'KoTCScoreboardSpot_C_Player_name::ReturnValue' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_Player_name, CallFunc_Conv_NameToText_ReturnValue) == 0x000018, "Member 'KoTCScoreboardSpot_C_Player_name::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");

// Function KoTCScoreboardSpot.KoTCScoreboardSpot_C.Ping
// 0x0050 (0x0050 - 0x0000)
struct KoTCScoreboardSpot_C_Ping final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPingInMilliseconds_ReturnValue;        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0030(0x0018)()
	double                                        CallFunc_Round_A_WideningCast;                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KoTCScoreboardSpot_C_Ping) == 0x000008, "Wrong alignment on KoTCScoreboardSpot_C_Ping");
static_assert(sizeof(KoTCScoreboardSpot_C_Ping) == 0x000050, "Wrong size on KoTCScoreboardSpot_C_Ping");
static_assert(offsetof(KoTCScoreboardSpot_C_Ping, ReturnValue) == 0x000000, "Member 'KoTCScoreboardSpot_C_Ping::ReturnValue' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_Ping, K2Node_DynamicCast_AsPlayer_State_BP) == 0x000018, "Member 'KoTCScoreboardSpot_C_Ping::K2Node_DynamicCast_AsPlayer_State_BP' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_Ping, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'KoTCScoreboardSpot_C_Ping::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_Ping, CallFunc_GetPingInMilliseconds_ReturnValue) == 0x000024, "Member 'KoTCScoreboardSpot_C_Ping::CallFunc_GetPingInMilliseconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_Ping, CallFunc_Round_ReturnValue) == 0x000028, "Member 'KoTCScoreboardSpot_C_Ping::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_Ping, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00002C, "Member 'KoTCScoreboardSpot_C_Ping::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_Ping, CallFunc_Conv_FloatToText_ReturnValue) == 0x000030, "Member 'KoTCScoreboardSpot_C_Ping::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_Ping, CallFunc_Round_A_WideningCast) == 0x000048, "Member 'KoTCScoreboardSpot_C_Ping::CallFunc_Round_A_WideningCast' has a wrong offset!");

// Function KoTCScoreboardSpot.KoTCScoreboardSpot_C.Kills
// 0x00E8 (0x00E8 - 0x0000)
struct KoTCScoreboardSpot_C_Kills final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0018)()
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_MakeTimespan_ReturnValue;                 // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Days;                       // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Hours;                      // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Minutes;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Seconds;                    // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Milliseconds;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00D0(0x0018)()
};
static_assert(alignof(KoTCScoreboardSpot_C_Kills) == 0x000008, "Wrong alignment on KoTCScoreboardSpot_C_Kills");
static_assert(sizeof(KoTCScoreboardSpot_C_Kills) == 0x0000E8, "Wrong size on KoTCScoreboardSpot_C_Kills");
static_assert(offsetof(KoTCScoreboardSpot_C_Kills, ReturnValue) == 0x000000, "Member 'KoTCScoreboardSpot_C_Kills::ReturnValue' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_Kills, K2Node_DynamicCast_AsPlayer_State_BP) == 0x000018, "Member 'KoTCScoreboardSpot_C_Kills::K2Node_DynamicCast_AsPlayer_State_BP' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_Kills, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'KoTCScoreboardSpot_C_Kills::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_Kills, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000028, "Member 'KoTCScoreboardSpot_C_Kills::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_Kills, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000038, "Member 'KoTCScoreboardSpot_C_Kills::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_Kills, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'KoTCScoreboardSpot_C_Kills::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_Kills, CallFunc_Conv_StringToText_ReturnValue) == 0x000050, "Member 'KoTCScoreboardSpot_C_Kills::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_Kills, CallFunc_FTrunc_ReturnValue) == 0x000068, "Member 'KoTCScoreboardSpot_C_Kills::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_Kills, CallFunc_MakeTimespan_ReturnValue) == 0x000070, "Member 'KoTCScoreboardSpot_C_Kills::CallFunc_MakeTimespan_ReturnValue' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_Kills, CallFunc_BreakTimespan_Days) == 0x000078, "Member 'KoTCScoreboardSpot_C_Kills::CallFunc_BreakTimespan_Days' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_Kills, CallFunc_BreakTimespan_Hours) == 0x00007C, "Member 'KoTCScoreboardSpot_C_Kills::CallFunc_BreakTimespan_Hours' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_Kills, CallFunc_BreakTimespan_Minutes) == 0x000080, "Member 'KoTCScoreboardSpot_C_Kills::CallFunc_BreakTimespan_Minutes' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_Kills, CallFunc_BreakTimespan_Seconds) == 0x000084, "Member 'KoTCScoreboardSpot_C_Kills::CallFunc_BreakTimespan_Seconds' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_Kills, CallFunc_BreakTimespan_Milliseconds) == 0x000088, "Member 'KoTCScoreboardSpot_C_Kills::CallFunc_BreakTimespan_Milliseconds' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_Kills, CallFunc_Conv_IntToString_ReturnValue) == 0x000090, "Member 'KoTCScoreboardSpot_C_Kills::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_Kills, CallFunc_Conv_IntToString_ReturnValue_1) == 0x0000A0, "Member 'KoTCScoreboardSpot_C_Kills::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_Kills, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000B0, "Member 'KoTCScoreboardSpot_C_Kills::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_Kills, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000C0, "Member 'KoTCScoreboardSpot_C_Kills::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_Kills, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000D0, "Member 'KoTCScoreboardSpot_C_Kills::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");

// Function KoTCScoreboardSpot.KoTCScoreboardSpot_C.KD
// 0x0078 (0x0078 - 0x0000)
struct KoTCScoreboardSpot_C_KD final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0048(0x0018)()
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0060(0x0018)()
};
static_assert(alignof(KoTCScoreboardSpot_C_KD) == 0x000008, "Wrong alignment on KoTCScoreboardSpot_C_KD");
static_assert(sizeof(KoTCScoreboardSpot_C_KD) == 0x000078, "Wrong size on KoTCScoreboardSpot_C_KD");
static_assert(offsetof(KoTCScoreboardSpot_C_KD, ReturnValue) == 0x000000, "Member 'KoTCScoreboardSpot_C_KD::ReturnValue' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_KD, K2Node_DynamicCast_AsPlayer_State_BP) == 0x000018, "Member 'KoTCScoreboardSpot_C_KD::K2Node_DynamicCast_AsPlayer_State_BP' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_KD, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'KoTCScoreboardSpot_C_KD::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_KD, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000028, "Member 'KoTCScoreboardSpot_C_KD::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_KD, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000030, "Member 'KoTCScoreboardSpot_C_KD::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_KD, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000038, "Member 'KoTCScoreboardSpot_C_KD::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_KD, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000040, "Member 'KoTCScoreboardSpot_C_KD::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_KD, CallFunc_Conv_IntToText_ReturnValue) == 0x000048, "Member 'KoTCScoreboardSpot_C_KD::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_KD, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000060, "Member 'KoTCScoreboardSpot_C_KD::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");

// Function KoTCScoreboardSpot.KoTCScoreboardSpot_C.GetVisibility_0
// 0x0020 (0x0020 - 0x0000)
struct KoTCScoreboardSpot_C_GetVisibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPawn_ReturnValue;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KoTCScoreboardSpot_C_GetVisibility_0) == 0x000008, "Wrong alignment on KoTCScoreboardSpot_C_GetVisibility_0");
static_assert(sizeof(KoTCScoreboardSpot_C_GetVisibility_0) == 0x000020, "Wrong size on KoTCScoreboardSpot_C_GetVisibility_0");
static_assert(offsetof(KoTCScoreboardSpot_C_GetVisibility_0, ReturnValue) == 0x000000, "Member 'KoTCScoreboardSpot_C_GetVisibility_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_GetVisibility_0, CallFunc_GetPawn_ReturnValue) == 0x000008, "Member 'KoTCScoreboardSpot_C_GetVisibility_0::CallFunc_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_GetVisibility_0, K2Node_DynamicCast_AsTrain_Gus_Player) == 0x000010, "Member 'KoTCScoreboardSpot_C_GetVisibility_0::K2Node_DynamicCast_AsTrain_Gus_Player' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_GetVisibility_0, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'KoTCScoreboardSpot_C_GetVisibility_0::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function KoTCScoreboardSpot.KoTCScoreboardSpot_C.GetText_0
// 0x0018 (0x0018 - 0x0000)
struct KoTCScoreboardSpot_C_GetText_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(KoTCScoreboardSpot_C_GetText_0) == 0x000008, "Wrong alignment on KoTCScoreboardSpot_C_GetText_0");
static_assert(sizeof(KoTCScoreboardSpot_C_GetText_0) == 0x000018, "Wrong size on KoTCScoreboardSpot_C_GetText_0");
static_assert(offsetof(KoTCScoreboardSpot_C_GetText_0, ReturnValue) == 0x000000, "Member 'KoTCScoreboardSpot_C_GetText_0::ReturnValue' has a wrong offset!");

// Function KoTCScoreboardSpot.KoTCScoreboardSpot_C.GetColorAndOpacity_0
// 0x0168 (0x0168 - 0x0000)
struct KoTCScoreboardSpot_C_GetColorAndOpacity_0 final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0014)(Parm, OutParm, ReturnParm)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0014(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0028(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x003C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0050(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x0064(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_5;                    // 0x0078(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_6;                    // 0x008C(0x0014)()
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP;              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFontOutlineSettings                   K2Node_MakeStruct_FontOutlineSettings;             // 0x00B0(0x0020)(NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_7;                    // 0x00D0(0x0014)()
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x00E8(0x0058)(HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_8;                    // 0x0140(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_9;                    // 0x0154(0x0014)()
};
static_assert(alignof(KoTCScoreboardSpot_C_GetColorAndOpacity_0) == 0x000008, "Wrong alignment on KoTCScoreboardSpot_C_GetColorAndOpacity_0");
static_assert(sizeof(KoTCScoreboardSpot_C_GetColorAndOpacity_0) == 0x000168, "Wrong size on KoTCScoreboardSpot_C_GetColorAndOpacity_0");
static_assert(offsetof(KoTCScoreboardSpot_C_GetColorAndOpacity_0, ReturnValue) == 0x000000, "Member 'KoTCScoreboardSpot_C_GetColorAndOpacity_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateColor) == 0x000014, "Member 'KoTCScoreboardSpot_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateColor_1) == 0x000028, "Member 'KoTCScoreboardSpot_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateColor_2) == 0x00003C, "Member 'KoTCScoreboardSpot_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateColor_3) == 0x000050, "Member 'KoTCScoreboardSpot_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateColor_4) == 0x000064, "Member 'KoTCScoreboardSpot_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateColor_4' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateColor_5) == 0x000078, "Member 'KoTCScoreboardSpot_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateColor_5' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateColor_6) == 0x00008C, "Member 'KoTCScoreboardSpot_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateColor_6' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_GetColorAndOpacity_0, K2Node_DynamicCast_AsPlayer_State_BP) == 0x0000A0, "Member 'KoTCScoreboardSpot_C_GetColorAndOpacity_0::K2Node_DynamicCast_AsPlayer_State_BP' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_GetColorAndOpacity_0, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'KoTCScoreboardSpot_C_GetColorAndOpacity_0::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_GetColorAndOpacity_0, K2Node_SwitchInteger_CmpSuccess) == 0x0000A9, "Member 'KoTCScoreboardSpot_C_GetColorAndOpacity_0::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_GetColorAndOpacity_0, K2Node_MakeStruct_FontOutlineSettings) == 0x0000B0, "Member 'KoTCScoreboardSpot_C_GetColorAndOpacity_0::K2Node_MakeStruct_FontOutlineSettings' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateColor_7) == 0x0000D0, "Member 'KoTCScoreboardSpot_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateColor_7' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateFontInfo) == 0x0000E8, "Member 'KoTCScoreboardSpot_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateColor_8) == 0x000140, "Member 'KoTCScoreboardSpot_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateColor_8' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateColor_9) == 0x000154, "Member 'KoTCScoreboardSpot_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateColor_9' has a wrong offset!");

// Function KoTCScoreboardSpot.KoTCScoreboardSpot_C.GetBrush_0
// 0x0440 (0x0440 - 0x0000)
struct KoTCScoreboardSpot_C_GetBrush_0 final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x00D0)(Parm, OutParm, ReturnParm)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x00D0(0x00D0)()
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP;              // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPingInMilliseconds_ReturnValue;        // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x01B0(0x00D0)()
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0285(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_IntInt_ReturnValue;               // 0x0286(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_IntInt_ReturnValue_1;             // 0x0287(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_288[0x8];                                      // 0x0288(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_2;                    // 0x0290(0x00D0)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_3;                    // 0x0360(0x00D0)()
	double                                        CallFunc_Round_A_WideningCast;                     // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KoTCScoreboardSpot_C_GetBrush_0) == 0x000010, "Wrong alignment on KoTCScoreboardSpot_C_GetBrush_0");
static_assert(sizeof(KoTCScoreboardSpot_C_GetBrush_0) == 0x000440, "Wrong size on KoTCScoreboardSpot_C_GetBrush_0");
static_assert(offsetof(KoTCScoreboardSpot_C_GetBrush_0, ReturnValue) == 0x000000, "Member 'KoTCScoreboardSpot_C_GetBrush_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_GetBrush_0, K2Node_MakeStruct_SlateBrush) == 0x0000D0, "Member 'KoTCScoreboardSpot_C_GetBrush_0::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_GetBrush_0, K2Node_DynamicCast_AsPlayer_State_BP) == 0x0001A0, "Member 'KoTCScoreboardSpot_C_GetBrush_0::K2Node_DynamicCast_AsPlayer_State_BP' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_GetBrush_0, K2Node_DynamicCast_bSuccess) == 0x0001A8, "Member 'KoTCScoreboardSpot_C_GetBrush_0::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_GetBrush_0, CallFunc_GetPingInMilliseconds_ReturnValue) == 0x0001AC, "Member 'KoTCScoreboardSpot_C_GetBrush_0::CallFunc_GetPingInMilliseconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_GetBrush_0, K2Node_MakeStruct_SlateBrush_1) == 0x0001B0, "Member 'KoTCScoreboardSpot_C_GetBrush_0::K2Node_MakeStruct_SlateBrush_1' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_GetBrush_0, CallFunc_Round_ReturnValue) == 0x000280, "Member 'KoTCScoreboardSpot_C_GetBrush_0::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_GetBrush_0, CallFunc_Greater_IntInt_ReturnValue) == 0x000284, "Member 'KoTCScoreboardSpot_C_GetBrush_0::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_GetBrush_0, CallFunc_Less_IntInt_ReturnValue) == 0x000285, "Member 'KoTCScoreboardSpot_C_GetBrush_0::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_GetBrush_0, CallFunc_InRange_IntInt_ReturnValue) == 0x000286, "Member 'KoTCScoreboardSpot_C_GetBrush_0::CallFunc_InRange_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_GetBrush_0, CallFunc_InRange_IntInt_ReturnValue_1) == 0x000287, "Member 'KoTCScoreboardSpot_C_GetBrush_0::CallFunc_InRange_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_GetBrush_0, K2Node_MakeStruct_SlateBrush_2) == 0x000290, "Member 'KoTCScoreboardSpot_C_GetBrush_0::K2Node_MakeStruct_SlateBrush_2' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_GetBrush_0, K2Node_MakeStruct_SlateBrush_3) == 0x000360, "Member 'KoTCScoreboardSpot_C_GetBrush_0::K2Node_MakeStruct_SlateBrush_3' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_GetBrush_0, CallFunc_Round_A_WideningCast) == 0x000430, "Member 'KoTCScoreboardSpot_C_GetBrush_0::CallFunc_Round_A_WideningCast' has a wrong offset!");

// Function KoTCScoreboardSpot.KoTCScoreboardSpot_C.Deaths
// 0x0040 (0x0040 - 0x0000)
struct KoTCScoreboardSpot_C_Deaths final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0028(0x0018)()
};
static_assert(alignof(KoTCScoreboardSpot_C_Deaths) == 0x000008, "Wrong alignment on KoTCScoreboardSpot_C_Deaths");
static_assert(sizeof(KoTCScoreboardSpot_C_Deaths) == 0x000040, "Wrong size on KoTCScoreboardSpot_C_Deaths");
static_assert(offsetof(KoTCScoreboardSpot_C_Deaths, ReturnValue) == 0x000000, "Member 'KoTCScoreboardSpot_C_Deaths::ReturnValue' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_Deaths, K2Node_DynamicCast_AsPlayer_State_BP) == 0x000018, "Member 'KoTCScoreboardSpot_C_Deaths::K2Node_DynamicCast_AsPlayer_State_BP' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_Deaths, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'KoTCScoreboardSpot_C_Deaths::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(KoTCScoreboardSpot_C_Deaths, CallFunc_Conv_IntToText_ReturnValue) == 0x000028, "Member 'KoTCScoreboardSpot_C_Deaths::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

}

