#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KoTCScoreboardSpot

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass KoTCScoreboardSpot.KoTCScoreboardSpot_C
// 0x0030 (0x02C0 - 0x0290)
class UKoTCScoreboardSpot_C final : public UUserWidget
{
public:
	class UImage*                                 Image_0;                                           // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_0;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   Name_0;                                            // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class APlayerState*                           Player;                                            // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsOwner_;                                          // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x3];                                      // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Team;                                              // 0x02BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	class FText Player_name();
	class FText Ping();
	class FText Kills();
	class FText KD();
	ESlateVisibility GetVisibility_0();
	class FText GetText_0();
	struct FSlateColor GetColorAndOpacity_0();
	struct FSlateBrush GetBrush_0();
	class FText Deaths();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"KoTCScoreboardSpot_C">();
	}
	static class UKoTCScoreboardSpot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKoTCScoreboardSpot_C>();
	}
};
static_assert(alignof(UKoTCScoreboardSpot_C) == 0x000008, "Wrong alignment on UKoTCScoreboardSpot_C");
static_assert(sizeof(UKoTCScoreboardSpot_C) == 0x0002C0, "Wrong size on UKoTCScoreboardSpot_C");
static_assert(offsetof(UKoTCScoreboardSpot_C, Image_0) == 0x000290, "Member 'UKoTCScoreboardSpot_C::Image_0' has a wrong offset!");
static_assert(offsetof(UKoTCScoreboardSpot_C, TextBlock) == 0x000298, "Member 'UKoTCScoreboardSpot_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UKoTCScoreboardSpot_C, TextBlock_0) == 0x0002A0, "Member 'UKoTCScoreboardSpot_C::TextBlock_0' has a wrong offset!");
static_assert(offsetof(UKoTCScoreboardSpot_C, Name_0) == 0x0002A8, "Member 'UKoTCScoreboardSpot_C::Name_0' has a wrong offset!");
static_assert(offsetof(UKoTCScoreboardSpot_C, Player) == 0x0002B0, "Member 'UKoTCScoreboardSpot_C::Player' has a wrong offset!");
static_assert(offsetof(UKoTCScoreboardSpot_C, IsOwner_) == 0x0002B8, "Member 'UKoTCScoreboardSpot_C::IsOwner_' has a wrong offset!");
static_assert(offsetof(UKoTCScoreboardSpot_C, Team) == 0x0002BC, "Member 'UKoTCScoreboardSpot_C::Team' has a wrong offset!");

}

