#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KoTCScoreBoard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass KoTCScoreBoard.KoTCScoreBoard_C
// 0x0060 (0x02F0 - 0x0290)
class UKoTCScoreBoard_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel_39;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_50;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsOwner_;                                          // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UKoTCScoreboardSpot_C*>          ScoreboardRowArray;                                // 0x02B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<int32>                                 Kill_Count_Array;                                  // 0x02C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         IndexWidthManValue;                                // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              UpdateFFAScoreboard_Widget;                        // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        Ko_TC_Timer;                                       // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Update_Scoreboard(double Time);
	class FText GetText_0();
	void ExecuteUbergraph_KoTCScoreBoard(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"KoTCScoreBoard_C">();
	}
	static class UKoTCScoreBoard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKoTCScoreBoard_C>();
	}
};
static_assert(alignof(UKoTCScoreBoard_C) == 0x000008, "Wrong alignment on UKoTCScoreBoard_C");
static_assert(sizeof(UKoTCScoreBoard_C) == 0x0002F0, "Wrong size on UKoTCScoreBoard_C");
static_assert(offsetof(UKoTCScoreBoard_C, UberGraphFrame) == 0x000290, "Member 'UKoTCScoreBoard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UKoTCScoreBoard_C, CanvasPanel_39) == 0x000298, "Member 'UKoTCScoreBoard_C::CanvasPanel_39' has a wrong offset!");
static_assert(offsetof(UKoTCScoreBoard_C, VerticalBox_50) == 0x0002A0, "Member 'UKoTCScoreBoard_C::VerticalBox_50' has a wrong offset!");
static_assert(offsetof(UKoTCScoreBoard_C, IsOwner_) == 0x0002A8, "Member 'UKoTCScoreBoard_C::IsOwner_' has a wrong offset!");
static_assert(offsetof(UKoTCScoreBoard_C, ScoreboardRowArray) == 0x0002B0, "Member 'UKoTCScoreBoard_C::ScoreboardRowArray' has a wrong offset!");
static_assert(offsetof(UKoTCScoreBoard_C, Kill_Count_Array) == 0x0002C0, "Member 'UKoTCScoreBoard_C::Kill_Count_Array' has a wrong offset!");
static_assert(offsetof(UKoTCScoreBoard_C, IndexWidthManValue) == 0x0002D0, "Member 'UKoTCScoreBoard_C::IndexWidthManValue' has a wrong offset!");
static_assert(offsetof(UKoTCScoreBoard_C, UpdateFFAScoreboard_Widget) == 0x0002D8, "Member 'UKoTCScoreBoard_C::UpdateFFAScoreboard_Widget' has a wrong offset!");
static_assert(offsetof(UKoTCScoreBoard_C, Ko_TC_Timer) == 0x0002E8, "Member 'UKoTCScoreBoard_C::Ko_TC_Timer' has a wrong offset!");

}

