#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Leaderboard_spot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Leaderboard_spot.Leaderboard_spot_C
// 0x0060 (0x02F0 - 0x0290)
class ULeaderboard_spot_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_0;                                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x02A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_0;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_1;                                       // 0x02B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_2;                                       // 0x02C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_3;                                       // 0x02C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   Name_0;                                            // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class APlayerState*                           Player;                                            // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsOwner_;                                          // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x3];                                      // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Team;                                              // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Authority;                                         // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	struct FSlateBrush Spectating_();
	class FText Player_name();
	class FText Ping();
	class FText Kills();
	class FText KD();
	ESlateVisibility GetVisibility_0();
	struct FSlateColor GetColorAndOpacity_0();
	struct FSlateBrush GetBrush_0();
	void ExecuteUbergraph_Leaderboard_spot(int32 EntryPoint);
	class FText Deaths();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Leaderboard_spot_C">();
	}
	static class ULeaderboard_spot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULeaderboard_spot_C>();
	}
};
static_assert(alignof(ULeaderboard_spot_C) == 0x000008, "Wrong alignment on ULeaderboard_spot_C");
static_assert(sizeof(ULeaderboard_spot_C) == 0x0002F0, "Wrong size on ULeaderboard_spot_C");
static_assert(offsetof(ULeaderboard_spot_C, UberGraphFrame) == 0x000290, "Member 'ULeaderboard_spot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULeaderboard_spot_C, Image_0) == 0x000298, "Member 'ULeaderboard_spot_C::Image_0' has a wrong offset!");
static_assert(offsetof(ULeaderboard_spot_C, Image_2) == 0x0002A0, "Member 'ULeaderboard_spot_C::Image_2' has a wrong offset!");
static_assert(offsetof(ULeaderboard_spot_C, TextBlock) == 0x0002A8, "Member 'ULeaderboard_spot_C::TextBlock' has a wrong offset!");
static_assert(offsetof(ULeaderboard_spot_C, TextBlock_0) == 0x0002B0, "Member 'ULeaderboard_spot_C::TextBlock_0' has a wrong offset!");
static_assert(offsetof(ULeaderboard_spot_C, TextBlock_1) == 0x0002B8, "Member 'ULeaderboard_spot_C::TextBlock_1' has a wrong offset!");
static_assert(offsetof(ULeaderboard_spot_C, TextBlock_2) == 0x0002C0, "Member 'ULeaderboard_spot_C::TextBlock_2' has a wrong offset!");
static_assert(offsetof(ULeaderboard_spot_C, TextBlock_3) == 0x0002C8, "Member 'ULeaderboard_spot_C::TextBlock_3' has a wrong offset!");
static_assert(offsetof(ULeaderboard_spot_C, Name_0) == 0x0002D0, "Member 'ULeaderboard_spot_C::Name_0' has a wrong offset!");
static_assert(offsetof(ULeaderboard_spot_C, Player) == 0x0002D8, "Member 'ULeaderboard_spot_C::Player' has a wrong offset!");
static_assert(offsetof(ULeaderboard_spot_C, IsOwner_) == 0x0002E0, "Member 'ULeaderboard_spot_C::IsOwner_' has a wrong offset!");
static_assert(offsetof(ULeaderboard_spot_C, Team) == 0x0002E4, "Member 'ULeaderboard_spot_C::Team' has a wrong offset!");
static_assert(offsetof(ULeaderboard_spot_C, Authority) == 0x0002E8, "Member 'ULeaderboard_spot_C::Authority' has a wrong offset!");

}

