#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MenuItemButtons

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MenuItemButtons.MenuItemButtons_C
// 0x0020 (0x02B0 - 0x0290)
class UMenuItemButtons_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button;                                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ChangeCosmeticButton;                              // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Has_closed;                                        // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MenuItemButtons(int32 EntryPoint);
	void BndEvt__MenuItemButtons_ChangeCosmeticButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__MenuItemButtons_Button_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MenuItemButtons_C">();
	}
	static class UMenuItemButtons_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMenuItemButtons_C>();
	}
};
static_assert(alignof(UMenuItemButtons_C) == 0x000008, "Wrong alignment on UMenuItemButtons_C");
static_assert(sizeof(UMenuItemButtons_C) == 0x0002B0, "Wrong size on UMenuItemButtons_C");
static_assert(offsetof(UMenuItemButtons_C, UberGraphFrame) == 0x000290, "Member 'UMenuItemButtons_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMenuItemButtons_C, Button) == 0x000298, "Member 'UMenuItemButtons_C::Button' has a wrong offset!");
static_assert(offsetof(UMenuItemButtons_C, ChangeCosmeticButton) == 0x0002A0, "Member 'UMenuItemButtons_C::ChangeCosmeticButton' has a wrong offset!");
static_assert(offsetof(UMenuItemButtons_C, Has_closed) == 0x0002A8, "Member 'UMenuItemButtons_C::Has_closed' has a wrong offset!");

}

