#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Menugus

#include "Basic.hpp"


namespace SDK::Params
{

// Function Menugus.Menugus_C.ExecuteUbergraph_Menugus
// 0x0098 (0x0098 - 0x0000)
struct Menugus_C_ExecuteUbergraph_Menugus final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlayerName_PlayerName;                 // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0018)()
	bool                                          K2Node_SwitchInteger_CmpSuccess_2;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_3;                 // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNameplate_C*                           K2Node_DynamicCast_AsNameplate;                    // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue;            // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveItems_C*                           K2Node_DynamicCast_AsSave_Items;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Menugus_C_ExecuteUbergraph_Menugus) == 0x000008, "Wrong alignment on Menugus_C_ExecuteUbergraph_Menugus");
static_assert(sizeof(Menugus_C_ExecuteUbergraph_Menugus) == 0x000098, "Wrong size on Menugus_C_ExecuteUbergraph_Menugus");
static_assert(offsetof(Menugus_C_ExecuteUbergraph_Menugus, EntryPoint) == 0x000000, "Member 'Menugus_C_ExecuteUbergraph_Menugus::EntryPoint' has a wrong offset!");
static_assert(offsetof(Menugus_C_ExecuteUbergraph_Menugus, CallFunc_GetPlayerState_ReturnValue) == 0x000008, "Member 'Menugus_C_ExecuteUbergraph_Menugus::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Menugus_C_ExecuteUbergraph_Menugus, K2Node_DynamicCast_AsPlayer_State_BP) == 0x000010, "Member 'Menugus_C_ExecuteUbergraph_Menugus::K2Node_DynamicCast_AsPlayer_State_BP' has a wrong offset!");
static_assert(offsetof(Menugus_C_ExecuteUbergraph_Menugus, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Menugus_C_ExecuteUbergraph_Menugus::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Menugus_C_ExecuteUbergraph_Menugus, K2Node_SwitchInteger_CmpSuccess) == 0x000019, "Member 'Menugus_C_ExecuteUbergraph_Menugus::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Menugus_C_ExecuteUbergraph_Menugus, K2Node_SwitchInteger_CmpSuccess_1) == 0x00001A, "Member 'Menugus_C_ExecuteUbergraph_Menugus::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(Menugus_C_ExecuteUbergraph_Menugus, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'Menugus_C_ExecuteUbergraph_Menugus::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Menugus_C_ExecuteUbergraph_Menugus, CallFunc_GetPlayerName_PlayerName) == 0x000028, "Member 'Menugus_C_ExecuteUbergraph_Menugus::CallFunc_GetPlayerName_PlayerName' has a wrong offset!");
static_assert(offsetof(Menugus_C_ExecuteUbergraph_Menugus, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'Menugus_C_ExecuteUbergraph_Menugus::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Menugus_C_ExecuteUbergraph_Menugus, K2Node_SwitchInteger_CmpSuccess_2) == 0x000050, "Member 'Menugus_C_ExecuteUbergraph_Menugus::K2Node_SwitchInteger_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(Menugus_C_ExecuteUbergraph_Menugus, K2Node_SwitchInteger_CmpSuccess_3) == 0x000051, "Member 'Menugus_C_ExecuteUbergraph_Menugus::K2Node_SwitchInteger_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(Menugus_C_ExecuteUbergraph_Menugus, K2Node_CreateDelegate_OutputDelegate) == 0x000054, "Member 'Menugus_C_ExecuteUbergraph_Menugus::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Menugus_C_ExecuteUbergraph_Menugus, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000068, "Member 'Menugus_C_ExecuteUbergraph_Menugus::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Menugus_C_ExecuteUbergraph_Menugus, K2Node_DynamicCast_AsNameplate) == 0x000070, "Member 'Menugus_C_ExecuteUbergraph_Menugus::K2Node_DynamicCast_AsNameplate' has a wrong offset!");
static_assert(offsetof(Menugus_C_ExecuteUbergraph_Menugus, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'Menugus_C_ExecuteUbergraph_Menugus::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Menugus_C_ExecuteUbergraph_Menugus, CallFunc_DoesSaveGameExist_ReturnValue) == 0x000079, "Member 'Menugus_C_ExecuteUbergraph_Menugus::CallFunc_DoesSaveGameExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(Menugus_C_ExecuteUbergraph_Menugus, CallFunc_LoadGameFromSlot_ReturnValue) == 0x000080, "Member 'Menugus_C_ExecuteUbergraph_Menugus::CallFunc_LoadGameFromSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(Menugus_C_ExecuteUbergraph_Menugus, K2Node_DynamicCast_AsSave_Items) == 0x000088, "Member 'Menugus_C_ExecuteUbergraph_Menugus::K2Node_DynamicCast_AsSave_Items' has a wrong offset!");
static_assert(offsetof(Menugus_C_ExecuteUbergraph_Menugus, K2Node_DynamicCast_bSuccess_2) == 0x000090, "Member 'Menugus_C_ExecuteUbergraph_Menugus::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Menugus_C_ExecuteUbergraph_Menugus, K2Node_SwitchString_CmpSuccess) == 0x000091, "Member 'Menugus_C_ExecuteUbergraph_Menugus::K2Node_SwitchString_CmpSuccess' has a wrong offset!");

}

