#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Menugus

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Menugus.Menugus_C
// 0x0088 (0x0380 - 0x02F8)
class AMenugus_C final : public APawn
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   HeisenGus;                                         // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CheeseHat;                                         // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Bucket;                                            // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MeksHat;                                           // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       Menu_Buttons;                                      // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       Name_plate;                                        // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Gus;                                               // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Gus_Twerk;                                         // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   Player_Title;                                      // 0x0350(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USaveGame*                              SaveItems;                                         // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Weapon_1;                                          // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Weapon_2;                                          // 0x0374(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Flintlock_Equipped;                                // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EOR_Equipped;                                      // 0x0379(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Blunderbuss_Equipped;                              // 0x037A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Flintlock_Equipped_2;                              // 0x037B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Blunderbuss_Equipped_2;                            // 0x037C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EOR_Equipped_2;                                    // 0x037D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void Item_Changed();
	void ExecuteUbergraph_Menugus(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Menugus_C">();
	}
	static class AMenugus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMenugus_C>();
	}
};
static_assert(alignof(AMenugus_C) == 0x000008, "Wrong alignment on AMenugus_C");
static_assert(sizeof(AMenugus_C) == 0x000380, "Wrong size on AMenugus_C");
static_assert(offsetof(AMenugus_C, UberGraphFrame) == 0x0002F8, "Member 'AMenugus_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMenugus_C, HeisenGus) == 0x000300, "Member 'AMenugus_C::HeisenGus' has a wrong offset!");
static_assert(offsetof(AMenugus_C, CheeseHat) == 0x000308, "Member 'AMenugus_C::CheeseHat' has a wrong offset!");
static_assert(offsetof(AMenugus_C, Bucket) == 0x000310, "Member 'AMenugus_C::Bucket' has a wrong offset!");
static_assert(offsetof(AMenugus_C, MeksHat) == 0x000318, "Member 'AMenugus_C::MeksHat' has a wrong offset!");
static_assert(offsetof(AMenugus_C, Menu_Buttons) == 0x000320, "Member 'AMenugus_C::Menu_Buttons' has a wrong offset!");
static_assert(offsetof(AMenugus_C, Name_plate) == 0x000328, "Member 'AMenugus_C::Name_plate' has a wrong offset!");
static_assert(offsetof(AMenugus_C, Gus) == 0x000330, "Member 'AMenugus_C::Gus' has a wrong offset!");
static_assert(offsetof(AMenugus_C, DefaultSceneRoot) == 0x000338, "Member 'AMenugus_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AMenugus_C, Gus_Twerk) == 0x000340, "Member 'AMenugus_C::Gus_Twerk' has a wrong offset!");
static_assert(offsetof(AMenugus_C, Player_Title) == 0x000350, "Member 'AMenugus_C::Player_Title' has a wrong offset!");
static_assert(offsetof(AMenugus_C, SaveItems) == 0x000368, "Member 'AMenugus_C::SaveItems' has a wrong offset!");
static_assert(offsetof(AMenugus_C, Weapon_1) == 0x000370, "Member 'AMenugus_C::Weapon_1' has a wrong offset!");
static_assert(offsetof(AMenugus_C, Weapon_2) == 0x000374, "Member 'AMenugus_C::Weapon_2' has a wrong offset!");
static_assert(offsetof(AMenugus_C, Flintlock_Equipped) == 0x000378, "Member 'AMenugus_C::Flintlock_Equipped' has a wrong offset!");
static_assert(offsetof(AMenugus_C, EOR_Equipped) == 0x000379, "Member 'AMenugus_C::EOR_Equipped' has a wrong offset!");
static_assert(offsetof(AMenugus_C, Blunderbuss_Equipped) == 0x00037A, "Member 'AMenugus_C::Blunderbuss_Equipped' has a wrong offset!");
static_assert(offsetof(AMenugus_C, Flintlock_Equipped_2) == 0x00037B, "Member 'AMenugus_C::Flintlock_Equipped_2' has a wrong offset!");
static_assert(offsetof(AMenugus_C, Blunderbuss_Equipped_2) == 0x00037C, "Member 'AMenugus_C::Blunderbuss_Equipped_2' has a wrong offset!");
static_assert(offsetof(AMenugus_C, EOR_Equipped_2) == 0x00037D, "Member 'AMenugus_C::EOR_Equipped_2' has a wrong offset!");

}

