#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MenuGusAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct MenuGusAnimBP.MenuGusAnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0000 (0x0001 - 0x0001)
struct MenuGusAnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
};
static_assert(alignof(MenuGusAnimBP::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on MenuGusAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(MenuGusAnimBP::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong size on MenuGusAnimBP::FAnimBlueprintGeneratedMutableData");

// ScriptStruct MenuGusAnimBP.MenuGusAnimBP_C.AnimBlueprintGeneratedConstantData
// 0x0137 (0x0138 - 0x0001)
struct MenuGusAnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_54;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_55;                             // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_56;                                 // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_57;                                  // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_58;                                 // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_59;                                  // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_60;                               // 0x0030(0x0020)(BlueprintVisible, NoDestructor)
	bool                                          __BoolProperty_61;                                 // 0x0050(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_62;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_63;                               // 0x0058(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_64;                                // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_65;                             // 0x0088(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_66;                                 // 0x0090(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_67;                                 // 0x0091(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_68;                                 // 0x0092(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93[0x1];                                       // 0x0093(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_69;                                 // 0x0094(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00A0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0120(0x0018)()
};
static_assert(alignof(MenuGusAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on MenuGusAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(MenuGusAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000138, "Wrong size on MenuGusAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(MenuGusAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_54) == 0x000004, "Member 'MenuGusAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_54' has a wrong offset!");
static_assert(offsetof(MenuGusAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_55) == 0x000010, "Member 'MenuGusAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_55' has a wrong offset!");
static_assert(offsetof(MenuGusAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_56) == 0x000018, "Member 'MenuGusAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_56' has a wrong offset!");
static_assert(offsetof(MenuGusAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_57) == 0x000020, "Member 'MenuGusAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_57' has a wrong offset!");
static_assert(offsetof(MenuGusAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_58) == 0x000024, "Member 'MenuGusAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_58' has a wrong offset!");
static_assert(offsetof(MenuGusAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_59) == 0x00002C, "Member 'MenuGusAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_59' has a wrong offset!");
static_assert(offsetof(MenuGusAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_60) == 0x000030, "Member 'MenuGusAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_60' has a wrong offset!");
static_assert(offsetof(MenuGusAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_61) == 0x000050, "Member 'MenuGusAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_61' has a wrong offset!");
static_assert(offsetof(MenuGusAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_62) == 0x000054, "Member 'MenuGusAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_62' has a wrong offset!");
static_assert(offsetof(MenuGusAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_63) == 0x000058, "Member 'MenuGusAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_63' has a wrong offset!");
static_assert(offsetof(MenuGusAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_64) == 0x000084, "Member 'MenuGusAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_64' has a wrong offset!");
static_assert(offsetof(MenuGusAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_65) == 0x000088, "Member 'MenuGusAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_65' has a wrong offset!");
static_assert(offsetof(MenuGusAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_66) == 0x000090, "Member 'MenuGusAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_66' has a wrong offset!");
static_assert(offsetof(MenuGusAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_67) == 0x000091, "Member 'MenuGusAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_67' has a wrong offset!");
static_assert(offsetof(MenuGusAnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_68) == 0x000092, "Member 'MenuGusAnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_68' has a wrong offset!");
static_assert(offsetof(MenuGusAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_69) == 0x000094, "Member 'MenuGusAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_69' has a wrong offset!");
static_assert(offsetof(MenuGusAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000A0, "Member 'MenuGusAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(MenuGusAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000120, "Member 'MenuGusAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

