#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Nameplate

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function Nameplate.Nameplate_C.VisibilityFunction
// 0x0001 (0x0001 - 0x0000)
struct Nameplate_C_VisibilityFunction final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Nameplate_C_VisibilityFunction) == 0x000001, "Wrong alignment on Nameplate_C_VisibilityFunction");
static_assert(sizeof(Nameplate_C_VisibilityFunction) == 0x000001, "Wrong size on Nameplate_C_VisibilityFunction");
static_assert(offsetof(Nameplate_C_VisibilityFunction, ReturnValue) == 0x000000, "Member 'Nameplate_C_VisibilityFunction::ReturnValue' has a wrong offset!");

// Function Nameplate.Nameplate_C.TextFunction
// 0x0018 (0x0018 - 0x0000)
struct Nameplate_C_TextFunction final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(Nameplate_C_TextFunction) == 0x000008, "Wrong alignment on Nameplate_C_TextFunction");
static_assert(sizeof(Nameplate_C_TextFunction) == 0x000018, "Wrong size on Nameplate_C_TextFunction");
static_assert(offsetof(Nameplate_C_TextFunction, ReturnValue) == 0x000000, "Member 'Nameplate_C_TextFunction::ReturnValue' has a wrong offset!");

// Function Nameplate.Nameplate_C.GetText_0
// 0x0018 (0x0018 - 0x0000)
struct Nameplate_C_GetText_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(Nameplate_C_GetText_0) == 0x000008, "Wrong alignment on Nameplate_C_GetText_0");
static_assert(sizeof(Nameplate_C_GetText_0) == 0x000018, "Wrong size on Nameplate_C_GetText_0");
static_assert(offsetof(Nameplate_C_GetText_0, ReturnValue) == 0x000000, "Member 'Nameplate_C_GetText_0::ReturnValue' has a wrong offset!");

// Function Nameplate.Nameplate_C.Get_Name_ColorAndOpacity_0
// 0x003C (0x003C - 0x0000)
struct Nameplate_C_Get_Name_ColorAndOpacity_0 final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0014)(Parm, OutParm, ReturnParm)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0014(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0028(0x0014)()
};
static_assert(alignof(Nameplate_C_Get_Name_ColorAndOpacity_0) == 0x000004, "Wrong alignment on Nameplate_C_Get_Name_ColorAndOpacity_0");
static_assert(sizeof(Nameplate_C_Get_Name_ColorAndOpacity_0) == 0x00003C, "Wrong size on Nameplate_C_Get_Name_ColorAndOpacity_0");
static_assert(offsetof(Nameplate_C_Get_Name_ColorAndOpacity_0, ReturnValue) == 0x000000, "Member 'Nameplate_C_Get_Name_ColorAndOpacity_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(Nameplate_C_Get_Name_ColorAndOpacity_0, K2Node_MakeStruct_SlateColor) == 0x000014, "Member 'Nameplate_C_Get_Name_ColorAndOpacity_0::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(Nameplate_C_Get_Name_ColorAndOpacity_0, K2Node_MakeStruct_SlateColor_1) == 0x000028, "Member 'Nameplate_C_Get_Name_ColorAndOpacity_0::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

// Function Nameplate.Nameplate_C.ExecuteUbergraph_Nameplate
// 0x0020 (0x0020 - 0x0000)
struct Nameplate_C_ExecuteUbergraph_Nameplate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerControllerBP_C*                  K2Node_DynamicCast_AsPlayer_Controller_BP;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Nameplate_C_ExecuteUbergraph_Nameplate) == 0x000008, "Wrong alignment on Nameplate_C_ExecuteUbergraph_Nameplate");
static_assert(sizeof(Nameplate_C_ExecuteUbergraph_Nameplate) == 0x000020, "Wrong size on Nameplate_C_ExecuteUbergraph_Nameplate");
static_assert(offsetof(Nameplate_C_ExecuteUbergraph_Nameplate, EntryPoint) == 0x000000, "Member 'Nameplate_C_ExecuteUbergraph_Nameplate::EntryPoint' has a wrong offset!");
static_assert(offsetof(Nameplate_C_ExecuteUbergraph_Nameplate, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'Nameplate_C_ExecuteUbergraph_Nameplate::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Nameplate_C_ExecuteUbergraph_Nameplate, K2Node_DynamicCast_AsPlayer_Controller_BP) == 0x000010, "Member 'Nameplate_C_ExecuteUbergraph_Nameplate::K2Node_DynamicCast_AsPlayer_Controller_BP' has a wrong offset!");
static_assert(offsetof(Nameplate_C_ExecuteUbergraph_Nameplate, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Nameplate_C_ExecuteUbergraph_Nameplate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Nameplate_C_ExecuteUbergraph_Nameplate, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000019, "Member 'Nameplate_C_ExecuteUbergraph_Nameplate::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Nameplate_C_ExecuteUbergraph_Nameplate, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00001A, "Member 'Nameplate_C_ExecuteUbergraph_Nameplate::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");

}

