#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptionsMaster

#include "Basic.hpp"


namespace SDK::Params
{

// Function OptionsMaster.OptionsMaster_C.ExecuteUbergraph_OptionsMaster
// 0x000C (0x000C - 0x0000)
struct OptionsMaster_C_ExecuteUbergraph_OptionsMaster final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_3;               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_3;                     // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMaster_C_ExecuteUbergraph_OptionsMaster) == 0x000004, "Wrong alignment on OptionsMaster_C_ExecuteUbergraph_OptionsMaster");
static_assert(sizeof(OptionsMaster_C_ExecuteUbergraph_OptionsMaster) == 0x00000C, "Wrong size on OptionsMaster_C_ExecuteUbergraph_OptionsMaster");
static_assert(offsetof(OptionsMaster_C_ExecuteUbergraph_OptionsMaster, EntryPoint) == 0x000000, "Member 'OptionsMaster_C_ExecuteUbergraph_OptionsMaster::EntryPoint' has a wrong offset!");
static_assert(offsetof(OptionsMaster_C_ExecuteUbergraph_OptionsMaster, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'OptionsMaster_C_ExecuteUbergraph_OptionsMaster::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMaster_C_ExecuteUbergraph_OptionsMaster, Temp_bool_Has_Been_Initd_Variable) == 0x000005, "Member 'OptionsMaster_C_ExecuteUbergraph_OptionsMaster::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMaster_C_ExecuteUbergraph_OptionsMaster, Temp_bool_IsClosed_Variable_1) == 0x000006, "Member 'OptionsMaster_C_ExecuteUbergraph_OptionsMaster::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(OptionsMaster_C_ExecuteUbergraph_OptionsMaster, Temp_bool_Has_Been_Initd_Variable_1) == 0x000007, "Member 'OptionsMaster_C_ExecuteUbergraph_OptionsMaster::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(OptionsMaster_C_ExecuteUbergraph_OptionsMaster, Temp_bool_IsClosed_Variable_2) == 0x000008, "Member 'OptionsMaster_C_ExecuteUbergraph_OptionsMaster::Temp_bool_IsClosed_Variable_2' has a wrong offset!");
static_assert(offsetof(OptionsMaster_C_ExecuteUbergraph_OptionsMaster, Temp_bool_Has_Been_Initd_Variable_2) == 0x000009, "Member 'OptionsMaster_C_ExecuteUbergraph_OptionsMaster::Temp_bool_Has_Been_Initd_Variable_2' has a wrong offset!");
static_assert(offsetof(OptionsMaster_C_ExecuteUbergraph_OptionsMaster, Temp_bool_Has_Been_Initd_Variable_3) == 0x00000A, "Member 'OptionsMaster_C_ExecuteUbergraph_OptionsMaster::Temp_bool_Has_Been_Initd_Variable_3' has a wrong offset!");
static_assert(offsetof(OptionsMaster_C_ExecuteUbergraph_OptionsMaster, Temp_bool_IsClosed_Variable_3) == 0x00000B, "Member 'OptionsMaster_C_ExecuteUbergraph_OptionsMaster::Temp_bool_IsClosed_Variable_3' has a wrong offset!");

}

