#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PantMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PantMenu.PantMenu_C
// 0x0128 (0x03B8 - 0x0290)
class UPantMenu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         One20KillsBox;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Two0KillsBox;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Five0KillsBox;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Eight0KillsBox;                                    // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                BlackPant;                                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                BluePant;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                DefaultPant;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                GreenPant;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_6;                                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_7;                                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_8;                                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_9;                                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_10;                                          // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_11;                                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                OrangePant;                                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                PurplePant;                                        // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                RedPant;                                           // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                WhitePant;                                         // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                YellowPant;                                        // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                GusRefrence;                                       // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Attach_mekshat;                                    // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         Local_Hat_Number;                                  // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveGame*                              SaveOptions;                                       // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Player_Kills;                                      // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Title_Number;                                      // 0x0394(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HatNumber;                                         // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Skin_Number;                                       // 0x039C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Weapon_1;                                          // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Weapon_2;                                          // 0x03A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 PantType;                                          // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void Save_Item(int32 Title, int32 Hat, int32 Skin, const class FString& PantType_0);
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_PantMenu(int32 EntryPoint);
	bool EnableYellowPant();
	bool EnableWhitePant();
	bool EnableRedPant();
	bool EnablePurplePant();
	bool EnableOrangePant();
	bool EnableGreenPant();
	bool EnableDefault();
	bool EnableBluePant();
	bool EnableBlack();
	void Construct();
	void BndEvt__PantMenu_YellowPant_K2Node_ComponentBoundEvent_10_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__PantMenu_WhitePant_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__PantMenu_RedPant_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__PantMenu_PurplePant_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__HatMenu_HeisenGusButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__HatMenu_HatNoneButton_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__HatMenu_Hat1_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__HatMenu_CheeseHat_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__HatMenu_BucketheadHat_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PantMenu_C">();
	}
	static class UPantMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPantMenu_C>();
	}
};
static_assert(alignof(UPantMenu_C) == 0x000008, "Wrong alignment on UPantMenu_C");
static_assert(sizeof(UPantMenu_C) == 0x0003B8, "Wrong size on UPantMenu_C");
static_assert(offsetof(UPantMenu_C, UberGraphFrame) == 0x000290, "Member 'UPantMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPantMenu_C, One20KillsBox) == 0x000298, "Member 'UPantMenu_C::One20KillsBox' has a wrong offset!");
static_assert(offsetof(UPantMenu_C, Two0KillsBox) == 0x0002A0, "Member 'UPantMenu_C::Two0KillsBox' has a wrong offset!");
static_assert(offsetof(UPantMenu_C, Five0KillsBox) == 0x0002A8, "Member 'UPantMenu_C::Five0KillsBox' has a wrong offset!");
static_assert(offsetof(UPantMenu_C, Eight0KillsBox) == 0x0002B0, "Member 'UPantMenu_C::Eight0KillsBox' has a wrong offset!");
static_assert(offsetof(UPantMenu_C, BlackPant) == 0x0002B8, "Member 'UPantMenu_C::BlackPant' has a wrong offset!");
static_assert(offsetof(UPantMenu_C, BluePant) == 0x0002C0, "Member 'UPantMenu_C::BluePant' has a wrong offset!");
static_assert(offsetof(UPantMenu_C, DefaultPant) == 0x0002C8, "Member 'UPantMenu_C::DefaultPant' has a wrong offset!");
static_assert(offsetof(UPantMenu_C, GreenPant) == 0x0002D0, "Member 'UPantMenu_C::GreenPant' has a wrong offset!");
static_assert(offsetof(UPantMenu_C, Image) == 0x0002D8, "Member 'UPantMenu_C::Image' has a wrong offset!");
static_assert(offsetof(UPantMenu_C, Image_0) == 0x0002E0, "Member 'UPantMenu_C::Image_0' has a wrong offset!");
static_assert(offsetof(UPantMenu_C, Image_1) == 0x0002E8, "Member 'UPantMenu_C::Image_1' has a wrong offset!");
static_assert(offsetof(UPantMenu_C, Image_2) == 0x0002F0, "Member 'UPantMenu_C::Image_2' has a wrong offset!");
static_assert(offsetof(UPantMenu_C, Image_3) == 0x0002F8, "Member 'UPantMenu_C::Image_3' has a wrong offset!");
static_assert(offsetof(UPantMenu_C, Image_4) == 0x000300, "Member 'UPantMenu_C::Image_4' has a wrong offset!");
static_assert(offsetof(UPantMenu_C, Image_5) == 0x000308, "Member 'UPantMenu_C::Image_5' has a wrong offset!");
static_assert(offsetof(UPantMenu_C, Image_6) == 0x000310, "Member 'UPantMenu_C::Image_6' has a wrong offset!");
static_assert(offsetof(UPantMenu_C, Image_7) == 0x000318, "Member 'UPantMenu_C::Image_7' has a wrong offset!");
static_assert(offsetof(UPantMenu_C, Image_8) == 0x000320, "Member 'UPantMenu_C::Image_8' has a wrong offset!");
static_assert(offsetof(UPantMenu_C, Image_9) == 0x000328, "Member 'UPantMenu_C::Image_9' has a wrong offset!");
static_assert(offsetof(UPantMenu_C, Image_10) == 0x000330, "Member 'UPantMenu_C::Image_10' has a wrong offset!");
static_assert(offsetof(UPantMenu_C, Image_11) == 0x000338, "Member 'UPantMenu_C::Image_11' has a wrong offset!");
static_assert(offsetof(UPantMenu_C, OrangePant) == 0x000340, "Member 'UPantMenu_C::OrangePant' has a wrong offset!");
static_assert(offsetof(UPantMenu_C, PurplePant) == 0x000348, "Member 'UPantMenu_C::PurplePant' has a wrong offset!");
static_assert(offsetof(UPantMenu_C, RedPant) == 0x000350, "Member 'UPantMenu_C::RedPant' has a wrong offset!");
static_assert(offsetof(UPantMenu_C, WhitePant) == 0x000358, "Member 'UPantMenu_C::WhitePant' has a wrong offset!");
static_assert(offsetof(UPantMenu_C, YellowPant) == 0x000360, "Member 'UPantMenu_C::YellowPant' has a wrong offset!");
static_assert(offsetof(UPantMenu_C, GusRefrence) == 0x000368, "Member 'UPantMenu_C::GusRefrence' has a wrong offset!");
static_assert(offsetof(UPantMenu_C, Attach_mekshat) == 0x000370, "Member 'UPantMenu_C::Attach_mekshat' has a wrong offset!");
static_assert(offsetof(UPantMenu_C, Local_Hat_Number) == 0x000380, "Member 'UPantMenu_C::Local_Hat_Number' has a wrong offset!");
static_assert(offsetof(UPantMenu_C, SaveOptions) == 0x000388, "Member 'UPantMenu_C::SaveOptions' has a wrong offset!");
static_assert(offsetof(UPantMenu_C, Player_Kills) == 0x000390, "Member 'UPantMenu_C::Player_Kills' has a wrong offset!");
static_assert(offsetof(UPantMenu_C, Title_Number) == 0x000394, "Member 'UPantMenu_C::Title_Number' has a wrong offset!");
static_assert(offsetof(UPantMenu_C, HatNumber) == 0x000398, "Member 'UPantMenu_C::HatNumber' has a wrong offset!");
static_assert(offsetof(UPantMenu_C, Skin_Number) == 0x00039C, "Member 'UPantMenu_C::Skin_Number' has a wrong offset!");
static_assert(offsetof(UPantMenu_C, Weapon_1) == 0x0003A0, "Member 'UPantMenu_C::Weapon_1' has a wrong offset!");
static_assert(offsetof(UPantMenu_C, Weapon_2) == 0x0003A4, "Member 'UPantMenu_C::Weapon_2' has a wrong offset!");
static_assert(offsetof(UPantMenu_C, PantType) == 0x0003A8, "Member 'UPantMenu_C::PantType' has a wrong offset!");

}

