#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PantMenu

#include "Basic.hpp"


namespace SDK::Params
{

// Function PantMenu.PantMenu_C.Save Item
// 0x0050 (0x0050 - 0x0000)
struct PantMenu_C_Save_Item final
{
public:
	int32                                         Title;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Hat;                                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Skin;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PantType_0;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICharacterInterface_C> K2Node_DynamicCast_AsCharacter_Interface;          // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveItems_C*                           CallFunc_CreateSaveGameObject_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PantMenu_C_Save_Item) == 0x000008, "Wrong alignment on PantMenu_C_Save_Item");
static_assert(sizeof(PantMenu_C_Save_Item) == 0x000050, "Wrong size on PantMenu_C_Save_Item");
static_assert(offsetof(PantMenu_C_Save_Item, Title) == 0x000000, "Member 'PantMenu_C_Save_Item::Title' has a wrong offset!");
static_assert(offsetof(PantMenu_C_Save_Item, Hat) == 0x000004, "Member 'PantMenu_C_Save_Item::Hat' has a wrong offset!");
static_assert(offsetof(PantMenu_C_Save_Item, Skin) == 0x000008, "Member 'PantMenu_C_Save_Item::Skin' has a wrong offset!");
static_assert(offsetof(PantMenu_C_Save_Item, PantType_0) == 0x000010, "Member 'PantMenu_C_Save_Item::PantType_0' has a wrong offset!");
static_assert(offsetof(PantMenu_C_Save_Item, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000020, "Member 'PantMenu_C_Save_Item::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(PantMenu_C_Save_Item, K2Node_DynamicCast_AsCharacter_Interface) == 0x000028, "Member 'PantMenu_C_Save_Item::K2Node_DynamicCast_AsCharacter_Interface' has a wrong offset!");
static_assert(offsetof(PantMenu_C_Save_Item, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'PantMenu_C_Save_Item::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PantMenu_C_Save_Item, CallFunc_CreateSaveGameObject_ReturnValue) == 0x000040, "Member 'PantMenu_C_Save_Item::CallFunc_CreateSaveGameObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(PantMenu_C_Save_Item, CallFunc_SaveGameToSlot_ReturnValue) == 0x000048, "Member 'PantMenu_C_Save_Item::CallFunc_SaveGameToSlot_ReturnValue' has a wrong offset!");

// Function PantMenu.PantMenu_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct PantMenu_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PantMenu_C_PreConstruct) == 0x000001, "Wrong alignment on PantMenu_C_PreConstruct");
static_assert(sizeof(PantMenu_C_PreConstruct) == 0x000001, "Wrong size on PantMenu_C_PreConstruct");
static_assert(offsetof(PantMenu_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'PantMenu_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function PantMenu.PantMenu_C.ExecuteUbergraph_PantMenu
// 0x0140 (0x0140 - 0x0000)
struct PantMenu_C_ExecuteUbergraph_PantMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue_1;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP_1;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue_2;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP_2;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue_3;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP_3;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue_4;             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP_4;            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue_1;          // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue_1;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveItems_C*                           K2Node_DynamicCast_AsSave_Items;                   // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue_2;          // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue_2;           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveItems_C*                           K2Node_DynamicCast_AsSave_Items_1;                 // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USavePlayerData_C*                      K2Node_DynamicCast_AsSave_Player_Data;             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue_5;             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP_5;            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue_6;             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP_6;            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue_7;             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP_7;            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PantMenu_C_ExecuteUbergraph_PantMenu) == 0x000008, "Wrong alignment on PantMenu_C_ExecuteUbergraph_PantMenu");
static_assert(sizeof(PantMenu_C_ExecuteUbergraph_PantMenu) == 0x000140, "Wrong size on PantMenu_C_ExecuteUbergraph_PantMenu");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, EntryPoint) == 0x000000, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, CallFunc_GetPlayerState_ReturnValue) == 0x000008, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, K2Node_DynamicCast_AsPlayer_State_BP) == 0x000010, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::K2Node_DynamicCast_AsPlayer_State_BP' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, CallFunc_LoadGameFromSlot_ReturnValue) == 0x000020, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::CallFunc_LoadGameFromSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, CallFunc_DoesSaveGameExist_ReturnValue) == 0x000028, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::CallFunc_DoesSaveGameExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, K2Node_Event_IsDesignTime) == 0x000029, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, CallFunc_GetPlayerState_ReturnValue_1) == 0x000030, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::CallFunc_GetPlayerState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, K2Node_DynamicCast_AsPlayer_State_BP_1) == 0x000038, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::K2Node_DynamicCast_AsPlayer_State_BP_1' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, CallFunc_GetPlayerState_ReturnValue_2) == 0x000048, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::CallFunc_GetPlayerState_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, K2Node_DynamicCast_AsPlayer_State_BP_2) == 0x000050, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::K2Node_DynamicCast_AsPlayer_State_BP_2' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, K2Node_DynamicCast_bSuccess_2) == 0x000058, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, CallFunc_GetPlayerState_ReturnValue_3) == 0x000060, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::CallFunc_GetPlayerState_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000068, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, K2Node_DynamicCast_AsPlayer_State_BP_3) == 0x000070, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::K2Node_DynamicCast_AsPlayer_State_BP_3' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, K2Node_DynamicCast_bSuccess_3) == 0x000078, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, K2Node_DynamicCast_AsTrain_Gus_Player) == 0x000080, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::K2Node_DynamicCast_AsTrain_Gus_Player' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, K2Node_DynamicCast_bSuccess_4) == 0x000088, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, CallFunc_GetPlayerState_ReturnValue_4) == 0x000090, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::CallFunc_GetPlayerState_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, K2Node_DynamicCast_AsPlayer_State_BP_4) == 0x000098, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::K2Node_DynamicCast_AsPlayer_State_BP_4' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, K2Node_DynamicCast_bSuccess_5) == 0x0000A0, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, CallFunc_DoesSaveGameExist_ReturnValue_1) == 0x0000A1, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::CallFunc_DoesSaveGameExist_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, CallFunc_LoadGameFromSlot_ReturnValue_1) == 0x0000A8, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::CallFunc_LoadGameFromSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, K2Node_DynamicCast_AsSave_Items) == 0x0000B0, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::K2Node_DynamicCast_AsSave_Items' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, K2Node_DynamicCast_bSuccess_6) == 0x0000B8, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, CallFunc_DoesSaveGameExist_ReturnValue_2) == 0x0000B9, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::CallFunc_DoesSaveGameExist_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, CallFunc_Conv_IntToString_ReturnValue) == 0x0000C0, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, CallFunc_LoadGameFromSlot_ReturnValue_2) == 0x0000D0, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::CallFunc_LoadGameFromSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, K2Node_DynamicCast_AsSave_Items_1) == 0x0000D8, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::K2Node_DynamicCast_AsSave_Items_1' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, K2Node_DynamicCast_bSuccess_7) == 0x0000E0, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, K2Node_DynamicCast_AsSave_Player_Data) == 0x0000E8, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::K2Node_DynamicCast_AsSave_Player_Data' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, K2Node_DynamicCast_bSuccess_8) == 0x0000F0, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, CallFunc_GetPlayerState_ReturnValue_5) == 0x0000F8, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::CallFunc_GetPlayerState_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, K2Node_DynamicCast_AsPlayer_State_BP_5) == 0x000100, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::K2Node_DynamicCast_AsPlayer_State_BP_5' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, K2Node_DynamicCast_bSuccess_9) == 0x000108, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, CallFunc_GetPlayerState_ReturnValue_6) == 0x000110, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::CallFunc_GetPlayerState_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, K2Node_DynamicCast_AsPlayer_State_BP_6) == 0x000118, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::K2Node_DynamicCast_AsPlayer_State_BP_6' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, K2Node_DynamicCast_bSuccess_10) == 0x000120, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, CallFunc_GetPlayerState_ReturnValue_7) == 0x000128, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::CallFunc_GetPlayerState_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, K2Node_DynamicCast_AsPlayer_State_BP_7) == 0x000130, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::K2Node_DynamicCast_AsPlayer_State_BP_7' has a wrong offset!");
static_assert(offsetof(PantMenu_C_ExecuteUbergraph_PantMenu, K2Node_DynamicCast_bSuccess_11) == 0x000138, "Member 'PantMenu_C_ExecuteUbergraph_PantMenu::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");

// Function PantMenu.PantMenu_C.EnableYellowPant
// 0x0020 (0x0020 - 0x0000)
struct PantMenu_C_EnableYellowPant final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PantMenu_C_EnableYellowPant) == 0x000008, "Wrong alignment on PantMenu_C_EnableYellowPant");
static_assert(sizeof(PantMenu_C_EnableYellowPant) == 0x000020, "Wrong size on PantMenu_C_EnableYellowPant");
static_assert(offsetof(PantMenu_C_EnableYellowPant, ReturnValue) == 0x000000, "Member 'PantMenu_C_EnableYellowPant::ReturnValue' has a wrong offset!");
static_assert(offsetof(PantMenu_C_EnableYellowPant, CallFunc_GetPlayerState_ReturnValue) == 0x000008, "Member 'PantMenu_C_EnableYellowPant::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(PantMenu_C_EnableYellowPant, K2Node_DynamicCast_AsPlayer_State_BP) == 0x000010, "Member 'PantMenu_C_EnableYellowPant::K2Node_DynamicCast_AsPlayer_State_BP' has a wrong offset!");
static_assert(offsetof(PantMenu_C_EnableYellowPant, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PantMenu_C_EnableYellowPant::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PantMenu_C_EnableYellowPant, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000019, "Member 'PantMenu_C_EnableYellowPant::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function PantMenu.PantMenu_C.EnableWhitePant
// 0x0020 (0x0020 - 0x0000)
struct PantMenu_C_EnableWhitePant final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PantMenu_C_EnableWhitePant) == 0x000008, "Wrong alignment on PantMenu_C_EnableWhitePant");
static_assert(sizeof(PantMenu_C_EnableWhitePant) == 0x000020, "Wrong size on PantMenu_C_EnableWhitePant");
static_assert(offsetof(PantMenu_C_EnableWhitePant, ReturnValue) == 0x000000, "Member 'PantMenu_C_EnableWhitePant::ReturnValue' has a wrong offset!");
static_assert(offsetof(PantMenu_C_EnableWhitePant, CallFunc_GetPlayerState_ReturnValue) == 0x000008, "Member 'PantMenu_C_EnableWhitePant::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(PantMenu_C_EnableWhitePant, K2Node_DynamicCast_AsPlayer_State_BP) == 0x000010, "Member 'PantMenu_C_EnableWhitePant::K2Node_DynamicCast_AsPlayer_State_BP' has a wrong offset!");
static_assert(offsetof(PantMenu_C_EnableWhitePant, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PantMenu_C_EnableWhitePant::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PantMenu_C_EnableWhitePant, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000019, "Member 'PantMenu_C_EnableWhitePant::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function PantMenu.PantMenu_C.EnableRedPant
// 0x0020 (0x0020 - 0x0000)
struct PantMenu_C_EnableRedPant final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PantMenu_C_EnableRedPant) == 0x000008, "Wrong alignment on PantMenu_C_EnableRedPant");
static_assert(sizeof(PantMenu_C_EnableRedPant) == 0x000020, "Wrong size on PantMenu_C_EnableRedPant");
static_assert(offsetof(PantMenu_C_EnableRedPant, ReturnValue) == 0x000000, "Member 'PantMenu_C_EnableRedPant::ReturnValue' has a wrong offset!");
static_assert(offsetof(PantMenu_C_EnableRedPant, CallFunc_GetPlayerState_ReturnValue) == 0x000008, "Member 'PantMenu_C_EnableRedPant::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(PantMenu_C_EnableRedPant, K2Node_DynamicCast_AsPlayer_State_BP) == 0x000010, "Member 'PantMenu_C_EnableRedPant::K2Node_DynamicCast_AsPlayer_State_BP' has a wrong offset!");
static_assert(offsetof(PantMenu_C_EnableRedPant, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PantMenu_C_EnableRedPant::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PantMenu_C_EnableRedPant, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000019, "Member 'PantMenu_C_EnableRedPant::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function PantMenu.PantMenu_C.EnablePurplePant
// 0x0020 (0x0020 - 0x0000)
struct PantMenu_C_EnablePurplePant final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PantMenu_C_EnablePurplePant) == 0x000008, "Wrong alignment on PantMenu_C_EnablePurplePant");
static_assert(sizeof(PantMenu_C_EnablePurplePant) == 0x000020, "Wrong size on PantMenu_C_EnablePurplePant");
static_assert(offsetof(PantMenu_C_EnablePurplePant, ReturnValue) == 0x000000, "Member 'PantMenu_C_EnablePurplePant::ReturnValue' has a wrong offset!");
static_assert(offsetof(PantMenu_C_EnablePurplePant, CallFunc_GetPlayerState_ReturnValue) == 0x000008, "Member 'PantMenu_C_EnablePurplePant::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(PantMenu_C_EnablePurplePant, K2Node_DynamicCast_AsPlayer_State_BP) == 0x000010, "Member 'PantMenu_C_EnablePurplePant::K2Node_DynamicCast_AsPlayer_State_BP' has a wrong offset!");
static_assert(offsetof(PantMenu_C_EnablePurplePant, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PantMenu_C_EnablePurplePant::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PantMenu_C_EnablePurplePant, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000019, "Member 'PantMenu_C_EnablePurplePant::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function PantMenu.PantMenu_C.EnableOrangePant
// 0x0020 (0x0020 - 0x0000)
struct PantMenu_C_EnableOrangePant final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PantMenu_C_EnableOrangePant) == 0x000008, "Wrong alignment on PantMenu_C_EnableOrangePant");
static_assert(sizeof(PantMenu_C_EnableOrangePant) == 0x000020, "Wrong size on PantMenu_C_EnableOrangePant");
static_assert(offsetof(PantMenu_C_EnableOrangePant, ReturnValue) == 0x000000, "Member 'PantMenu_C_EnableOrangePant::ReturnValue' has a wrong offset!");
static_assert(offsetof(PantMenu_C_EnableOrangePant, CallFunc_GetPlayerState_ReturnValue) == 0x000008, "Member 'PantMenu_C_EnableOrangePant::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(PantMenu_C_EnableOrangePant, K2Node_DynamicCast_AsPlayer_State_BP) == 0x000010, "Member 'PantMenu_C_EnableOrangePant::K2Node_DynamicCast_AsPlayer_State_BP' has a wrong offset!");
static_assert(offsetof(PantMenu_C_EnableOrangePant, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PantMenu_C_EnableOrangePant::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PantMenu_C_EnableOrangePant, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000019, "Member 'PantMenu_C_EnableOrangePant::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function PantMenu.PantMenu_C.EnableGreenPant
// 0x0020 (0x0020 - 0x0000)
struct PantMenu_C_EnableGreenPant final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PantMenu_C_EnableGreenPant) == 0x000008, "Wrong alignment on PantMenu_C_EnableGreenPant");
static_assert(sizeof(PantMenu_C_EnableGreenPant) == 0x000020, "Wrong size on PantMenu_C_EnableGreenPant");
static_assert(offsetof(PantMenu_C_EnableGreenPant, ReturnValue) == 0x000000, "Member 'PantMenu_C_EnableGreenPant::ReturnValue' has a wrong offset!");
static_assert(offsetof(PantMenu_C_EnableGreenPant, CallFunc_GetPlayerState_ReturnValue) == 0x000008, "Member 'PantMenu_C_EnableGreenPant::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(PantMenu_C_EnableGreenPant, K2Node_DynamicCast_AsPlayer_State_BP) == 0x000010, "Member 'PantMenu_C_EnableGreenPant::K2Node_DynamicCast_AsPlayer_State_BP' has a wrong offset!");
static_assert(offsetof(PantMenu_C_EnableGreenPant, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PantMenu_C_EnableGreenPant::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PantMenu_C_EnableGreenPant, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000019, "Member 'PantMenu_C_EnableGreenPant::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function PantMenu.PantMenu_C.EnableDefault
// 0x0020 (0x0020 - 0x0000)
struct PantMenu_C_EnableDefault final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PantMenu_C_EnableDefault) == 0x000008, "Wrong alignment on PantMenu_C_EnableDefault");
static_assert(sizeof(PantMenu_C_EnableDefault) == 0x000020, "Wrong size on PantMenu_C_EnableDefault");
static_assert(offsetof(PantMenu_C_EnableDefault, ReturnValue) == 0x000000, "Member 'PantMenu_C_EnableDefault::ReturnValue' has a wrong offset!");
static_assert(offsetof(PantMenu_C_EnableDefault, CallFunc_GetPlayerState_ReturnValue) == 0x000008, "Member 'PantMenu_C_EnableDefault::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(PantMenu_C_EnableDefault, K2Node_DynamicCast_AsPlayer_State_BP) == 0x000010, "Member 'PantMenu_C_EnableDefault::K2Node_DynamicCast_AsPlayer_State_BP' has a wrong offset!");
static_assert(offsetof(PantMenu_C_EnableDefault, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PantMenu_C_EnableDefault::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PantMenu_C_EnableDefault, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000019, "Member 'PantMenu_C_EnableDefault::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function PantMenu.PantMenu_C.EnableBluePant
// 0x0020 (0x0020 - 0x0000)
struct PantMenu_C_EnableBluePant final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PantMenu_C_EnableBluePant) == 0x000008, "Wrong alignment on PantMenu_C_EnableBluePant");
static_assert(sizeof(PantMenu_C_EnableBluePant) == 0x000020, "Wrong size on PantMenu_C_EnableBluePant");
static_assert(offsetof(PantMenu_C_EnableBluePant, ReturnValue) == 0x000000, "Member 'PantMenu_C_EnableBluePant::ReturnValue' has a wrong offset!");
static_assert(offsetof(PantMenu_C_EnableBluePant, CallFunc_GetPlayerState_ReturnValue) == 0x000008, "Member 'PantMenu_C_EnableBluePant::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(PantMenu_C_EnableBluePant, K2Node_DynamicCast_AsPlayer_State_BP) == 0x000010, "Member 'PantMenu_C_EnableBluePant::K2Node_DynamicCast_AsPlayer_State_BP' has a wrong offset!");
static_assert(offsetof(PantMenu_C_EnableBluePant, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PantMenu_C_EnableBluePant::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PantMenu_C_EnableBluePant, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000019, "Member 'PantMenu_C_EnableBluePant::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function PantMenu.PantMenu_C.EnableBlack
// 0x0020 (0x0020 - 0x0000)
struct PantMenu_C_EnableBlack final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PantMenu_C_EnableBlack) == 0x000008, "Wrong alignment on PantMenu_C_EnableBlack");
static_assert(sizeof(PantMenu_C_EnableBlack) == 0x000020, "Wrong size on PantMenu_C_EnableBlack");
static_assert(offsetof(PantMenu_C_EnableBlack, ReturnValue) == 0x000000, "Member 'PantMenu_C_EnableBlack::ReturnValue' has a wrong offset!");
static_assert(offsetof(PantMenu_C_EnableBlack, CallFunc_GetPlayerState_ReturnValue) == 0x000008, "Member 'PantMenu_C_EnableBlack::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(PantMenu_C_EnableBlack, K2Node_DynamicCast_AsPlayer_State_BP) == 0x000010, "Member 'PantMenu_C_EnableBlack::K2Node_DynamicCast_AsPlayer_State_BP' has a wrong offset!");
static_assert(offsetof(PantMenu_C_EnableBlack, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PantMenu_C_EnableBlack::K2Node_DynamicCast_bSuccess' has a wrong offset!");
