#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerStateBP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PlayerStateBP.PlayerStateBP_C.VoteUpdate
// 0x0008 (0x0008 - 0x0000)
struct PlayerStateBP_C_VoteUpdate final
{
public:
	int32                                         Ay_0;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Ny_0;                                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerStateBP_C_VoteUpdate) == 0x000004, "Wrong alignment on PlayerStateBP_C_VoteUpdate");
static_assert(sizeof(PlayerStateBP_C_VoteUpdate) == 0x000008, "Wrong size on PlayerStateBP_C_VoteUpdate");
static_assert(offsetof(PlayerStateBP_C_VoteUpdate, Ay_0) == 0x000000, "Member 'PlayerStateBP_C_VoteUpdate::Ay_0' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_VoteUpdate, Ny_0) == 0x000004, "Member 'PlayerStateBP_C_VoteUpdate::Ny_0' has a wrong offset!");

// Function PlayerStateBP.PlayerStateBP_C.Vote Update Server
// 0x0008 (0x0008 - 0x0000)
struct PlayerStateBP_C_Vote_Update_Server final
{
public:
	int32                                         Ay_0;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Ny_0;                                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerStateBP_C_Vote_Update_Server) == 0x000004, "Wrong alignment on PlayerStateBP_C_Vote_Update_Server");
static_assert(sizeof(PlayerStateBP_C_Vote_Update_Server) == 0x000008, "Wrong size on PlayerStateBP_C_Vote_Update_Server");
static_assert(offsetof(PlayerStateBP_C_Vote_Update_Server, Ay_0) == 0x000000, "Member 'PlayerStateBP_C_Vote_Update_Server::Ay_0' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_Vote_Update_Server, Ny_0) == 0x000004, "Member 'PlayerStateBP_C_Vote_Update_Server::Ny_0' has a wrong offset!");

// Function PlayerStateBP.PlayerStateBP_C.Vote Update Client
// 0x0008 (0x0008 - 0x0000)
struct PlayerStateBP_C_Vote_Update_Client final
{
public:
	int32                                         Ay_0;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Ny_0;                                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerStateBP_C_Vote_Update_Client) == 0x000004, "Wrong alignment on PlayerStateBP_C_Vote_Update_Client");
static_assert(sizeof(PlayerStateBP_C_Vote_Update_Client) == 0x000008, "Wrong size on PlayerStateBP_C_Vote_Update_Client");
static_assert(offsetof(PlayerStateBP_C_Vote_Update_Client, Ay_0) == 0x000000, "Member 'PlayerStateBP_C_Vote_Update_Client::Ay_0' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_Vote_Update_Client, Ny_0) == 0x000004, "Member 'PlayerStateBP_C_Vote_Update_Client::Ny_0' has a wrong offset!");

// Function PlayerStateBP.PlayerStateBP_C.Tell us fella
// 0x0008 (0x0008 - 0x0000)
struct PlayerStateBP_C_Tell_us_fella final
{
public:
	class ATrainGusPlayer_C*                      Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerStateBP_C_Tell_us_fella) == 0x000008, "Wrong alignment on PlayerStateBP_C_Tell_us_fella");
static_assert(sizeof(PlayerStateBP_C_Tell_us_fella) == 0x000008, "Wrong size on PlayerStateBP_C_Tell_us_fella");
static_assert(offsetof(PlayerStateBP_C_Tell_us_fella, Pawn) == 0x000000, "Member 'PlayerStateBP_C_Tell_us_fella::Pawn' has a wrong offset!");

// Function PlayerStateBP.PlayerStateBP_C.Sound Bo Bound Client
// 0x0010 (0x0010 - 0x0000)
struct PlayerStateBP_C_Sound_Bo_Bound_Client final
{
public:
	int32                                         Sound_Number;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Spawner;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerStateBP_C_Sound_Bo_Bound_Client) == 0x000008, "Wrong alignment on PlayerStateBP_C_Sound_Bo_Bound_Client");
static_assert(sizeof(PlayerStateBP_C_Sound_Bo_Bound_Client) == 0x000010, "Wrong size on PlayerStateBP_C_Sound_Bo_Bound_Client");
static_assert(offsetof(PlayerStateBP_C_Sound_Bo_Bound_Client, Sound_Number) == 0x000000, "Member 'PlayerStateBP_C_Sound_Bo_Bound_Client::Sound_Number' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_Sound_Bo_Bound_Client, Spawner) == 0x000008, "Member 'PlayerStateBP_C_Sound_Bo_Bound_Client::Spawner' has a wrong offset!");

// Function PlayerStateBP.PlayerStateBP_C.Sound Bo Bound
// 0x0010 (0x0010 - 0x0000)
struct PlayerStateBP_C_Sound_Bo_Bound final
{
public:
	int32                                         Sound_Number;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Spawner;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerStateBP_C_Sound_Bo_Bound) == 0x000008, "Wrong alignment on PlayerStateBP_C_Sound_Bo_Bound");
static_assert(sizeof(PlayerStateBP_C_Sound_Bo_Bound) == 0x000010, "Wrong size on PlayerStateBP_C_Sound_Bo_Bound");
static_assert(offsetof(PlayerStateBP_C_Sound_Bo_Bound, Sound_Number) == 0x000000, "Member 'PlayerStateBP_C_Sound_Bo_Bound::Sound_Number' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_Sound_Bo_Bound, Spawner) == 0x000008, "Member 'PlayerStateBP_C_Sound_Bo_Bound::Spawner' has a wrong offset!");

// Function PlayerStateBP.PlayerStateBP_C.SomeoneVoted
// 0x0028 (0x0028 - 0x0000)
struct PlayerStateBP_C_SomeoneVoted final
{
public:
	class FText                                   PersonWhoVoted;                                    // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          TheirVote;                                         // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateBP_C*                       Player_State;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerStateBP_C_SomeoneVoted) == 0x000008, "Wrong alignment on PlayerStateBP_C_SomeoneVoted");
static_assert(sizeof(PlayerStateBP_C_SomeoneVoted) == 0x000028, "Wrong size on PlayerStateBP_C_SomeoneVoted");
static_assert(offsetof(PlayerStateBP_C_SomeoneVoted, PersonWhoVoted) == 0x000000, "Member 'PlayerStateBP_C_SomeoneVoted::PersonWhoVoted' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_SomeoneVoted, TheirVote) == 0x000018, "Member 'PlayerStateBP_C_SomeoneVoted::TheirVote' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_SomeoneVoted, Player_State) == 0x000020, "Member 'PlayerStateBP_C_SomeoneVoted::Player_State' has a wrong offset!");

// Function PlayerStateBP.PlayerStateBP_C.Server Change Dom
// 0x0010 (0x0010 - 0x0000)
struct PlayerStateBP_C_Server_Change_Dom final
{
public:
	class APlayerState*                           Killer_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           Me;                                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerStateBP_C_Server_Change_Dom) == 0x000008, "Wrong alignment on PlayerStateBP_C_Server_Change_Dom");
static_assert(sizeof(PlayerStateBP_C_Server_Change_Dom) == 0x000010, "Wrong size on PlayerStateBP_C_Server_Change_Dom");
static_assert(offsetof(PlayerStateBP_C_Server_Change_Dom, Killer_0) == 0x000000, "Member 'PlayerStateBP_C_Server_Change_Dom::Killer_0' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_Server_Change_Dom, Me) == 0x000008, "Member 'PlayerStateBP_C_Server_Change_Dom::Me' has a wrong offset!");

// Function PlayerStateBP.PlayerStateBP_C.Return the vote info server
// 0x0008 (0x0008 - 0x0000)
struct PlayerStateBP_C_Return_the_vote_info_server final
{
public:
	int32                                         Counter_0;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Ongoing_vote_;                                     // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerStateBP_C_Return_the_vote_info_server) == 0x000004, "Wrong alignment on PlayerStateBP_C_Return_the_vote_info_server");
static_assert(sizeof(PlayerStateBP_C_Return_the_vote_info_server) == 0x000008, "Wrong size on PlayerStateBP_C_Return_the_vote_info_server");
static_assert(offsetof(PlayerStateBP_C_Return_the_vote_info_server, Counter_0) == 0x000000, "Member 'PlayerStateBP_C_Return_the_vote_info_server::Counter_0' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_Return_the_vote_info_server, Ongoing_vote_) == 0x000004, "Member 'PlayerStateBP_C_Return_the_vote_info_server::Ongoing_vote_' has a wrong offset!");

// Function PlayerStateBP.PlayerStateBP_C.Return the vote info
// 0x0008 (0x0008 - 0x0000)
struct PlayerStateBP_C_Return_the_vote_info final
{
public:
	int32                                         Counter_0;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Ongoing_vote_;                                     // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerStateBP_C_Return_the_vote_info) == 0x000004, "Wrong alignment on PlayerStateBP_C_Return_the_vote_info");
static_assert(sizeof(PlayerStateBP_C_Return_the_vote_info) == 0x000008, "Wrong size on PlayerStateBP_C_Return_the_vote_info");
static_assert(offsetof(PlayerStateBP_C_Return_the_vote_info, Counter_0) == 0x000000, "Member 'PlayerStateBP_C_Return_the_vote_info::Counter_0' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_Return_the_vote_info, Ongoing_vote_) == 0x000004, "Member 'PlayerStateBP_C_Return_the_vote_info::Ongoing_vote_' has a wrong offset!");

// Function PlayerStateBP.PlayerStateBP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct PlayerStateBP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerStateBP_C_ReceiveTick) == 0x000004, "Wrong alignment on PlayerStateBP_C_ReceiveTick");
static_assert(sizeof(PlayerStateBP_C_ReceiveTick) == 0x000004, "Wrong size on PlayerStateBP_C_ReceiveTick");
static_assert(offsetof(PlayerStateBP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'PlayerStateBP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function PlayerStateBP.PlayerStateBP_C.Player Logged on
// 0x0028 (0x0028 - 0x0000)
struct PlayerStateBP_C_Player_Logged_on final
{
public:
	int32                                         Title_Number_0;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HatNumber_0;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Skin_Number_0;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Weapon_1_0;                                        // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Weapon_2_0;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Pant;                                              // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerStateBP_C_Player_Logged_on) == 0x000008, "Wrong alignment on PlayerStateBP_C_Player_Logged_on");
static_assert(sizeof(PlayerStateBP_C_Player_Logged_on) == 0x000028, "Wrong size on PlayerStateBP_C_Player_Logged_on");
static_assert(offsetof(PlayerStateBP_C_Player_Logged_on, Title_Number_0) == 0x000000, "Member 'PlayerStateBP_C_Player_Logged_on::Title_Number_0' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_Player_Logged_on, HatNumber_0) == 0x000004, "Member 'PlayerStateBP_C_Player_Logged_on::HatNumber_0' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_Player_Logged_on, Skin_Number_0) == 0x000008, "Member 'PlayerStateBP_C_Player_Logged_on::Skin_Number_0' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_Player_Logged_on, Weapon_1_0) == 0x00000C, "Member 'PlayerStateBP_C_Player_Logged_on::Weapon_1_0' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_Player_Logged_on, Weapon_2_0) == 0x000010, "Member 'PlayerStateBP_C_Player_Logged_on::Weapon_2_0' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_Player_Logged_on, Pant) == 0x000018, "Member 'PlayerStateBP_C_Player_Logged_on::Pant' has a wrong offset!");

// Function PlayerStateBP.PlayerStateBP_C.OnSuccess_B7F14CEF49C198C07A8662A19BE661C1
// 0x0010 (0x0010 - 0x0000)
struct PlayerStateBP_C_OnSuccess_B7F14CEF49C198C07A8662A19BE661C1 final
{
public:
	class FName                                   WrittenAchievementName;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WrittenProgress;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WrittenUserTag;                                    // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerStateBP_C_OnSuccess_B7F14CEF49C198C07A8662A19BE661C1) == 0x000004, "Wrong alignment on PlayerStateBP_C_OnSuccess_B7F14CEF49C198C07A8662A19BE661C1");
static_assert(sizeof(PlayerStateBP_C_OnSuccess_B7F14CEF49C198C07A8662A19BE661C1) == 0x000010, "Wrong size on PlayerStateBP_C_OnSuccess_B7F14CEF49C198C07A8662A19BE661C1");
static_assert(offsetof(PlayerStateBP_C_OnSuccess_B7F14CEF49C198C07A8662A19BE661C1, WrittenAchievementName) == 0x000000, "Member 'PlayerStateBP_C_OnSuccess_B7F14CEF49C198C07A8662A19BE661C1::WrittenAchievementName' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_OnSuccess_B7F14CEF49C198C07A8662A19BE661C1, WrittenProgress) == 0x000008, "Member 'PlayerStateBP_C_OnSuccess_B7F14CEF49C198C07A8662A19BE661C1::WrittenProgress' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_OnSuccess_B7F14CEF49C198C07A8662A19BE661C1, WrittenUserTag) == 0x00000C, "Member 'PlayerStateBP_C_OnSuccess_B7F14CEF49C198C07A8662A19BE661C1::WrittenUserTag' has a wrong offset!");

// Function PlayerStateBP.PlayerStateBP_C.OnSuccess_6DA32DB04B670646094AF1826A1C9B45
// 0x0010 (0x0010 - 0x0000)
struct PlayerStateBP_C_OnSuccess_6DA32DB04B670646094AF1826A1C9B45 final
{
public:
	class FName                                   WrittenAchievementName;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WrittenProgress;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WrittenUserTag;                                    // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerStateBP_C_OnSuccess_6DA32DB04B670646094AF1826A1C9B45) == 0x000004, "Wrong alignment on PlayerStateBP_C_OnSuccess_6DA32DB04B670646094AF1826A1C9B45");
static_assert(sizeof(PlayerStateBP_C_OnSuccess_6DA32DB04B670646094AF1826A1C9B45) == 0x000010, "Wrong size on PlayerStateBP_C_OnSuccess_6DA32DB04B670646094AF1826A1C9B45");
static_assert(offsetof(PlayerStateBP_C_OnSuccess_6DA32DB04B670646094AF1826A1C9B45, WrittenAchievementName) == 0x000000, "Member 'PlayerStateBP_C_OnSuccess_6DA32DB04B670646094AF1826A1C9B45::WrittenAchievementName' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_OnSuccess_6DA32DB04B670646094AF1826A1C9B45, WrittenProgress) == 0x000008, "Member 'PlayerStateBP_C_OnSuccess_6DA32DB04B670646094AF1826A1C9B45::WrittenProgress' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_OnSuccess_6DA32DB04B670646094AF1826A1C9B45, WrittenUserTag) == 0x00000C, "Member 'PlayerStateBP_C_OnSuccess_6DA32DB04B670646094AF1826A1C9B45::WrittenUserTag' has a wrong offset!");

// Function PlayerStateBP.PlayerStateBP_C.OnSuccess_3809042940C9A278288688A21E93631C
// 0x0010 (0x0010 - 0x0000)
struct PlayerStateBP_C_OnSuccess_3809042940C9A278288688A21E93631C final
{
public:
	class FName                                   WrittenAchievementName;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WrittenProgress;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WrittenUserTag;                                    // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerStateBP_C_OnSuccess_3809042940C9A278288688A21E93631C) == 0x000004, "Wrong alignment on PlayerStateBP_C_OnSuccess_3809042940C9A278288688A21E93631C");
static_assert(sizeof(PlayerStateBP_C_OnSuccess_3809042940C9A278288688A21E93631C) == 0x000010, "Wrong size on PlayerStateBP_C_OnSuccess_3809042940C9A278288688A21E93631C");
static_assert(offsetof(PlayerStateBP_C_OnSuccess_3809042940C9A278288688A21E93631C, WrittenAchievementName) == 0x000000, "Member 'PlayerStateBP_C_OnSuccess_3809042940C9A278288688A21E93631C::WrittenAchievementName' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_OnSuccess_3809042940C9A278288688A21E93631C, WrittenProgress) == 0x000008, "Member 'PlayerStateBP_C_OnSuccess_3809042940C9A278288688A21E93631C::WrittenProgress' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_OnSuccess_3809042940C9A278288688A21E93631C, WrittenUserTag) == 0x00000C, "Member 'PlayerStateBP_C_OnSuccess_3809042940C9A278288688A21E93631C::WrittenUserTag' has a wrong offset!");

// Function PlayerStateBP.PlayerStateBP_C.OnSuccess_364A0E194677C706731295BCC6A3C1C7
// 0x0010 (0x0010 - 0x0000)
struct PlayerStateBP_C_OnSuccess_364A0E194677C706731295BCC6A3C1C7 final
{
public:
	class FName                                   WrittenAchievementName;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WrittenProgress;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WrittenUserTag;                                    // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerStateBP_C_OnSuccess_364A0E194677C706731295BCC6A3C1C7) == 0x000004, "Wrong alignment on PlayerStateBP_C_OnSuccess_364A0E194677C706731295BCC6A3C1C7");
static_assert(sizeof(PlayerStateBP_C_OnSuccess_364A0E194677C706731295BCC6A3C1C7) == 0x000010, "Wrong size on PlayerStateBP_C_OnSuccess_364A0E194677C706731295BCC6A3C1C7");
static_assert(offsetof(PlayerStateBP_C_OnSuccess_364A0E194677C706731295BCC6A3C1C7, WrittenAchievementName) == 0x000000, "Member 'PlayerStateBP_C_OnSuccess_364A0E194677C706731295BCC6A3C1C7::WrittenAchievementName' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_OnSuccess_364A0E194677C706731295BCC6A3C1C7, WrittenProgress) == 0x000008, "Member 'PlayerStateBP_C_OnSuccess_364A0E194677C706731295BCC6A3C1C7::WrittenProgress' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_OnSuccess_364A0E194677C706731295BCC6A3C1C7, WrittenUserTag) == 0x00000C, "Member 'PlayerStateBP_C_OnSuccess_364A0E194677C706731295BCC6A3C1C7::WrittenUserTag' has a wrong offset!");

// Function PlayerStateBP.PlayerStateBP_C.OnFailure_B7F14CEF49C198C07A8662A19BE661C1
// 0x0010 (0x0010 - 0x0000)
struct PlayerStateBP_C_OnFailure_B7F14CEF49C198C07A8662A19BE661C1 final
{
public:
	class FName                                   WrittenAchievementName;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WrittenProgress;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WrittenUserTag;                                    // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerStateBP_C_OnFailure_B7F14CEF49C198C07A8662A19BE661C1) == 0x000004, "Wrong alignment on PlayerStateBP_C_OnFailure_B7F14CEF49C198C07A8662A19BE661C1");
static_assert(sizeof(PlayerStateBP_C_OnFailure_B7F14CEF49C198C07A8662A19BE661C1) == 0x000010, "Wrong size on PlayerStateBP_C_OnFailure_B7F14CEF49C198C07A8662A19BE661C1");
static_assert(offsetof(PlayerStateBP_C_OnFailure_B7F14CEF49C198C07A8662A19BE661C1, WrittenAchievementName) == 0x000000, "Member 'PlayerStateBP_C_OnFailure_B7F14CEF49C198C07A8662A19BE661C1::WrittenAchievementName' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_OnFailure_B7F14CEF49C198C07A8662A19BE661C1, WrittenProgress) == 0x000008, "Member 'PlayerStateBP_C_OnFailure_B7F14CEF49C198C07A8662A19BE661C1::WrittenProgress' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_OnFailure_B7F14CEF49C198C07A8662A19BE661C1, WrittenUserTag) == 0x00000C, "Member 'PlayerStateBP_C_OnFailure_B7F14CEF49C198C07A8662A19BE661C1::WrittenUserTag' has a wrong offset!");

// Function PlayerStateBP.PlayerStateBP_C.OnFailure_6DA32DB04B670646094AF1826A1C9B45
// 0x0010 (0x0010 - 0x0000)
struct PlayerStateBP_C_OnFailure_6DA32DB04B670646094AF1826A1C9B45 final
{
public:
	class FName                                   WrittenAchievementName;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WrittenProgress;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WrittenUserTag;                                    // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerStateBP_C_OnFailure_6DA32DB04B670646094AF1826A1C9B45) == 0x000004, "Wrong alignment on PlayerStateBP_C_OnFailure_6DA32DB04B670646094AF1826A1C9B45");
static_assert(sizeof(PlayerStateBP_C_OnFailure_6DA32DB04B670646094AF1826A1C9B45) == 0x000010, "Wrong size on PlayerStateBP_C_OnFailure_6DA32DB04B670646094AF1826A1C9B45");
static_assert(offsetof(PlayerStateBP_C_OnFailure_6DA32DB04B670646094AF1826A1C9B45, WrittenAchievementName) == 0x000000, "Member 'PlayerStateBP_C_OnFailure_6DA32DB04B670646094AF1826A1C9B45::WrittenAchievementName' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_OnFailure_6DA32DB04B670646094AF1826A1C9B45, WrittenProgress) == 0x000008, "Member 'PlayerStateBP_C_OnFailure_6DA32DB04B670646094AF1826A1C9B45::WrittenProgress' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_OnFailure_6DA32DB04B670646094AF1826A1C9B45, WrittenUserTag) == 0x00000C, "Member 'PlayerStateBP_C_OnFailure_6DA32DB04B670646094AF1826A1C9B45::WrittenUserTag' has a wrong offset!");

// Function PlayerStateBP.PlayerStateBP_C.OnFailure_3809042940C9A278288688A21E93631C
// 0x0010 (0x0010 - 0x0000)
struct PlayerStateBP_C_OnFailure_3809042940C9A278288688A21E93631C final
{
public:
	class FName                                   WrittenAchievementName;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WrittenProgress;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WrittenUserTag;                                    // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerStateBP_C_OnFailure_3809042940C9A278288688A21E93631C) == 0x000004, "Wrong alignment on PlayerStateBP_C_OnFailure_3809042940C9A278288688A21E93631C");
static_assert(sizeof(PlayerStateBP_C_OnFailure_3809042940C9A278288688A21E93631C) == 0x000010, "Wrong size on PlayerStateBP_C_OnFailure_3809042940C9A278288688A21E93631C");
static_assert(offsetof(PlayerStateBP_C_OnFailure_3809042940C9A278288688A21E93631C, WrittenAchievementName) == 0x000000, "Member 'PlayerStateBP_C_OnFailure_3809042940C9A278288688A21E93631C::WrittenAchievementName' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_OnFailure_3809042940C9A278288688A21E93631C, WrittenProgress) == 0x000008, "Member 'PlayerStateBP_C_OnFailure_3809042940C9A278288688A21E93631C::WrittenProgress' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_OnFailure_3809042940C9A278288688A21E93631C, WrittenUserTag) == 0x00000C, "Member 'PlayerStateBP_C_OnFailure_3809042940C9A278288688A21E93631C::WrittenUserTag' has a wrong offset!");

// Function PlayerStateBP.PlayerStateBP_C.OnFailure_364A0E194677C706731295BCC6A3C1C7
// 0x0010 (0x0010 - 0x0000)
struct PlayerStateBP_C_OnFailure_364A0E194677C706731295BCC6A3C1C7 final
{
public:
	class FName                                   WrittenAchievementName;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WrittenProgress;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WrittenUserTag;                                    // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerStateBP_C_OnFailure_364A0E194677C706731295BCC6A3C1C7) == 0x000004, "Wrong alignment on PlayerStateBP_C_OnFailure_364A0E194677C706731295BCC6A3C1C7");
static_assert(sizeof(PlayerStateBP_C_OnFailure_364A0E194677C706731295BCC6A3C1C7) == 0x000010, "Wrong size on PlayerStateBP_C_OnFailure_364A0E194677C706731295BCC6A3C1C7");
static_assert(offsetof(PlayerStateBP_C_OnFailure_364A0E194677C706731295BCC6A3C1C7, WrittenAchievementName) == 0x000000, "Member 'PlayerStateBP_C_OnFailure_364A0E194677C706731295BCC6A3C1C7::WrittenAchievementName' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_OnFailure_364A0E194677C706731295BCC6A3C1C7, WrittenProgress) == 0x000008, "Member 'PlayerStateBP_C_OnFailure_364A0E194677C706731295BCC6A3C1C7::WrittenProgress' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_OnFailure_364A0E194677C706731295BCC6A3C1C7, WrittenUserTag) == 0x00000C, "Member 'PlayerStateBP_C_OnFailure_364A0E194677C706731295BCC6A3C1C7::WrittenUserTag' has a wrong offset!");

// Function PlayerStateBP.PlayerStateBP_C.Message To Send
// 0x0030 (0x0030 - 0x0000)
struct PlayerStateBP_C_Message_To_Send final
{
public:
	class APlayerState*                           Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 Param_Name_0;                                      // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerStateBP_C_Message_To_Send) == 0x000008, "Wrong alignment on PlayerStateBP_C_Message_To_Send");
static_assert(sizeof(PlayerStateBP_C_Message_To_Send) == 0x000030, "Wrong size on PlayerStateBP_C_Message_To_Send");
static_assert(offsetof(PlayerStateBP_C_Message_To_Send, Player) == 0x000000, "Member 'PlayerStateBP_C_Message_To_Send::Player' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_Message_To_Send, Text) == 0x000008, "Member 'PlayerStateBP_C_Message_To_Send::Text' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_Message_To_Send, Param_Name_0) == 0x000020, "Member 'PlayerStateBP_C_Message_To_Send::Param_Name_0' has a wrong offset!");

// Function PlayerStateBP.PlayerStateBP_C.Locateinator
// 0x0018 (0x0018 - 0x0000)
struct PlayerStateBP_C_Locateinator final
{
public:
	struct FVector                                Spawn_Transform_Location;                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerStateBP_C_Locateinator) == 0x000008, "Wrong alignment on PlayerStateBP_C_Locateinator");
static_assert(sizeof(PlayerStateBP_C_Locateinator) == 0x000018, "Wrong size on PlayerStateBP_C_Locateinator");
static_assert(offsetof(PlayerStateBP_C_Locateinator, Spawn_Transform_Location) == 0x000000, "Member 'PlayerStateBP_C_Locateinator::Spawn_Transform_Location' has a wrong offset!");

// Function PlayerStateBP.PlayerStateBP_C.Kickfart server
// 0x0048 (0x0048 - 0x0000)
struct PlayerStateBP_C_Kickfart_server final
{
public:
	class FString                                 PlayerName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Kick_;                                             // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   ThoseWhoKnow;                                      // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(PlayerStateBP_C_Kickfart_server) == 0x000008, "Wrong alignment on PlayerStateBP_C_Kickfart_server");
static_assert(sizeof(PlayerStateBP_C_Kickfart_server) == 0x000048, "Wrong size on PlayerStateBP_C_Kickfart_server");
static_assert(offsetof(PlayerStateBP_C_Kickfart_server, PlayerName) == 0x000000, "Member 'PlayerStateBP_C_Kickfart_server::PlayerName' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_Kickfart_server, Kick_) == 0x000010, "Member 'PlayerStateBP_C_Kickfart_server::Kick_' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_Kickfart_server, Text) == 0x000018, "Member 'PlayerStateBP_C_Kickfart_server::Text' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_Kickfart_server, ThoseWhoKnow) == 0x000030, "Member 'PlayerStateBP_C_Kickfart_server::ThoseWhoKnow' has a wrong offset!");

// Function PlayerStateBP.PlayerStateBP_C.Kickfart brian
// 0x0030 (0x0030 - 0x0000)
struct PlayerStateBP_C_Kickfart_brian final
{
public:
	class FString                                 PlayerName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Kick_;                                             // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(PlayerStateBP_C_Kickfart_brian) == 0x000008, "Wrong alignment on PlayerStateBP_C_Kickfart_brian");
static_assert(sizeof(PlayerStateBP_C_Kickfart_brian) == 0x000030, "Wrong size on PlayerStateBP_C_Kickfart_brian");
static_assert(offsetof(PlayerStateBP_C_Kickfart_brian, PlayerName) == 0x000000, "Member 'PlayerStateBP_C_Kickfart_brian::PlayerName' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_Kickfart_brian, Kick_) == 0x000010, "Member 'PlayerStateBP_C_Kickfart_brian::Kick_' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_Kickfart_brian, Text) == 0x000018, "Member 'PlayerStateBP_C_Kickfart_brian::Text' has a wrong offset!");

// Function PlayerStateBP.PlayerStateBP_C.Kickfart
// 0x0048 (0x0048 - 0x0000)
struct PlayerStateBP_C_Kickfart final
{
public:
	class FString                                 PlayerName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Kick_;                                             // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   ThoseWhoKnow;                                      // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(PlayerStateBP_C_Kickfart) == 0x000008, "Wrong alignment on PlayerStateBP_C_Kickfart");
static_assert(sizeof(PlayerStateBP_C_Kickfart) == 0x000048, "Wrong size on PlayerStateBP_C_Kickfart");
static_assert(offsetof(PlayerStateBP_C_Kickfart, PlayerName) == 0x000000, "Member 'PlayerStateBP_C_Kickfart::PlayerName' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_Kickfart, Kick_) == 0x000010, "Member 'PlayerStateBP_C_Kickfart::Kick_' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_Kickfart, Text) == 0x000018, "Member 'PlayerStateBP_C_Kickfart::Text' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_Kickfart, ThoseWhoKnow) == 0x000030, "Member 'PlayerStateBP_C_Kickfart::ThoseWhoKnow' has a wrong offset!");

// Function PlayerStateBP.PlayerStateBP_C.Just Possesed Pawn
// 0x0008 (0x0008 - 0x0000)
struct PlayerStateBP_C_Just_Possesed_Pawn final
{
public:
	class APawn*                                  Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerStateBP_C_Just_Possesed_Pawn) == 0x000008, "Wrong alignment on PlayerStateBP_C_Just_Possesed_Pawn");
static_assert(sizeof(PlayerStateBP_C_Just_Possesed_Pawn) == 0x000008, "Wrong size on PlayerStateBP_C_Just_Possesed_Pawn");
static_assert(offsetof(PlayerStateBP_C_Just_Possesed_Pawn, Pawn) == 0x000000, "Member 'PlayerStateBP_C_Just_Possesed_Pawn::Pawn' has a wrong offset!");

// Function PlayerStateBP.PlayerStateBP_C.I voted Server
// 0x0010 (0x0010 - 0x0000)
struct PlayerStateBP_C_I_voted_Server final
{
public:
	bool                                          TheirVote;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateBP_C*                       Player_State;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerStateBP_C_I_voted_Server) == 0x000008, "Wrong alignment on PlayerStateBP_C_I_voted_Server");
static_assert(sizeof(PlayerStateBP_C_I_voted_Server) == 0x000010, "Wrong size on PlayerStateBP_C_I_voted_Server");
static_assert(offsetof(PlayerStateBP_C_I_voted_Server, TheirVote) == 0x000000, "Member 'PlayerStateBP_C_I_voted_Server::TheirVote' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_I_voted_Server, Player_State) == 0x000008, "Member 'PlayerStateBP_C_I_voted_Server::Player_State' has a wrong offset!");

// Function PlayerStateBP.PlayerStateBP_C.I voted
// 0x0010 (0x0010 - 0x0000)
struct PlayerStateBP_C_I_voted final
{
public:
	class APlayerStateBP_C*                       Player_State;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TheirVote;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerStateBP_C_I_voted) == 0x000008, "Wrong alignment on PlayerStateBP_C_I_voted");
static_assert(sizeof(PlayerStateBP_C_I_voted) == 0x000010, "Wrong size on PlayerStateBP_C_I_voted");
static_assert(offsetof(PlayerStateBP_C_I_voted, Player_State) == 0x000000, "Member 'PlayerStateBP_C_I_voted::Player_State' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_I_voted, TheirVote) == 0x000008, "Member 'PlayerStateBP_C_I_voted::TheirVote' has a wrong offset!");

// Function PlayerStateBP.PlayerStateBP_C.I just Perished Someone Player State
// 0x0008 (0x0008 - 0x0000)
struct PlayerStateBP_C_I_just_Perished_Someone_Player_State final
{
public:
	class APlayerState*                           Victim_Player_State;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerStateBP_C_I_just_Perished_Someone_Player_State) == 0x000008, "Wrong alignment on PlayerStateBP_C_I_just_Perished_Someone_Player_State");
static_assert(sizeof(PlayerStateBP_C_I_just_Perished_Someone_Player_State) == 0x000008, "Wrong size on PlayerStateBP_C_I_just_Perished_Someone_Player_State");
static_assert(offsetof(PlayerStateBP_C_I_just_Perished_Someone_Player_State, Victim_Player_State) == 0x000000, "Member 'PlayerStateBP_C_I_just_Perished_Someone_Player_State::Victim_Player_State' has a wrong offset!");

// Function PlayerStateBP.PlayerStateBP_C.Give Killer Kill Confirm
// 0x0030 (0x0030 - 0x0000)
struct PlayerStateBP_C_Give_Killer_Kill_Confirm final
{
public:
	class APlayerState*                           Victim_Player_State;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      OwningPlayer;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Team_0;                                            // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Killed_player;                                     // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(PlayerStateBP_C_Give_Killer_Kill_Confirm) == 0x000008, "Wrong alignment on PlayerStateBP_C_Give_Killer_Kill_Confirm");
static_assert(sizeof(PlayerStateBP_C_Give_Killer_Kill_Confirm) == 0x000030, "Wrong size on PlayerStateBP_C_Give_Killer_Kill_Confirm");
static_assert(offsetof(PlayerStateBP_C_Give_Killer_Kill_Confirm, Victim_Player_State) == 0x000000, "Member 'PlayerStateBP_C_Give_Killer_Kill_Confirm::Victim_Player_State' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_Give_Killer_Kill_Confirm, OwningPlayer) == 0x000008, "Member 'PlayerStateBP_C_Give_Killer_Kill_Confirm::OwningPlayer' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_Give_Killer_Kill_Confirm, Team_0) == 0x000010, "Member 'PlayerStateBP_C_Give_Killer_Kill_Confirm::Team_0' has a wrong offset!");
static_assert(offsetof(PlayerStateBP_C_Give_Killer_Kill_Confirm, Killed_player) == 0x000018, "Member 'PlayerStateBP_C_Give_Killer_Kill_Confirm::Killed_player' has a wrong offset!");

// Function PlayerStateBP.PlayerStateBP_C.Get totum
// 0x0018 (0x0018 - 0x0000)
struct PlayerStateBP_C_Get_totum final
{
public:
	struct FVector                                Spawn_Transform_Location;                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerStateBP_C_Get_totum) == 0x000008, "Wrong alignment on PlayerStateBP_C_Get_totum");
static_assert(sizeof(PlayerStateBP_C_Get_totum) == 0x000018, "Wrong size on PlayerStateBP_C_Get_totum");
static_assert(offsetof(PlayerStateBP_C_Get_totum, Spawn_Transform_Location) == 0x000000, "Member 'PlayerStateBP_C_Get_totum::Spawn_Transform_Location' has a wrong offset!");

// Function PlayerStateBP.PlayerStateBP_C.ExecuteUbergraph_PlayerStateBP
// 0x0AC0 (0x0AC0 - 0x0000)
struct PlayerStateBP_C_ExecuteUbergraph_PlayerStateBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATrainGusPlayer_C*                      K2Node_CustomEvent_Pawn;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_WrittenAchievementName_5;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_WrittenProgress_5;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_WrittenUserTag_5;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName WrittenAchievementName, float WrittenProgress, int32 WrittenUserTag)> K2Node_CreateDelegate_OutputDelegate; // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_WrittenAchievementName_4;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_WrittenProgress_4;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_WrittenUserTag_4;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName WrittenAchievementName, float WrittenProgress, int32 WrittenUserTag)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_WrittenAchievementName_3;       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_WrittenProgress_3;              // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_WrittenUserTag_3;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName WrittenAchievementName, float WrittenProgress, int32 WrittenUserTag)> K2Node_CreateDelegate_OutputDelegate_4; // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_WrittenAchievementName_2;       // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_WrittenProgress_2;              // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_WrittenUserTag_2;               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName WrittenAchievementName, float WrittenProgress, int32 WrittenUserTag)> K2Node_CreateDelegate_OutputDelegate_5; // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable_1;                               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UKillConfirm_C*                         CallFunc_Create_ReturnValue;                       // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x00D8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_WrittenAchievementName_1;       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_WrittenProgress_1;              // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_WrittenUserTag_1;               // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName WrittenAchievementName, float WrittenProgress, int32 WrittenUserTag)> K2Node_CreateDelegate_OutputDelegate_8; // 0x0108(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_WrittenAchievementName;         // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_WrittenProgress;                // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_WrittenUserTag;                 // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName WrittenAchievementName, float WrittenProgress, int32 WrittenUserTag)> K2Node_CreateDelegate_OutputDelegate_9; // 0x0128(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable_2;                               // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x017C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_Pawn;                                 // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_PlayerName;                           // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Kick_;                                // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Text;                                 // 0x01C0(0x0018)()
	class FText                                   K2Node_Event_ThoseWhoKnow;                         // 0x01D8(0x0018)()
	class FText                                   K2Node_Event_PersonWhoVoted;                       // 0x01F0(0x0018)()
	bool                                          K2Node_Event_TheirVote;                            // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateBP_C*                       K2Node_Event_Player_State;                         // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Team_1;                         // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           K2Node_CustomEvent_Victim_1;                       // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageType*                      K2Node_CustomEvent_Damage_Type;                    // 0x0228(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Killed_player_2;                // 0x0230(0x0018)()
	class APlayerState*                           K2Node_CustomEvent_Killer_1;                       // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP;              // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0278(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
