#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PowerUpItemDrop_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PowerUpItemDrop_BP.PowerUpItemDrop_BP_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct PowerUpItemDrop_BP_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PowerUpItemDrop_BP_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on PowerUpItemDrop_BP_C_ReceiveActorBeginOverlap");
static_assert(sizeof(PowerUpItemDrop_BP_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on PowerUpItemDrop_BP_C_ReceiveActorBeginOverlap");
static_assert(offsetof(PowerUpItemDrop_BP_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'PowerUpItemDrop_BP_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function PowerUpItemDrop_BP.PowerUpItemDrop_BP_C.ExecuteUbergraph_PowerUpItemDrop_BP
// 0x0238 (0x0238 - 0x0000)
struct PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0008(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F3[0x5];                                       // 0x00F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player;             // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_1;      // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP;              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_1;     // 0x0140(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_1;        // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x022A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x022B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_3;          // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x022D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_4;          // 0x022E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x022F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_5;          // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP) == 0x000008, "Wrong alignment on PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP");
static_assert(sizeof(PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP) == 0x000238, "Wrong size on PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP");
static_assert(offsetof(PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP, EntryPoint) == 0x000000, "Member 'PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000008, "Member 'PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0000F0, "Member 'PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP, Temp_bool_Has_Been_Initd_Variable) == 0x0000F1, "Member 'PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP, Temp_bool_IsClosed_Variable) == 0x0000F2, "Member 'PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP, K2Node_Event_OtherActor) == 0x0000F8, "Member 'PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP, K2Node_DynamicCast_AsTrain_Gus_Player) == 0x000100, "Member 'PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP::K2Node_DynamicCast_AsTrain_Gus_Player' has a wrong offset!");
static_assert(offsetof(PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP, CallFunc_GetObjectClass_ReturnValue) == 0x000110, "Member 'PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000118, "Member 'PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP, CallFunc_EqualEqual_ClassClass_ReturnValue_1) == 0x000119, "Member 'PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP::CallFunc_EqualEqual_ClassClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP, K2Node_DynamicCast_AsPlayer_State_BP) == 0x000120, "Member 'PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP::K2Node_DynamicCast_AsPlayer_State_BP' has a wrong offset!");
static_assert(offsetof(PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP, K2Node_DynamicCast_bSuccess_1) == 0x000128, "Member 'PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000129, "Member 'PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00012A, "Member 'PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP, CallFunc_BooleanOR_ReturnValue) == 0x00012B, "Member 'PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP, CallFunc_GetCurrentLevelName_ReturnValue) == 0x000130, "Member 'PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP, CallFunc_K2_SetActorLocation_SweepHitResult_1) == 0x000140, "Member 'PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP::CallFunc_K2_SetActorLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP, CallFunc_K2_SetActorLocation_ReturnValue_1) == 0x000228, "Member 'PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP::CallFunc_K2_SetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000229, "Member 'PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x00022A, "Member 'PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP, CallFunc_EqualEqual_StrStr_ReturnValue_2) == 0x00022B, "Member 'PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP::CallFunc_EqualEqual_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP, CallFunc_EqualEqual_StrStr_ReturnValue_3) == 0x00022C, "Member 'PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP::CallFunc_EqualEqual_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP, CallFunc_BooleanOR_ReturnValue_1) == 0x00022D, "Member 'PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP, CallFunc_EqualEqual_StrStr_ReturnValue_4) == 0x00022E, "Member 'PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP::CallFunc_EqualEqual_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP, CallFunc_BooleanOR_ReturnValue_2) == 0x00022F, "Member 'PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP, CallFunc_EqualEqual_StrStr_ReturnValue_5) == 0x000230, "Member 'PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP::CallFunc_EqualEqual_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP, CallFunc_BooleanOR_ReturnValue_3) == 0x000231, "Member 'PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP, CallFunc_BooleanOR_ReturnValue_4) == 0x000232, "Member 'PowerUpItemDrop_BP_C_ExecuteUbergraph_PowerUpItemDrop_BP::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");

}

