#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Red_Base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Red_Base.Red_Base_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct Red_Base_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Red_Base_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on Red_Base_C_ReceiveActorBeginOverlap");
static_assert(sizeof(Red_Base_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on Red_Base_C_ReceiveActorBeginOverlap");
static_assert(offsetof(Red_Base_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'Red_Base_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function Red_Base.Red_Base_C.ExecuteUbergraph_Red_Base
// 0x00F0 (0x00F0 - 0x0000)
struct Red_Base_C_ExecuteUbergraph_Red_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0060)(IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACTF_Flag_Blue_C*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player;             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player_1;           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ATrainGusPlayer_C*>              CallFunc_GetAllActorsOfClass_OutActors;            // 0x00C8(0x0010)(ReferenceParm)
	class ATrainGusPlayer_C*                      CallFunc_Array_Get_Item;                           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Red_Base_C_ExecuteUbergraph_Red_Base) == 0x000010, "Wrong alignment on Red_Base_C_ExecuteUbergraph_Red_Base");
static_assert(sizeof(Red_Base_C_ExecuteUbergraph_Red_Base) == 0x0000F0, "Wrong size on Red_Base_C_ExecuteUbergraph_Red_Base");
static_assert(offsetof(Red_Base_C_ExecuteUbergraph_Red_Base, EntryPoint) == 0x000000, "Member 'Red_Base_C_ExecuteUbergraph_Red_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(Red_Base_C_ExecuteUbergraph_Red_Base, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'Red_Base_C_ExecuteUbergraph_Red_Base::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Red_Base_C_ExecuteUbergraph_Red_Base, Temp_int_Loop_Counter_Variable) == 0x000070, "Member 'Red_Base_C_ExecuteUbergraph_Red_Base::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Red_Base_C_ExecuteUbergraph_Red_Base, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000078, "Member 'Red_Base_C_ExecuteUbergraph_Red_Base::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Red_Base_C_ExecuteUbergraph_Red_Base, CallFunc_Add_IntInt_ReturnValue) == 0x000080, "Member 'Red_Base_C_ExecuteUbergraph_Red_Base::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Red_Base_C_ExecuteUbergraph_Red_Base, CallFunc_FinishSpawningActor_ReturnValue) == 0x000088, "Member 'Red_Base_C_ExecuteUbergraph_Red_Base::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Red_Base_C_ExecuteUbergraph_Red_Base, Temp_int_Array_Index_Variable) == 0x000090, "Member 'Red_Base_C_ExecuteUbergraph_Red_Base::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Red_Base_C_ExecuteUbergraph_Red_Base, Temp_int_Variable) == 0x000094, "Member 'Red_Base_C_ExecuteUbergraph_Red_Base::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Red_Base_C_ExecuteUbergraph_Red_Base, K2Node_Event_OtherActor) == 0x000098, "Member 'Red_Base_C_ExecuteUbergraph_Red_Base::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(Red_Base_C_ExecuteUbergraph_Red_Base, CallFunc_GetPlayerPawn_ReturnValue) == 0x0000A0, "Member 'Red_Base_C_ExecuteUbergraph_Red_Base::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Red_Base_C_ExecuteUbergraph_Red_Base, K2Node_DynamicCast_AsTrain_Gus_Player) == 0x0000A8, "Member 'Red_Base_C_ExecuteUbergraph_Red_Base::K2Node_DynamicCast_AsTrain_Gus_Player' has a wrong offset!");
static_assert(offsetof(Red_Base_C_ExecuteUbergraph_Red_Base, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'Red_Base_C_ExecuteUbergraph_Red_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Red_Base_C_ExecuteUbergraph_Red_Base, K2Node_DynamicCast_AsTrain_Gus_Player_1) == 0x0000B8, "Member 'Red_Base_C_ExecuteUbergraph_Red_Base::K2Node_DynamicCast_AsTrain_Gus_Player_1' has a wrong offset!");
static_assert(offsetof(Red_Base_C_ExecuteUbergraph_Red_Base, K2Node_DynamicCast_bSuccess_1) == 0x0000C0, "Member 'Red_Base_C_ExecuteUbergraph_Red_Base::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Red_Base_C_ExecuteUbergraph_Red_Base, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000C4, "Member 'Red_Base_C_ExecuteUbergraph_Red_Base::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Red_Base_C_ExecuteUbergraph_Red_Base, CallFunc_GetAllActorsOfClass_OutActors) == 0x0000C8, "Member 'Red_Base_C_ExecuteUbergraph_Red_Base::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(Red_Base_C_ExecuteUbergraph_Red_Base, CallFunc_Array_Get_Item) == 0x0000D8, "Member 'Red_Base_C_ExecuteUbergraph_Red_Base::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Red_Base_C_ExecuteUbergraph_Red_Base, CallFunc_Array_Length_ReturnValue) == 0x0000E0, "Member 'Red_Base_C_ExecuteUbergraph_Red_Base::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Red_Base_C_ExecuteUbergraph_Red_Base, CallFunc_Less_IntInt_ReturnValue) == 0x0000E4, "Member 'Red_Base_C_ExecuteUbergraph_Red_Base::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

