#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Reticle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Reticle.Reticle_C
// 0x0028 (0x02B8 - 0x0290)
class UReticle_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       fade_in;                                           // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Reticle(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Reticle_C">();
	}
	static class UReticle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReticle_C>();
	}
};
static_assert(alignof(UReticle_C) == 0x000008, "Wrong alignment on UReticle_C");
static_assert(sizeof(UReticle_C) == 0x0002B8, "Wrong size on UReticle_C");
static_assert(offsetof(UReticle_C, UberGraphFrame) == 0x000290, "Member 'UReticle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UReticle_C, fade_in) == 0x000298, "Member 'UReticle_C::fade_in' has a wrong offset!");
static_assert(offsetof(UReticle_C, Image) == 0x0002A0, "Member 'UReticle_C::Image' has a wrong offset!");
static_assert(offsetof(UReticle_C, Image_0) == 0x0002A8, "Member 'UReticle_C::Image_0' has a wrong offset!");
static_assert(offsetof(UReticle_C, Image_2) == 0x0002B0, "Member 'UReticle_C::Image_2' has a wrong offset!");

}

