#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Reticle

#include "Basic.hpp"


namespace SDK::Params
{

// Function Reticle.Reticle_C.ExecuteUbergraph_Reticle
// 0x0028 (0x0028 - 0x0000)
struct Reticle_C_ExecuteUbergraph_Reticle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Reticle_C_ExecuteUbergraph_Reticle) == 0x000008, "Wrong alignment on Reticle_C_ExecuteUbergraph_Reticle");
static_assert(sizeof(Reticle_C_ExecuteUbergraph_Reticle) == 0x000028, "Wrong size on Reticle_C_ExecuteUbergraph_Reticle");
static_assert(offsetof(Reticle_C_ExecuteUbergraph_Reticle, EntryPoint) == 0x000000, "Member 'Reticle_C_ExecuteUbergraph_Reticle::EntryPoint' has a wrong offset!");
static_assert(offsetof(Reticle_C_ExecuteUbergraph_Reticle, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000008, "Member 'Reticle_C_ExecuteUbergraph_Reticle::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Reticle_C_ExecuteUbergraph_Reticle, K2Node_DynamicCast_AsTrain_Gus_Player) == 0x000010, "Member 'Reticle_C_ExecuteUbergraph_Reticle::K2Node_DynamicCast_AsTrain_Gus_Player' has a wrong offset!");
static_assert(offsetof(Reticle_C_ExecuteUbergraph_Reticle, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Reticle_C_ExecuteUbergraph_Reticle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Reticle_C_ExecuteUbergraph_Reticle, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000019, "Member 'Reticle_C_ExecuteUbergraph_Reticle::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Reticle_C_ExecuteUbergraph_Reticle, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00001A, "Member 'Reticle_C_ExecuteUbergraph_Reticle::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Reticle_C_ExecuteUbergraph_Reticle, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'Reticle_C_ExecuteUbergraph_Reticle::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

