#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RocketExplosion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass RocketExplosion.RocketExplosion_C
// 0x0028 (0x02A0 - 0x0278)
class ARocketExplosion_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Sphere;                                            // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      Object_Types;                                      // 0x0290(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ReceiveBeginPlay();
	void ExecuteUbergraph_RocketExplosion(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RocketExplosion_C">();
	}
	static class ARocketExplosion_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARocketExplosion_C>();
	}
};
static_assert(alignof(ARocketExplosion_C) == 0x000008, "Wrong alignment on ARocketExplosion_C");
static_assert(sizeof(ARocketExplosion_C) == 0x0002A0, "Wrong size on ARocketExplosion_C");
static_assert(offsetof(ARocketExplosion_C, UberGraphFrame) == 0x000278, "Member 'ARocketExplosion_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ARocketExplosion_C, Sphere) == 0x000280, "Member 'ARocketExplosion_C::Sphere' has a wrong offset!");
static_assert(offsetof(ARocketExplosion_C, DefaultSceneRoot) == 0x000288, "Member 'ARocketExplosion_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ARocketExplosion_C, Object_Types) == 0x000290, "Member 'ARocketExplosion_C::Object_Types' has a wrong offset!");

}

