#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RocketExplosionParticles

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass RocketExplosionParticles.RocketExplosionParticles_C
// 0x0020 (0x0298 - 0x0278)
class ARocketExplosionParticles_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Small_Explosion___sound_effect;                    // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CannonParticleAOE;                                 // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ExecuteUbergraph_RocketExplosionParticles(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RocketExplosionParticles_C">();
	}
	static class ARocketExplosionParticles_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARocketExplosionParticles_C>();
	}
};
static_assert(alignof(ARocketExplosionParticles_C) == 0x000008, "Wrong alignment on ARocketExplosionParticles_C");
static_assert(sizeof(ARocketExplosionParticles_C) == 0x000298, "Wrong size on ARocketExplosionParticles_C");
static_assert(offsetof(ARocketExplosionParticles_C, UberGraphFrame) == 0x000278, "Member 'ARocketExplosionParticles_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ARocketExplosionParticles_C, Small_Explosion___sound_effect) == 0x000280, "Member 'ARocketExplosionParticles_C::Small_Explosion___sound_effect' has a wrong offset!");
static_assert(offsetof(ARocketExplosionParticles_C, CannonParticleAOE) == 0x000288, "Member 'ARocketExplosionParticles_C::CannonParticleAOE' has a wrong offset!");
static_assert(offsetof(ARocketExplosionParticles_C, DefaultSceneRoot) == 0x000290, "Member 'ARocketExplosionParticles_C::DefaultSceneRoot' has a wrong offset!");

}

