#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RocketExplosion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function RocketExplosion.RocketExplosion_C.ExecuteUbergraph_RocketExplosion
// 0x03A0 (0x03A0 - 0x0000)
struct RocketExplosion_C_ExecuteUbergraph_RocketExplosion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0048(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0070(0x0010)(ConstParm, ReferenceParm)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0080(0x0060)(IsPlainOldData, NoDestructor)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x00E0(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARocketExplosionParticles_C*            CallFunc_FinishSpawningActor_ReturnValue;          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0198(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_292[0x2];                                      // 0x0292(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x02A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x02B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x02D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x02E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0310(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0338(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0350(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0378(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ApplyDamage_ReturnValue;                  // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion) == 0x000010, "Wrong alignment on RocketExplosion_C_ExecuteUbergraph_RocketExplosion");
static_assert(sizeof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion) == 0x0003A0, "Wrong size on RocketExplosion_C_ExecuteUbergraph_RocketExplosion");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, EntryPoint) == 0x000000, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::EntryPoint' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, Temp_int_Array_Index_Variable) == 0x000004, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000010, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, Temp_object_Variable) == 0x000048, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000058, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, Temp_object_Variable_1) == 0x000070, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_MakeTransform_ReturnValue) == 0x000080, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_SphereOverlapActors_OutActors) == 0x0000E0, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_SphereOverlapActors_ReturnValue) == 0x0000F0, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000F8, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_Array_Get_Item) == 0x000100, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_FinishSpawningActor_ReturnValue) == 0x000108, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000110, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, K2Node_DynamicCast_AsCharacter) == 0x000118, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, K2Node_DynamicCast_bSuccess) == 0x000120, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000128, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_Array_Length_ReturnValue) == 0x000140, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_FindLookAtRotation_ReturnValue) == 0x000148, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_Less_IntInt_ReturnValue) == 0x000160, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_GetForwardVector_ReturnValue) == 0x000168, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_BreakVector_X) == 0x000180, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_BreakVector_Y) == 0x000188, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_BreakVector_Z) == 0x000190, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_LineTraceSingle_OutHit) == 0x000198, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_LineTraceSingle_ReturnValue) == 0x000280, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000288, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_BreakHitResult_bBlockingHit) == 0x000290, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_BreakHitResult_bInitialOverlap) == 0x000291, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_BreakHitResult_Time) == 0x000294, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_BreakHitResult_Distance) == 0x000298, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_BreakHitResult_Location) == 0x0002A0, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_BreakHitResult_ImpactPoint) == 0x0002B8, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_BreakHitResult_Normal) == 0x0002D0, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_BreakHitResult_ImpactNormal) == 0x0002E8, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_BreakHitResult_PhysMat) == 0x000300, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_BreakHitResult_HitActor) == 0x000308, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_BreakHitResult_HitComponent) == 0x000310, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_BreakHitResult_HitBoneName) == 0x000318, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_BreakHitResult_BoneName) == 0x000320, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_BreakHitResult_HitItem) == 0x000328, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_BreakHitResult_ElementIndex) == 0x00032C, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_BreakHitResult_FaceIndex) == 0x000330, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_BreakHitResult_TraceStart) == 0x000338, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_BreakHitResult_TraceEnd) == 0x000350, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000368, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000370, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_MakeVector_ReturnValue) == 0x000378, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_GetOwner_ReturnValue) == 0x000390, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(RocketExplosion_C_ExecuteUbergraph_RocketExplosion, CallFunc_ApplyDamage_ReturnValue) == 0x000398, "Member 'RocketExplosion_C_ExecuteUbergraph_RocketExplosion::CallFunc_ApplyDamage_ReturnValue' has a wrong offset!");

}

