#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RocketFreemanAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct RocketFreemanAnimBP.RocketFreemanAnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0000 (0x0001 - 0x0001)
struct RocketFreemanAnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
};
static_assert(alignof(RocketFreemanAnimBP::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on RocketFreemanAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(RocketFreemanAnimBP::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong size on RocketFreemanAnimBP::FAnimBlueprintGeneratedMutableData");

// ScriptStruct RocketFreemanAnimBP.RocketFreemanAnimBP_C.AnimBlueprintGeneratedConstantData
// 0x0137 (0x0138 - 0x0001)
struct RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_52;                             // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_53;                                 // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_54;                                  // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_55;                                 // 0x001C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_56;                                // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_57;                               // 0x0024(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_58;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_59;                             // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_60;                                 // 0x0060(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_61;                                 // 0x0061(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_62;                                 // 0x0062(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63[0x1];                                       // 0x0063(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_63;                                 // 0x0064(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_64;                                  // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_65;                               // 0x0070(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_66;                                 // 0x0090(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_67;                                 // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00A0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0120(0x0018)()
};
static_assert(alignof(RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000138, "Wrong size on RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_52) == 0x000008, "Member 'RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_52' has a wrong offset!");
static_assert(offsetof(RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_53) == 0x000010, "Member 'RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_53' has a wrong offset!");
static_assert(offsetof(RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_54) == 0x000018, "Member 'RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_54' has a wrong offset!");
static_assert(offsetof(RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_55) == 0x00001C, "Member 'RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_55' has a wrong offset!");
static_assert(offsetof(RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_56) == 0x000020, "Member 'RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_56' has a wrong offset!");
static_assert(offsetof(RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_57) == 0x000024, "Member 'RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_57' has a wrong offset!");
static_assert(offsetof(RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_58) == 0x000050, "Member 'RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_58' has a wrong offset!");
static_assert(offsetof(RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_59) == 0x000058, "Member 'RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_59' has a wrong offset!");
static_assert(offsetof(RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_60) == 0x000060, "Member 'RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_60' has a wrong offset!");
static_assert(offsetof(RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_61) == 0x000061, "Member 'RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_61' has a wrong offset!");
static_assert(offsetof(RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_62) == 0x000062, "Member 'RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_62' has a wrong offset!");
static_assert(offsetof(RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_63) == 0x000064, "Member 'RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_63' has a wrong offset!");
static_assert(offsetof(RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_64) == 0x00006C, "Member 'RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_64' has a wrong offset!");
static_assert(offsetof(RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_65) == 0x000070, "Member 'RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_65' has a wrong offset!");
static_assert(offsetof(RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_66) == 0x000090, "Member 'RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_66' has a wrong offset!");
static_assert(offsetof(RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_67) == 0x000098, "Member 'RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_67' has a wrong offset!");
static_assert(offsetof(RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000A0, "Member 'RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000120, "Member 'RocketFreemanAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

