#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RocketeerFunny

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function RocketeerFunny.RocketeerFunny_C.ServerTrimp
// 0x0030 (0x0030 - 0x0000)
struct RocketeerFunny_C_ServerTrimp final
{
public:
	struct FVector                                ServerTrimpImpulse;                                // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ServerJumpImpulse;                                 // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ServerLateralImpulse;                              // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ClientCalled;                                      // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RocketeerFunny_C_ServerTrimp) == 0x000008, "Wrong alignment on RocketeerFunny_C_ServerTrimp");
static_assert(sizeof(RocketeerFunny_C_ServerTrimp) == 0x000030, "Wrong size on RocketeerFunny_C_ServerTrimp");
static_assert(offsetof(RocketeerFunny_C_ServerTrimp, ServerTrimpImpulse) == 0x000000, "Member 'RocketeerFunny_C_ServerTrimp::ServerTrimpImpulse' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_ServerTrimp, ServerJumpImpulse) == 0x000018, "Member 'RocketeerFunny_C_ServerTrimp::ServerJumpImpulse' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_ServerTrimp, ServerLateralImpulse) == 0x000020, "Member 'RocketeerFunny_C_ServerTrimp::ServerLateralImpulse' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_ServerTrimp, ClientCalled) == 0x000028, "Member 'RocketeerFunny_C_ServerTrimp::ClientCalled' has a wrong offset!");

// Function RocketeerFunny.RocketeerFunny_C.ServerMaxGround
// 0x0010 (0x0010 - 0x0000)
struct RocketeerFunny_C_ServerMaxGround final
{
public:
	double                                        SvrMaxAir;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ClientCalled;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RocketeerFunny_C_ServerMaxGround) == 0x000008, "Wrong alignment on RocketeerFunny_C_ServerMaxGround");
static_assert(sizeof(RocketeerFunny_C_ServerMaxGround) == 0x000010, "Wrong size on RocketeerFunny_C_ServerMaxGround");
static_assert(offsetof(RocketeerFunny_C_ServerMaxGround, SvrMaxAir) == 0x000000, "Member 'RocketeerFunny_C_ServerMaxGround::SvrMaxAir' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_ServerMaxGround, ClientCalled) == 0x000008, "Member 'RocketeerFunny_C_ServerMaxGround::ClientCalled' has a wrong offset!");

// Function RocketeerFunny.RocketeerFunny_C.ServerMaxAir
// 0x0010 (0x0010 - 0x0000)
struct RocketeerFunny_C_ServerMaxAir final
{
public:
	double                                        SvrMaxAir;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          fromClient;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RocketeerFunny_C_ServerMaxAir) == 0x000008, "Wrong alignment on RocketeerFunny_C_ServerMaxAir");
static_assert(sizeof(RocketeerFunny_C_ServerMaxAir) == 0x000010, "Wrong size on RocketeerFunny_C_ServerMaxAir");
static_assert(offsetof(RocketeerFunny_C_ServerMaxAir, SvrMaxAir) == 0x000000, "Member 'RocketeerFunny_C_ServerMaxAir::SvrMaxAir' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_ServerMaxAir, fromClient) == 0x000008, "Member 'RocketeerFunny_C_ServerMaxAir::fromClient' has a wrong offset!");

// Function RocketeerFunny.RocketeerFunny_C.ServerBhopCap
// 0x0020 (0x0020 - 0x0000)
struct RocketeerFunny_C_ServerBhopCap final
{
public:
	struct FVector                                ServerBhopCapVector;                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ServerBhopCapSpeed;                                // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RocketeerFunny_C_ServerBhopCap) == 0x000008, "Wrong alignment on RocketeerFunny_C_ServerBhopCap");
static_assert(sizeof(RocketeerFunny_C_ServerBhopCap) == 0x000020, "Wrong size on RocketeerFunny_C_ServerBhopCap");
static_assert(offsetof(RocketeerFunny_C_ServerBhopCap, ServerBhopCapVector) == 0x000000, "Member 'RocketeerFunny_C_ServerBhopCap::ServerBhopCapVector' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_ServerBhopCap, ServerBhopCapSpeed) == 0x000018, "Member 'RocketeerFunny_C_ServerBhopCap::ServerBhopCapSpeed' has a wrong offset!");

// Function RocketeerFunny.RocketeerFunny_C.resetFriction
// 0x0010 (0x0010 - 0x0000)
struct RocketeerFunny_C_resetFriction final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_VariableSet_GroundFriction_NarrowingCast;   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_BrakingDecelerationWalking_NarrowingCast; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_MaxWalkSpeed_NarrowingCast;     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RocketeerFunny_C_resetFriction) == 0x000004, "Wrong alignment on RocketeerFunny_C_resetFriction");
static_assert(sizeof(RocketeerFunny_C_resetFriction) == 0x000010, "Wrong size on RocketeerFunny_C_resetFriction");
static_assert(offsetof(RocketeerFunny_C_resetFriction, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'RocketeerFunny_C_resetFriction::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_resetFriction, K2Node_VariableSet_GroundFriction_NarrowingCast) == 0x000004, "Member 'RocketeerFunny_C_resetFriction::K2Node_VariableSet_GroundFriction_NarrowingCast' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_resetFriction, K2Node_VariableSet_BrakingDecelerationWalking_NarrowingCast) == 0x000008, "Member 'RocketeerFunny_C_resetFriction::K2Node_VariableSet_BrakingDecelerationWalking_NarrowingCast' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_resetFriction, K2Node_VariableSet_MaxWalkSpeed_NarrowingCast) == 0x00000C, "Member 'RocketeerFunny_C_resetFriction::K2Node_VariableSet_MaxWalkSpeed_NarrowingCast' has a wrong offset!");

// Function RocketeerFunny.RocketeerFunny_C.removeFriction
// 0x0001 (0x0001 - 0x0000)
struct RocketeerFunny_C_removeFriction final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RocketeerFunny_C_removeFriction) == 0x000001, "Wrong alignment on RocketeerFunny_C_removeFriction");
static_assert(sizeof(RocketeerFunny_C_removeFriction) == 0x000001, "Wrong size on RocketeerFunny_C_removeFriction");
static_assert(offsetof(RocketeerFunny_C_removeFriction, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'RocketeerFunny_C_removeFriction::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function RocketeerFunny.RocketeerFunny_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct RocketeerFunny_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RocketeerFunny_C_ReceiveTick) == 0x000004, "Wrong alignment on RocketeerFunny_C_ReceiveTick");
static_assert(sizeof(RocketeerFunny_C_ReceiveTick) == 0x000004, "Wrong size on RocketeerFunny_C_ReceiveTick");
static_assert(offsetof(RocketeerFunny_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'RocketeerFunny_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function RocketeerFunny.RocketeerFunny_C.ReceiveAnyDamage
// 0x0020 (0x0020 - 0x0000)
struct RocketeerFunny_C_ReceiveAnyDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UDamageType*                      DamageType;                                        // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RocketeerFunny_C_ReceiveAnyDamage) == 0x000008, "Wrong alignment on RocketeerFunny_C_ReceiveAnyDamage");
static_assert(sizeof(RocketeerFunny_C_ReceiveAnyDamage) == 0x000020, "Wrong size on RocketeerFunny_C_ReceiveAnyDamage");
static_assert(offsetof(RocketeerFunny_C_ReceiveAnyDamage, Damage) == 0x000000, "Member 'RocketeerFunny_C_ReceiveAnyDamage::Damage' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_ReceiveAnyDamage, DamageType) == 0x000008, "Member 'RocketeerFunny_C_ReceiveAnyDamage::DamageType' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_ReceiveAnyDamage, InstigatedBy) == 0x000010, "Member 'RocketeerFunny_C_ReceiveAnyDamage::InstigatedBy' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_ReceiveAnyDamage, DamageCauser) == 0x000018, "Member 'RocketeerFunny_C_ReceiveAnyDamage::DamageCauser' has a wrong offset!");

// Function RocketeerFunny.RocketeerFunny_C.rampSlide
// 0x0028 (0x0028 - 0x0000)
struct RocketeerFunny_C_rampSlide final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_rampCheck_onSlideableRamp;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_rampCheck_GroundAngleDotproduct;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RocketeerFunny_C_rampSlide) == 0x000008, "Wrong alignment on RocketeerFunny_C_rampSlide");
static_assert(sizeof(RocketeerFunny_C_rampSlide) == 0x000028, "Wrong size on RocketeerFunny_C_rampSlide");
static_assert(offsetof(RocketeerFunny_C_rampSlide, ReturnValue) == 0x000000, "Member 'RocketeerFunny_C_rampSlide::ReturnValue' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_rampSlide, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'RocketeerFunny_C_rampSlide::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_rampSlide, CallFunc_rampCheck_onSlideableRamp) == 0x000010, "Member 'RocketeerFunny_C_rampSlide::CallFunc_rampCheck_onSlideableRamp' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_rampSlide, CallFunc_rampCheck_GroundAngleDotproduct) == 0x000018, "Member 'RocketeerFunny_C_rampSlide::CallFunc_rampCheck_GroundAngleDotproduct' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_rampSlide, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000020, "Member 'RocketeerFunny_C_rampSlide::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_rampSlide, CallFunc_BooleanAND_ReturnValue) == 0x000021, "Member 'RocketeerFunny_C_rampSlide::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function RocketeerFunny.RocketeerFunny_C.rampCheck
// 0x0288 (0x0288 - 0x0000)
struct RocketeerFunny_C_rampCheck final
{
public:
	bool                                          onSlideableRamp;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        GroundAngleDotproduct;                             // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0010(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0098(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_183[0x1];                                      // 0x0183(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegAcos_ReturnValue;                      // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RocketeerFunny_C_rampCheck) == 0x000008, "Wrong alignment on RocketeerFunny_C_rampCheck");
static_assert(sizeof(RocketeerFunny_C_rampCheck) == 0x000288, "Wrong size on RocketeerFunny_C_rampCheck");
static_assert(offsetof(RocketeerFunny_C_rampCheck, onSlideableRamp) == 0x000000, "Member 'RocketeerFunny_C_rampCheck::onSlideableRamp' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_rampCheck, GroundAngleDotproduct) == 0x000008, "Member 'RocketeerFunny_C_rampCheck::GroundAngleDotproduct' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_rampCheck, Temp_object_Variable) == 0x000010, "Member 'RocketeerFunny_C_rampCheck::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_rampCheck, CallFunc_Normal_ReturnValue) == 0x000020, "Member 'RocketeerFunny_C_rampCheck::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_rampCheck, CallFunc_GetActorUpVector_ReturnValue) == 0x000038, "Member 'RocketeerFunny_C_rampCheck::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_rampCheck, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000050, "Member 'RocketeerFunny_C_rampCheck::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_rampCheck, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000068, "Member 'RocketeerFunny_C_rampCheck::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_rampCheck, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000080, "Member 'RocketeerFunny_C_rampCheck::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_rampCheck, CallFunc_LineTraceSingle_OutHit) == 0x000098, "Member 'RocketeerFunny_C_rampCheck::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_rampCheck, CallFunc_LineTraceSingle_ReturnValue) == 0x000180, "Member 'RocketeerFunny_C_rampCheck::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_rampCheck, CallFunc_BreakHitResult_bBlockingHit) == 0x000181, "Member 'RocketeerFunny_C_rampCheck::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_rampCheck, CallFunc_BreakHitResult_bInitialOverlap) == 0x000182, "Member 'RocketeerFunny_C_rampCheck::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_rampCheck, CallFunc_BreakHitResult_Time) == 0x000184, "Member 'RocketeerFunny_C_rampCheck::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_rampCheck, CallFunc_BreakHitResult_Distance) == 0x000188, "Member 'RocketeerFunny_C_rampCheck::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_rampCheck, CallFunc_BreakHitResult_Location) == 0x000190, "Member 'RocketeerFunny_C_rampCheck::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_rampCheck, CallFunc_BreakHitResult_ImpactPoint) == 0x0001A8, "Member 'RocketeerFunny_C_rampCheck::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_rampCheck, CallFunc_BreakHitResult_Normal) == 0x0001C0, "Member 'RocketeerFunny_C_rampCheck::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_rampCheck, CallFunc_BreakHitResult_ImpactNormal) == 0x0001D8, "Member 'RocketeerFunny_C_rampCheck::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_rampCheck, CallFunc_BreakHitResult_PhysMat) == 0x0001F0, "Member 'RocketeerFunny_C_rampCheck::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_rampCheck, CallFunc_BreakHitResult_HitActor) == 0x0001F8, "Member 'RocketeerFunny_C_rampCheck::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_rampCheck, CallFunc_BreakHitResult_HitComponent) == 0x000200, "Member 'RocketeerFunny_C_rampCheck::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_rampCheck, CallFunc_BreakHitResult_HitBoneName) == 0x000208, "Member 'RocketeerFunny_C_rampCheck::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_rampCheck, CallFunc_BreakHitResult_BoneName) == 0x000210, "Member 'RocketeerFunny_C_rampCheck::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_rampCheck, CallFunc_BreakHitResult_HitItem) == 0x000218, "Member 'RocketeerFunny_C_rampCheck::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_rampCheck, CallFunc_BreakHitResult_ElementIndex) == 0x00021C, "Member 'RocketeerFunny_C_rampCheck::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_rampCheck, CallFunc_BreakHitResult_FaceIndex) == 0x000220, "Member 'RocketeerFunny_C_rampCheck::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_rampCheck, CallFunc_BreakHitResult_TraceStart) == 0x000228, "Member 'RocketeerFunny_C_rampCheck::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_rampCheck, CallFunc_BreakHitResult_TraceEnd) == 0x000240, "Member 'RocketeerFunny_C_rampCheck::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_rampCheck, CallFunc_Normal_ReturnValue_1) == 0x000258, "Member 'RocketeerFunny_C_rampCheck::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_rampCheck, CallFunc_Dot_VectorVector_ReturnValue) == 0x000270, "Member 'RocketeerFunny_C_rampCheck::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_rampCheck, CallFunc_DegAcos_ReturnValue) == 0x000278, "Member 'RocketeerFunny_C_rampCheck::CallFunc_DegAcos_ReturnValue' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_rampCheck, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000280, "Member 'RocketeerFunny_C_rampCheck::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");

// Function RocketeerFunny.RocketeerFunny_C.K2_OnMovementModeChanged
// 0x0004 (0x0004 - 0x0000)
struct RocketeerFunny_C_K2_OnMovementModeChanged final
{
public:
	EMovementMode                                 PrevMovementMode;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 NewMovementMode;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         PrevCustomMode;                                    // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         NewCustomMode;                                     // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RocketeerFunny_C_K2_OnMovementModeChanged) == 0x000001, "Wrong alignment on RocketeerFunny_C_K2_OnMovementModeChanged");
static_assert(sizeof(RocketeerFunny_C_K2_OnMovementModeChanged) == 0x000004, "Wrong size on RocketeerFunny_C_K2_OnMovementModeChanged");
static_assert(offsetof(RocketeerFunny_C_K2_OnMovementModeChanged, PrevMovementMode) == 0x000000, "Member 'RocketeerFunny_C_K2_OnMovementModeChanged::PrevMovementMode' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_K2_OnMovementModeChanged, NewMovementMode) == 0x000001, "Member 'RocketeerFunny_C_K2_OnMovementModeChanged::NewMovementMode' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_K2_OnMovementModeChanged, PrevCustomMode) == 0x000002, "Member 'RocketeerFunny_C_K2_OnMovementModeChanged::PrevCustomMode' has a wrong offset!");
static_assert(offsetof(RocketeerFunny_C_K2_OnMovementModeChanged, NewCustomMode) == 0x000003, "Member 'RocketeerFunny_C_K2_OnMovementModeChanged::NewCustomMode' has a wrong offset!");

// Function RocketeerFunny.RocketeerFunny_C. Left Mouse_K2Node_InputAxisEvent_0
// 0x0004 (0x0004 - 0x0000)
struct RocketeerFunny_C__Left_Mouse_K2Node_InputAxisEvent_0 final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RocketeerFunny_C__Left_Mouse_K2Node_InputAxisEvent_0) == 0x000004, "Wrong alignment on RocketeerFunny_C__Left_Mouse_K2Node_InputAxisEvent_0");
static_assert(sizeof(RocketeerFunny_C__Left_Mouse_K2Node_InputAxisEvent_0) == 0x000004, "Wrong size on RocketeerFunny_C__Left_Mouse_K2Node_InputAxisEvent_0");
static_assert(offsetof(RocketeerFunny_C__Left_Mouse_K2Node_InputAxisEvent_0, AxisValue) == 0x000000, "Member 'RocketeerFunny_C__Left_Mouse_K2Node_InputAxisEvent_0::AxisValue' has a wrong offset!");

// Function RocketeerFunny.RocketeerFunny_C. Left_K2Node_InputAxisEvent_2
// 0x0004 (0x0004 - 0x0000)
struct RocketeerFunny_C__Left_K2Node_InputAxisEvent_2 final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RocketeerFunny_C__Left_K2Node_InputAxisEvent_2) == 0x000004, "Wrong alignment on RocketeerFunny_C__Left_K2Node_InputAxisEvent_2");
static_assert(sizeof(RocketeerFunny_C__Left_K2Node_InputAxisEvent_2) == 0x000004, "Wrong size on RocketeerFunny_C__Left_K2Node_InputAxisEvent_2");
static_assert(offsetof(RocketeerFunny_C__Left_K2Node_InputAxisEvent_2, AxisValue) == 0x000000, "Member 'RocketeerFunny_C__Left_K2Node_InputAxisEvent_2::AxisValue' has a wrong offset!");

// Function RocketeerFunny.RocketeerFunny_C. Backward_K2Node_InputAxisEvent_3
// 0x0004 (0x0004 - 0x0000)
struct RocketeerFunny_C__Backward_K2Node_InputAxisEvent_3 final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RocketeerFunny_C__Backward_K2Node_InputAxisEvent_3) == 0x000004, "Wrong alignment on RocketeerFunny_C__Backward_K2Node_InputAxisEvent_3");
static_assert(sizeof(RocketeerFunny_C__Backward_K2Node_InputAxisEvent_3) == 0x000004, "Wrong size on RocketeerFunny_C__Backward_K2Node_InputAxisEvent_3");
static_assert(offsetof(RocketeerFunny_C__Backward_K2Node_InputAxisEvent_3, AxisValue) == 0x000000, "Member 'RocketeerFunny_C__Backward_K2Node_InputAxisEvent_3::AxisValue' has a wrong offset!");

// Function RocketeerFunny.RocketeerFunny_C. Down Mouse_K2Node_InputAxisEvent_1
// 0x0004 (0x0004 - 0x0000)
struct RocketeerFunny_C__Down_Mouse_K2Node_InputAxisEvent_1 final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RocketeerFunny_C__Down_Mouse_K2Node_InputAxisEvent_1) == 0x000004, "Wrong alignment on RocketeerFunny_C__Down_Mouse_K2Node_InputAxisEvent_1");
static_assert(sizeof(RocketeerFunny_C__Down_Mouse_K2Node_InputAxisEvent_1) == 0x000004, "Wrong size on RocketeerFunny_C__Down_Mouse_K2Node_InputAxisEvent_1");
static_assert(offsetof(RocketeerFunny_C__Down_Mouse_K2Node_InputAxisEvent_1, AxisValue) == 0x000000, "Member 'RocketeerFunny_C__Down_Mouse_K2Node_InputAxisEvent_1::AxisValue' has a wrong offset!");

// Function RocketeerFunny.RocketeerFunny_C.InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_1
// 0x0018 (0x0018 - 0x0000)
struct RocketeerFunny_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(RocketeerFunny_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_1) == 0x000008, "Wrong alignment on RocketeerFunny_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_1");
static_assert(sizeof(RocketeerFunny_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_1) == 0x000018, "Wrong size on RocketeerFunny_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_1");
static_assert(offsetof(RocketeerFunny_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_1, Key) == 0x000000, "Member 'RocketeerFunny_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_1::Key' has a wrong offset!");

// Function RocketeerFunny.RocketeerFunny_C.InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_0
// 0x0018 (0x0018 - 0x0000)
struct RocketeerFunny_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(RocketeerFunny_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_0) == 0x000008, "Wrong alignment on RocketeerFunny_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_0");
static_assert(sizeof(RocketeerFunny_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_0) == 0x000018, "Wrong size on RocketeerFunny_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_0");
static_assert(offsetof(RocketeerFunny_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_0, Key) == 0x000000, "Member 'RocketeerFunny_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_0::Key' has a wrong offset!");

// Function RocketeerFunny.RocketeerFunny_C.InpActEvt_Jump_K2Node_InputActionEvent_1
// 0x0018 (0x0018 - 0x0000)
struct RocketeerFunny_C_InpActEvt_Jump_K2Node_InputActionEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(RocketeerFunny_C_InpActEvt_Jump_K2Node_InputActionEvent_1) == 0x000008, "Wrong alignment on RocketeerFunny_C_InpActEvt_Jump_K2Node_InputActionEvent_1");
static_assert(sizeof(RocketeerFunny_C_InpActEvt_Jump_K2Node_InputActionEvent_1) == 0x000018, "Wrong size on RocketeerFunny_C_InpActEvt_Jump_K2Node_InputActionEvent_1");
static_assert(offsetof(RocketeerFunny_C_InpActEvt_Jump_K2Node_InputActionEvent_1, Key) == 0x000000, "Member 'RocketeerFunny_C_InpActEvt_Jump_K2Node_InputActionEvent_1::Key' has a wrong offset!");

// Function RocketeerFunny.RocketeerFunny_C.InpActEvt_Jump_K2Node_InputActionEvent_0
// 0x0018 (0x0018 - 0x0000)
struct RocketeerFunny_C_InpActEvt_Jump_K2Node_InputActionEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(RocketeerFunny_C_InpActEvt_Jump_K2Node_InputActionEvent_0) == 0x000008, "Wrong alignment on RocketeerFunny_C_InpActEvt_Jump_K2Node_InputActionEvent_0");
static_assert(sizeof(RocketeerFunny_C_InpActEvt_Jump_K2Node_InputActionEvent_0) == 0x000018, "Wrong size on RocketeerFunny_C_InpActEvt_Jump_K2Node_InputActionEvent_0");
static_assert(offsetof(RocketeerFunny_C_InpActEvt_Jump_K2Node_InputActionEvent_0, Key) == 0x000000, "Member 'RocketeerFunny_C_InpActEvt_Jump_K2Node_InputActionEvent_0::Key' has a wrong offset!");

// Function RocketeerFunny.RocketeerFunny_C.hitmarker
// 0x0008 (0x0008 - 0x0000)
struct RocketeerFunny_C_hitmarker final
{
public:
	class APlayerController*                      OwningPlayer;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RocketeerFunny_C_hitmarker) == 0x000008, "Wrong alignment on RocketeerFunny_C_hitmarker");
static_assert(sizeof(RocketeerFunny_C_hitmarker) == 0x000008, "Wrong size on RocketeerFunny_C_hitmarker");
static_assert(offsetof(RocketeerFunny_C_hitmarker, OwningPlayer) == 0x000000, "Member 'RocketeerFunny_C_hitmarker::OwningPlayer' has a wrong offset!");

// Function RocketeerFunny.RocketeerFunny_C.ExecuteUbergraph_RocketeerFunny
// 0x0D10 (0x0D10 - 0x0000)
struct RocketeerFunny_C_ExecuteUbergraph_RocketeerFunny final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_rampCheck_onSlideableRamp;                // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_rampCheck_GroundAngleDotproduct;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_applyTrimp_trimpImpulse;                  // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_applyTrimp_trimpJumpImpulse;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_applyTrimp_TrimpLateralImpulse;           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_rampSlide_ReturnValue;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_1;       // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_accelerateAir_calcMaxAir;                 // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_accelerateAir_AirAccelDir;                // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_accelerateAir_applyingAirAccel;           // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_accelerateGround_GroundAccelDir;          // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_accelerateGround_ApplyingGroundAccel;     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_accelerateGround_CalcMaxWalk;             // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWalking_ReturnValue;                    // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EA[0x2];                                      // 0x01EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_2;       // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_applyBhopCap_bhopCapNewSpeed;             // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_applyBhopCap_bhopCapVector;               // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_applyBhopCap_Applyingcap;                 // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_213[0x1];                                      // 0x0213(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_3;       // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable;                              // 0x0218(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0238(0x0018)(HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 K2Node_Event_PrevMovementMode;                     // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 K2Node_Event_NewMovementMode;                      // 0x0262(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_Event_PrevCustomMode;                       // 0x0263(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_Event_NewCustomMode;                        // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0265(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_266[0x2];                                      // 0x0266(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_InputAxisEvent_AxisValue_3;                 // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_InputAxisEvent_AxisValue_2;                 // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_InputAxisEvent_AxisValue_1;                 // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_1;    // 0x0275(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_276[0x2];                                      // 0x0276(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_InputAxisEvent_AxisValue;                   // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_2;    // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27D[0x3];                                      // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0280(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_3;    // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x029A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x029B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x02A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x02B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x02D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_1;                        // 0x02E8(0x0018)(HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0300(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x03E8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D1[0x7];                                      // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x04D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFalling_ReturnValue_1;                  // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E9[0x3];                                      // 0x04E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage;                               // 0x04EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageType*                      K2Node_Event_DamageType;                           // 0x04F0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0510(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_1;    // 0x0528(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0540(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0558(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0570(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0658(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0668(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_669[0x7];                                      // 0x0669(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0670(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0758(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0759(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x075A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75B[0x1];                                      // 0x075B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x075C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0760(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_764[0x4];                                      // 0x0764(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0768(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0780(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0798(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x07B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x07C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
