#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SaveOptions

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SaveOptions.SaveOptions_C
// 0x0090 (0x00B8 - 0x0028)
class USaveOptions_C final : public USaveGame
{
public:
	double                                        Field_Of_Vision;                                   // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MouseSens;                                         // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Snipersens;                                        // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Master_Audio;                                      // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   GameMode;                                          // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Kill_Confirmed_Widget;                             // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Lumin;                                             // 0x0051(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Hitmarker_Size;                                    // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Hitmarker_Type;                                    // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	double                                        BlunderPistolSens;                                 // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EnviromentAudio;                                   // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InvertY;                                           // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InvertX;                                           // 0x0089(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MusicAudio;                                        // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DamageNumbers;                                     // 0x0098(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Text_Chat;                                         // 0x0099(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Last_Joined_Server;                                // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          Remove_Aiming_FOV_;                                // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SaveOptions_C">();
	}
	static class USaveOptions_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USaveOptions_C>();
	}
};
static_assert(alignof(USaveOptions_C) == 0x000008, "Wrong alignment on USaveOptions_C");
static_assert(sizeof(USaveOptions_C) == 0x0000B8, "Wrong size on USaveOptions_C");
static_assert(offsetof(USaveOptions_C, Field_Of_Vision) == 0x000028, "Member 'USaveOptions_C::Field_Of_Vision' has a wrong offset!");
static_assert(offsetof(USaveOptions_C, MouseSens) == 0x000030, "Member 'USaveOptions_C::MouseSens' has a wrong offset!");
static_assert(offsetof(USaveOptions_C, Snipersens) == 0x000038, "Member 'USaveOptions_C::Snipersens' has a wrong offset!");
static_assert(offsetof(USaveOptions_C, Master_Audio) == 0x000040, "Member 'USaveOptions_C::Master_Audio' has a wrong offset!");
static_assert(offsetof(USaveOptions_C, GameMode) == 0x000048, "Member 'USaveOptions_C::GameMode' has a wrong offset!");
static_assert(offsetof(USaveOptions_C, Kill_Confirmed_Widget) == 0x000050, "Member 'USaveOptions_C::Kill_Confirmed_Widget' has a wrong offset!");
static_assert(offsetof(USaveOptions_C, Lumin) == 0x000051, "Member 'USaveOptions_C::Lumin' has a wrong offset!");
static_assert(offsetof(USaveOptions_C, Hitmarker_Size) == 0x000058, "Member 'USaveOptions_C::Hitmarker_Size' has a wrong offset!");
static_assert(offsetof(USaveOptions_C, Hitmarker_Type) == 0x000068, "Member 'USaveOptions_C::Hitmarker_Type' has a wrong offset!");
static_assert(offsetof(USaveOptions_C, BlunderPistolSens) == 0x000078, "Member 'USaveOptions_C::BlunderPistolSens' has a wrong offset!");
static_assert(offsetof(USaveOptions_C, EnviromentAudio) == 0x000080, "Member 'USaveOptions_C::EnviromentAudio' has a wrong offset!");
static_assert(offsetof(USaveOptions_C, InvertY) == 0x000088, "Member 'USaveOptions_C::InvertY' has a wrong offset!");
static_assert(offsetof(USaveOptions_C, InvertX) == 0x000089, "Member 'USaveOptions_C::InvertX' has a wrong offset!");
static_assert(offsetof(USaveOptions_C, MusicAudio) == 0x000090, "Member 'USaveOptions_C::MusicAudio' has a wrong offset!");
static_assert(offsetof(USaveOptions_C, DamageNumbers) == 0x000098, "Member 'USaveOptions_C::DamageNumbers' has a wrong offset!");
static_assert(offsetof(USaveOptions_C, Text_Chat) == 0x000099, "Member 'USaveOptions_C::Text_Chat' has a wrong offset!");
static_assert(offsetof(USaveOptions_C, Last_Joined_Server) == 0x0000A0, "Member 'USaveOptions_C::Last_Joined_Server' has a wrong offset!");
static_assert(offsetof(USaveOptions_C, Remove_Aiming_FOV_) == 0x0000B0, "Member 'USaveOptions_C::Remove_Aiming_FOV_' has a wrong offset!");

}

