#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SaveItems

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SaveItems.SaveItems_C
// 0x0028 (0x0050 - 0x0028)
class USaveItems_C final : public USaveGame
{
public:
	int32                                         HatNumber;                                         // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Title;                                             // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Weapon_1;                                          // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Weapon_2;                                          // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Skin_Number;                                       // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PantType;                                          // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SaveItems_C">();
	}
	static class USaveItems_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USaveItems_C>();
	}
};
static_assert(alignof(USaveItems_C) == 0x000008, "Wrong alignment on USaveItems_C");
static_assert(sizeof(USaveItems_C) == 0x000050, "Wrong size on USaveItems_C");
static_assert(offsetof(USaveItems_C, HatNumber) == 0x000028, "Member 'USaveItems_C::HatNumber' has a wrong offset!");
static_assert(offsetof(USaveItems_C, Title) == 0x00002C, "Member 'USaveItems_C::Title' has a wrong offset!");
static_assert(offsetof(USaveItems_C, Weapon_1) == 0x000030, "Member 'USaveItems_C::Weapon_1' has a wrong offset!");
static_assert(offsetof(USaveItems_C, Weapon_2) == 0x000034, "Member 'USaveItems_C::Weapon_2' has a wrong offset!");
static_assert(offsetof(USaveItems_C, Skin_Number) == 0x000038, "Member 'USaveItems_C::Skin_Number' has a wrong offset!");
static_assert(offsetof(USaveItems_C, PantType) == 0x000040, "Member 'USaveItems_C::PantType' has a wrong offset!");

}

