#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Scoreboard

#include "Basic.hpp"


namespace SDK::Params
{

// Function Scoreboard.Scoreboard_C.ExecuteUbergraph_Scoreboard
// 0x0090 (0x0090 - 0x0000)
struct Scoreboard_C_ExecuteUbergraph_Scoreboard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULeaderboard_spot_C*                    CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MaxOfIntArray_IndexOfMaxValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MaxOfIntArray_MaxValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULeaderboard_spot_C*                    CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_Array_Get_Item_1;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Scoreboard_C_ExecuteUbergraph_Scoreboard) == 0x000008, "Wrong alignment on Scoreboard_C_ExecuteUbergraph_Scoreboard");
static_assert(sizeof(Scoreboard_C_ExecuteUbergraph_Scoreboard) == 0x000090, "Wrong size on Scoreboard_C_ExecuteUbergraph_Scoreboard");
static_assert(offsetof(Scoreboard_C_ExecuteUbergraph_Scoreboard, EntryPoint) == 0x000000, "Member 'Scoreboard_C_ExecuteUbergraph_Scoreboard::EntryPoint' has a wrong offset!");
static_assert(offsetof(Scoreboard_C_ExecuteUbergraph_Scoreboard, CallFunc_Create_ReturnValue) == 0x000008, "Member 'Scoreboard_C_ExecuteUbergraph_Scoreboard::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scoreboard_C_ExecuteUbergraph_Scoreboard, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000010, "Member 'Scoreboard_C_ExecuteUbergraph_Scoreboard::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scoreboard_C_ExecuteUbergraph_Scoreboard, CallFunc_MaxOfIntArray_IndexOfMaxValue) == 0x000014, "Member 'Scoreboard_C_ExecuteUbergraph_Scoreboard::CallFunc_MaxOfIntArray_IndexOfMaxValue' has a wrong offset!");
static_assert(offsetof(Scoreboard_C_ExecuteUbergraph_Scoreboard, CallFunc_MaxOfIntArray_MaxValue) == 0x000018, "Member 'Scoreboard_C_ExecuteUbergraph_Scoreboard::CallFunc_MaxOfIntArray_MaxValue' has a wrong offset!");
static_assert(offsetof(Scoreboard_C_ExecuteUbergraph_Scoreboard, CallFunc_Array_Get_Item) == 0x000020, "Member 'Scoreboard_C_ExecuteUbergraph_Scoreboard::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Scoreboard_C_ExecuteUbergraph_Scoreboard, CallFunc_GetPlayerPawn_ReturnValue) == 0x000028, "Member 'Scoreboard_C_ExecuteUbergraph_Scoreboard::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scoreboard_C_ExecuteUbergraph_Scoreboard, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'Scoreboard_C_ExecuteUbergraph_Scoreboard::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Scoreboard_C_ExecuteUbergraph_Scoreboard, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'Scoreboard_C_ExecuteUbergraph_Scoreboard::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scoreboard_C_ExecuteUbergraph_Scoreboard, CallFunc_GetGameState_ReturnValue) == 0x000038, "Member 'Scoreboard_C_ExecuteUbergraph_Scoreboard::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scoreboard_C_ExecuteUbergraph_Scoreboard, CallFunc_AddChild_ReturnValue) == 0x000040, "Member 'Scoreboard_C_ExecuteUbergraph_Scoreboard::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scoreboard_C_ExecuteUbergraph_Scoreboard, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'Scoreboard_C_ExecuteUbergraph_Scoreboard::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scoreboard_C_ExecuteUbergraph_Scoreboard, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'Scoreboard_C_ExecuteUbergraph_Scoreboard::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scoreboard_C_ExecuteUbergraph_Scoreboard, Temp_int_Array_Index_Variable) == 0x000050, "Member 'Scoreboard_C_ExecuteUbergraph_Scoreboard::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Scoreboard_C_ExecuteUbergraph_Scoreboard, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'Scoreboard_C_ExecuteUbergraph_Scoreboard::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Scoreboard_C_ExecuteUbergraph_Scoreboard, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000060, "Member 'Scoreboard_C_ExecuteUbergraph_Scoreboard::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scoreboard_C_ExecuteUbergraph_Scoreboard, K2Node_DynamicCast_AsPlayer_State_BP) == 0x000068, "Member 'Scoreboard_C_ExecuteUbergraph_Scoreboard::K2Node_DynamicCast_AsPlayer_State_BP' has a wrong offset!");
static_assert(offsetof(Scoreboard_C_ExecuteUbergraph_Scoreboard, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'Scoreboard_C_ExecuteUbergraph_Scoreboard::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Scoreboard_C_ExecuteUbergraph_Scoreboard, CallFunc_GetPlayerName_ReturnValue) == 0x000078, "Member 'Scoreboard_C_ExecuteUbergraph_Scoreboard::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scoreboard_C_ExecuteUbergraph_Scoreboard, CallFunc_Conv_StringToName_ReturnValue) == 0x000088, "Member 'Scoreboard_C_ExecuteUbergraph_Scoreboard::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");

}

