#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ServerCannonDamager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ServerCannonDamager.ServerCannonDamager_C
// 0x0018 (0x0290 - 0x0278)
class AServerCannonDamager_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Hit_bloke;                                         // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ExecuteUbergraph_ServerCannonDamager(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ServerCannonDamager_C">();
	}
	static class AServerCannonDamager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AServerCannonDamager_C>();
	}
};
static_assert(alignof(AServerCannonDamager_C) == 0x000008, "Wrong alignment on AServerCannonDamager_C");
static_assert(sizeof(AServerCannonDamager_C) == 0x000290, "Wrong size on AServerCannonDamager_C");
static_assert(offsetof(AServerCannonDamager_C, UberGraphFrame) == 0x000278, "Member 'AServerCannonDamager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AServerCannonDamager_C, DefaultSceneRoot) == 0x000280, "Member 'AServerCannonDamager_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AServerCannonDamager_C, Hit_bloke) == 0x000288, "Member 'AServerCannonDamager_C::Hit_bloke' has a wrong offset!");

}

