#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ServerCannonDamager

#include "Basic.hpp"


namespace SDK::Params
{

// Function ServerCannonDamager.ServerCannonDamager_C.ExecuteUbergraph_ServerCannonDamager
// 0x0058 (0x0058 - 0x0000)
struct ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACannon_C*                              K2Node_DynamicCast_AsCannon;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_ApplyDamage_ReturnValue;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player_1;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53[0x1];                                       // 0x0053(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_ApplyDamage_ReturnValue_1;                // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager) == 0x000008, "Wrong alignment on ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager");
static_assert(sizeof(ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager) == 0x000058, "Wrong size on ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager");
static_assert(offsetof(ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager, EntryPoint) == 0x000000, "Member 'ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager::EntryPoint' has a wrong offset!");
static_assert(offsetof(ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager, K2Node_DynamicCast_AsTrain_Gus_Player) == 0x000010, "Member 'ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager::K2Node_DynamicCast_AsTrain_Gus_Player' has a wrong offset!");
static_assert(offsetof(ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager, K2Node_DynamicCast_AsCannon) == 0x000020, "Member 'ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager::K2Node_DynamicCast_AsCannon' has a wrong offset!");
static_assert(offsetof(ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager, CallFunc_ApplyDamage_ReturnValue) == 0x00002C, "Member 'ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager::CallFunc_ApplyDamage_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000030, "Member 'ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000031, "Member 'ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager, K2Node_DynamicCast_AsTrain_Gus_Player_1) == 0x000038, "Member 'ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager::K2Node_DynamicCast_AsTrain_Gus_Player_1' has a wrong offset!");
static_assert(offsetof(ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager, K2Node_DynamicCast_bSuccess_2) == 0x000040, "Member 'ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager, K2Node_DynamicCast_AsPlayer_State_BP) == 0x000048, "Member 'ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager::K2Node_DynamicCast_AsPlayer_State_BP' has a wrong offset!");
static_assert(offsetof(ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager, K2Node_DynamicCast_bSuccess_3) == 0x000050, "Member 'ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000051, "Member 'ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x000052, "Member 'ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager, CallFunc_ApplyDamage_ReturnValue_1) == 0x000054, "Member 'ServerCannonDamager_C_ExecuteUbergraph_ServerCannonDamager::CallFunc_ApplyDamage_ReturnValue_1' has a wrong offset!");

}

