#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ServerBlunderDamager

#include "Basic.hpp"


namespace SDK::Params
{

// Function ServerBlunderDamager.ServerBlunderDamager_C.ExecuteUbergraph_ServerBlunderDamager
// 0x0058 (0x0058 - 0x0000)
struct ServerBlunderDamager_C_ExecuteUbergraph_ServerBlunderDamager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARocketeerFunny_C*                      K2Node_DynamicCast_AsRocketeer_Funny;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player_1;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_ApplyDamage_ReturnValue;                  // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ApplyDamage_ReturnValue_1;                // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ServerBlunderDamager_C_ExecuteUbergraph_ServerBlunderDamager) == 0x000008, "Wrong alignment on ServerBlunderDamager_C_ExecuteUbergraph_ServerBlunderDamager");
static_assert(sizeof(ServerBlunderDamager_C_ExecuteUbergraph_ServerBlunderDamager) == 0x000058, "Wrong size on ServerBlunderDamager_C_ExecuteUbergraph_ServerBlunderDamager");
static_assert(offsetof(ServerBlunderDamager_C_ExecuteUbergraph_ServerBlunderDamager, EntryPoint) == 0x000000, "Member 'ServerBlunderDamager_C_ExecuteUbergraph_ServerBlunderDamager::EntryPoint' has a wrong offset!");
static_assert(offsetof(ServerBlunderDamager_C_ExecuteUbergraph_ServerBlunderDamager, K2Node_DynamicCast_AsRocketeer_Funny) == 0x000008, "Member 'ServerBlunderDamager_C_ExecuteUbergraph_ServerBlunderDamager::K2Node_DynamicCast_AsRocketeer_Funny' has a wrong offset!");
static_assert(offsetof(ServerBlunderDamager_C_ExecuteUbergraph_ServerBlunderDamager, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'ServerBlunderDamager_C_ExecuteUbergraph_ServerBlunderDamager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ServerBlunderDamager_C_ExecuteUbergraph_ServerBlunderDamager, CallFunc_GetDisplayName_ReturnValue) == 0x000018, "Member 'ServerBlunderDamager_C_ExecuteUbergraph_ServerBlunderDamager::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerBlunderDamager_C_ExecuteUbergraph_ServerBlunderDamager, K2Node_DynamicCast_AsTrain_Gus_Player) == 0x000028, "Member 'ServerBlunderDamager_C_ExecuteUbergraph_ServerBlunderDamager::K2Node_DynamicCast_AsTrain_Gus_Player' has a wrong offset!");
static_assert(offsetof(ServerBlunderDamager_C_ExecuteUbergraph_ServerBlunderDamager, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'ServerBlunderDamager_C_ExecuteUbergraph_ServerBlunderDamager::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ServerBlunderDamager_C_ExecuteUbergraph_ServerBlunderDamager, CallFunc_GetOwner_ReturnValue) == 0x000038, "Member 'ServerBlunderDamager_C_ExecuteUbergraph_ServerBlunderDamager::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerBlunderDamager_C_ExecuteUbergraph_ServerBlunderDamager, K2Node_DynamicCast_AsTrain_Gus_Player_1) == 0x000040, "Member 'ServerBlunderDamager_C_ExecuteUbergraph_ServerBlunderDamager::K2Node_DynamicCast_AsTrain_Gus_Player_1' has a wrong offset!");
static_assert(offsetof(ServerBlunderDamager_C_ExecuteUbergraph_ServerBlunderDamager, K2Node_DynamicCast_bSuccess_2) == 0x000048, "Member 'ServerBlunderDamager_C_ExecuteUbergraph_ServerBlunderDamager::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ServerBlunderDamager_C_ExecuteUbergraph_ServerBlunderDamager, CallFunc_ApplyDamage_ReturnValue) == 0x00004C, "Member 'ServerBlunderDamager_C_ExecuteUbergraph_ServerBlunderDamager::CallFunc_ApplyDamage_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerBlunderDamager_C_ExecuteUbergraph_ServerBlunderDamager, CallFunc_ApplyDamage_ReturnValue_1) == 0x000050, "Member 'ServerBlunderDamager_C_ExecuteUbergraph_ServerBlunderDamager::CallFunc_ApplyDamage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ServerBlunderDamager_C_ExecuteUbergraph_ServerBlunderDamager, Temp_bool_IsClosed_Variable) == 0x000054, "Member 'ServerBlunderDamager_C_ExecuteUbergraph_ServerBlunderDamager::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(ServerBlunderDamager_C_ExecuteUbergraph_ServerBlunderDamager, Temp_bool_Has_Been_Initd_Variable) == 0x000055, "Member 'ServerBlunderDamager_C_ExecuteUbergraph_ServerBlunderDamager::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");

}

