#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpawnMenu_Tutorial_Island

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function SpawnMenu_Tutorial_Island.SpawnMenu_Tutorial_Island_C.Tick
// 0x0048 (0x0048 - 0x0000)
struct SpawnMenu_Tutorial_Island_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpawnMenu_Tutorial_Island_C_Tick) == 0x000008, "Wrong alignment on SpawnMenu_Tutorial_Island_C_Tick");
static_assert(sizeof(SpawnMenu_Tutorial_Island_C_Tick) == 0x000048, "Wrong size on SpawnMenu_Tutorial_Island_C_Tick");
static_assert(offsetof(SpawnMenu_Tutorial_Island_C_Tick, MyGeometry) == 0x000000, "Member 'SpawnMenu_Tutorial_Island_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(SpawnMenu_Tutorial_Island_C_Tick, InDeltaTime) == 0x000040, "Member 'SpawnMenu_Tutorial_Island_C_Tick::InDeltaTime' has a wrong offset!");

// Function SpawnMenu_Tutorial_Island.SpawnMenu_Tutorial_Island_C.ExecuteUbergraph_SpawnMenu_Tutorial_Island
// 0x00B8 (0x00B8 - 0x0000)
struct SpawnMenu_Tutorial_Island_C_ExecuteUbergraph_SpawnMenu_Tutorial_Island final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0010(0x0040)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AStarterSpectate2_C*                    K2Node_DynamicCast_AsStarter_Spectate_2;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADeadSpectate_C*                        K2Node_DynamicCast_AsDead_Spectate;                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue;               // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpawnMenu_Tutorial_Island_C_ExecuteUbergraph_SpawnMenu_Tutorial_Island) == 0x000008, "Wrong alignment on SpawnMenu_Tutorial_Island_C_ExecuteUbergraph_SpawnMenu_Tutorial_Island");
static_assert(sizeof(SpawnMenu_Tutorial_Island_C_ExecuteUbergraph_SpawnMenu_Tutorial_Island) == 0x0000B8, "Wrong size on SpawnMenu_Tutorial_Island_C_ExecuteUbergraph_SpawnMenu_Tutorial_Island");
static_assert(offsetof(SpawnMenu_Tutorial_Island_C_ExecuteUbergraph_SpawnMenu_Tutorial_Island, EntryPoint) == 0x000000, "Member 'SpawnMenu_Tutorial_Island_C_ExecuteUbergraph_SpawnMenu_Tutorial_Island::EntryPoint' has a wrong offset!");
static_assert(offsetof(SpawnMenu_Tutorial_Island_C_ExecuteUbergraph_SpawnMenu_Tutorial_Island, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'SpawnMenu_Tutorial_Island_C_ExecuteUbergraph_SpawnMenu_Tutorial_Island::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnMenu_Tutorial_Island_C_ExecuteUbergraph_SpawnMenu_Tutorial_Island, K2Node_Event_MyGeometry) == 0x000010, "Member 'SpawnMenu_Tutorial_Island_C_ExecuteUbergraph_SpawnMenu_Tutorial_Island::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(SpawnMenu_Tutorial_Island_C_ExecuteUbergraph_SpawnMenu_Tutorial_Island, K2Node_Event_InDeltaTime) == 0x000050, "Member 'SpawnMenu_Tutorial_Island_C_ExecuteUbergraph_SpawnMenu_Tutorial_Island::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(SpawnMenu_Tutorial_Island_C_ExecuteUbergraph_SpawnMenu_Tutorial_Island, CallFunc_GetPlayerPawn_ReturnValue) == 0x000058, "Member 'SpawnMenu_Tutorial_Island_C_ExecuteUbergraph_SpawnMenu_Tutorial_Island::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnMenu_Tutorial_Island_C_ExecuteUbergraph_SpawnMenu_Tutorial_Island, K2Node_DynamicCast_AsStarter_Spectate_2) == 0x000060, "Member 'SpawnMenu_Tutorial_Island_C_ExecuteUbergraph_SpawnMenu_Tutorial_Island::K2Node_DynamicCast_AsStarter_Spectate_2' has a wrong offset!");
static_assert(offsetof(SpawnMenu_Tutorial_Island_C_ExecuteUbergraph_SpawnMenu_Tutorial_Island, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'SpawnMenu_Tutorial_Island_C_ExecuteUbergraph_SpawnMenu_Tutorial_Island::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SpawnMenu_Tutorial_Island_C_ExecuteUbergraph_SpawnMenu_Tutorial_Island, K2Node_DynamicCast_AsDead_Spectate) == 0x000070, "Member 'SpawnMenu_Tutorial_Island_C_ExecuteUbergraph_SpawnMenu_Tutorial_Island::K2Node_DynamicCast_AsDead_Spectate' has a wrong offset!");
static_assert(offsetof(SpawnMenu_Tutorial_Island_C_ExecuteUbergraph_SpawnMenu_Tutorial_Island, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'SpawnMenu_Tutorial_Island_C_ExecuteUbergraph_SpawnMenu_Tutorial_Island::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SpawnMenu_Tutorial_Island_C_ExecuteUbergraph_SpawnMenu_Tutorial_Island, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x000080, "Member 'SpawnMenu_Tutorial_Island_C_ExecuteUbergraph_SpawnMenu_Tutorial_Island::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpawnMenu_Tutorial_Island_C_ExecuteUbergraph_SpawnMenu_Tutorial_Island, K2Node_DynamicCast_AsTrain_Gus_Player) == 0x000088, "Member 'SpawnMenu_Tutorial_Island_C_ExecuteUbergraph_SpawnMenu_Tutorial_Island::K2Node_DynamicCast_AsTrain_Gus_Player' has a wrong offset!");
static_assert(offsetof(SpawnMenu_Tutorial_Island_C_ExecuteUbergraph_SpawnMenu_Tutorial_Island, K2Node_DynamicCast_bSuccess_2) == 0x000090, "Member 'SpawnMenu_Tutorial_Island_C_ExecuteUbergraph_SpawnMenu_Tutorial_Island::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(SpawnMenu_Tutorial_Island_C_ExecuteUbergraph_SpawnMenu_Tutorial_Island, CallFunc_GetPlayerController_ReturnValue) == 0x000098, "Member 'SpawnMenu_Tutorial_Island_C_ExecuteUbergraph_SpawnMenu_Tutorial_Island::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnMenu_Tutorial_Island_C_ExecuteUbergraph_SpawnMenu_Tutorial_Island, CallFunc_GetPlayerState_ReturnValue) == 0x0000A0, "Member 'SpawnMenu_Tutorial_Island_C_ExecuteUbergraph_SpawnMenu_Tutorial_Island::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnMenu_Tutorial_Island_C_ExecuteUbergraph_SpawnMenu_Tutorial_Island, K2Node_DynamicCast_AsPlayer_State_BP) == 0x0000A8, "Member 'SpawnMenu_Tutorial_Island_C_ExecuteUbergraph_SpawnMenu_Tutorial_Island::K2Node_DynamicCast_AsPlayer_State_BP' has a wrong offset!");
static_assert(offsetof(SpawnMenu_Tutorial_Island_C_ExecuteUbergraph_SpawnMenu_Tutorial_Island, K2Node_DynamicCast_bSuccess_3) == 0x0000B0, "Member 'SpawnMenu_Tutorial_Island_C_ExecuteUbergraph_SpawnMenu_Tutorial_Island::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");

}

