#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpawnMenu_Tutorial_Island

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SpawnMenu_Tutorial_Island.SpawnMenu_Tutorial_Island_C
// 0x0018 (0x02A8 - 0x0290)
class USpawnMenu_Tutorial_Island_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       fade_in;                                           // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_0;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void ExecuteUbergraph_SpawnMenu_Tutorial_Island(int32 EntryPoint);
	void Construct();
	void BndEvt__SpawnMenu_Button_0_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SpawnMenu_Tutorial_Island_C">();
	}
	static class USpawnMenu_Tutorial_Island_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpawnMenu_Tutorial_Island_C>();
	}
};
static_assert(alignof(USpawnMenu_Tutorial_Island_C) == 0x000008, "Wrong alignment on USpawnMenu_Tutorial_Island_C");
static_assert(sizeof(USpawnMenu_Tutorial_Island_C) == 0x0002A8, "Wrong size on USpawnMenu_Tutorial_Island_C");
static_assert(offsetof(USpawnMenu_Tutorial_Island_C, UberGraphFrame) == 0x000290, "Member 'USpawnMenu_Tutorial_Island_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USpawnMenu_Tutorial_Island_C, fade_in) == 0x000298, "Member 'USpawnMenu_Tutorial_Island_C::fade_in' has a wrong offset!");
static_assert(offsetof(USpawnMenu_Tutorial_Island_C, Button_0) == 0x0002A0, "Member 'USpawnMenu_Tutorial_Island_C::Button_0' has a wrong offset!");

}

