#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpawnMenu_FacingForts

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SpawnMenu_FacingForts.SpawnMenu_FacingForts_C
// 0x0110 (0x03A0 - 0x0290)
class USpawnMenu_FacingForts_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       fade_in;                                           // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ChangeCosmeticButton;                              // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircularThrobber*                      CircularThrobber_0;                                // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                DocksButton;                                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                RandomSpawnButton;                                 // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_0;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_1;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector                                SpawnPoint_Dock1;                                  // 0x02E0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpawnPoint_Dock2;                                  // 0x02F8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Spire_Hills;                                       // 0x0310(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Spire_Rear;                                        // 0x0328(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Spire_1;                                           // 0x0340(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Spire_2;                                           // 0x0358(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Can_Respawn_;                                      // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveGame*                              SaveItems;                                         // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Weapon_1;                                          // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Weapon_2;                                          // 0x0384(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Title_Number;                                      // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Skin_Number;                                       // 0x038C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Team;                                              // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HatNumber;                                         // 0x0394(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Authority;                                         // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void InpActEvt_SpaceBar_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void Goofer();
	void ExecuteUbergraph_SpawnMenu_FacingForts(int32 EntryPoint);
	void Construct();
	void BndEvt__SpawnMenu_The_Spire_ChangeCosmeticButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__SpawnMenu_The_Spire_Button_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__SpawnMenu_The_Spire_Button_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SpawnMenu_FacingForts_C">();
	}
	static class USpawnMenu_FacingForts_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpawnMenu_FacingForts_C>();
	}
};
static_assert(alignof(USpawnMenu_FacingForts_C) == 0x000008, "Wrong alignment on USpawnMenu_FacingForts_C");
static_assert(sizeof(USpawnMenu_FacingForts_C) == 0x0003A0, "Wrong size on USpawnMenu_FacingForts_C");
static_assert(offsetof(USpawnMenu_FacingForts_C, UberGraphFrame) == 0x000290, "Member 'USpawnMenu_FacingForts_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USpawnMenu_FacingForts_C, fade_in) == 0x000298, "Member 'USpawnMenu_FacingForts_C::fade_in' has a wrong offset!");
static_assert(offsetof(USpawnMenu_FacingForts_C, Button) == 0x0002A0, "Member 'USpawnMenu_FacingForts_C::Button' has a wrong offset!");
static_assert(offsetof(USpawnMenu_FacingForts_C, ChangeCosmeticButton) == 0x0002A8, "Member 'USpawnMenu_FacingForts_C::ChangeCosmeticButton' has a wrong offset!");
static_assert(offsetof(USpawnMenu_FacingForts_C, CircularThrobber_0) == 0x0002B0, "Member 'USpawnMenu_FacingForts_C::CircularThrobber_0' has a wrong offset!");
static_assert(offsetof(USpawnMenu_FacingForts_C, DocksButton) == 0x0002B8, "Member 'USpawnMenu_FacingForts_C::DocksButton' has a wrong offset!");
static_assert(offsetof(USpawnMenu_FacingForts_C, Image_1) == 0x0002C0, "Member 'USpawnMenu_FacingForts_C::Image_1' has a wrong offset!");
static_assert(offsetof(USpawnMenu_FacingForts_C, RandomSpawnButton) == 0x0002C8, "Member 'USpawnMenu_FacingForts_C::RandomSpawnButton' has a wrong offset!");
static_assert(offsetof(USpawnMenu_FacingForts_C, TextBlock_0) == 0x0002D0, "Member 'USpawnMenu_FacingForts_C::TextBlock_0' has a wrong offset!");
static_assert(offsetof(USpawnMenu_FacingForts_C, TextBlock_1) == 0x0002D8, "Member 'USpawnMenu_FacingForts_C::TextBlock_1' has a wrong offset!");
static_assert(offsetof(USpawnMenu_FacingForts_C, SpawnPoint_Dock1) == 0x0002E0, "Member 'USpawnMenu_FacingForts_C::SpawnPoint_Dock1' has a wrong offset!");
static_assert(offsetof(USpawnMenu_FacingForts_C, SpawnPoint_Dock2) == 0x0002F8, "Member 'USpawnMenu_FacingForts_C::SpawnPoint_Dock2' has a wrong offset!");
static_assert(offsetof(USpawnMenu_FacingForts_C, Spire_Hills) == 0x000310, "Member 'USpawnMenu_FacingForts_C::Spire_Hills' has a wrong offset!");
static_assert(offsetof(USpawnMenu_FacingForts_C, Spire_Rear) == 0x000328, "Member 'USpawnMenu_FacingForts_C::Spire_Rear' has a wrong offset!");
static_assert(offsetof(USpawnMenu_FacingForts_C, Spire_1) == 0x000340, "Member 'USpawnMenu_FacingForts_C::Spire_1' has a wrong offset!");
static_assert(offsetof(USpawnMenu_FacingForts_C, Spire_2) == 0x000358, "Member 'USpawnMenu_FacingForts_C::Spire_2' has a wrong offset!");
static_assert(offsetof(USpawnMenu_FacingForts_C, Can_Respawn_) == 0x000370, "Member 'USpawnMenu_FacingForts_C::Can_Respawn_' has a wrong offset!");
static_assert(offsetof(USpawnMenu_FacingForts_C, SaveItems) == 0x000378, "Member 'USpawnMenu_FacingForts_C::SaveItems' has a wrong offset!");
static_assert(offsetof(USpawnMenu_FacingForts_C, Weapon_1) == 0x000380, "Member 'USpawnMenu_FacingForts_C::Weapon_1' has a wrong offset!");
static_assert(offsetof(USpawnMenu_FacingForts_C, Weapon_2) == 0x000384, "Member 'USpawnMenu_FacingForts_C::Weapon_2' has a wrong offset!");
static_assert(offsetof(USpawnMenu_FacingForts_C, Title_Number) == 0x000388, "Member 'USpawnMenu_FacingForts_C::Title_Number' has a wrong offset!");
static_assert(offsetof(USpawnMenu_FacingForts_C, Skin_Number) == 0x00038C, "Member 'USpawnMenu_FacingForts_C::Skin_Number' has a wrong offset!");
static_assert(offsetof(USpawnMenu_FacingForts_C, Team) == 0x000390, "Member 'USpawnMenu_FacingForts_C::Team' has a wrong offset!");
static_assert(offsetof(USpawnMenu_FacingForts_C, HatNumber) == 0x000394, "Member 'USpawnMenu_FacingForts_C::HatNumber' has a wrong offset!");
static_assert(offsetof(USpawnMenu_FacingForts_C, Authority) == 0x000398, "Member 'USpawnMenu_FacingForts_C::Authority' has a wrong offset!");

}

