#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpawnMenu_TDMer_Island

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SpawnMenu_TDMer_Island.SpawnMenu_TDMer_Island_C
// 0x0068 (0x02F8 - 0x0290)
class USpawnMenu_TDMer_Island_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       fade_in;                                           // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_0;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ChangeCosmeticButton;                              // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircularThrobber*                      CircularThrobber_0;                                // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                RandomSpawnButton;                                 // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_0;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_1;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Weapon_1;                                          // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Weapon_2;                                          // 0x02DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveGame*                              SaveItems;                                         // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Title_Number;                                      // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HatNumber;                                         // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Skin_Number;                                       // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Authority;                                         // 0x02F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void ExecuteUbergraph_SpawnMenu_TDMer_Island(int32 EntryPoint);
	void Construct();
	void BndEvt__SpawnMenu_TDMer_Island_RandomSpawnButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__SpawnMenu_TDMer_Island_ChangeCosmeticButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__SpawnMenu_TDMer_Island_Button_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SpawnMenu_TDMer_Island_C">();
	}
	static class USpawnMenu_TDMer_Island_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpawnMenu_TDMer_Island_C>();
	}
};
static_assert(alignof(USpawnMenu_TDMer_Island_C) == 0x000008, "Wrong alignment on USpawnMenu_TDMer_Island_C");
static_assert(sizeof(USpawnMenu_TDMer_Island_C) == 0x0002F8, "Wrong size on USpawnMenu_TDMer_Island_C");
static_assert(offsetof(USpawnMenu_TDMer_Island_C, UberGraphFrame) == 0x000290, "Member 'USpawnMenu_TDMer_Island_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USpawnMenu_TDMer_Island_C, fade_in) == 0x000298, "Member 'USpawnMenu_TDMer_Island_C::fade_in' has a wrong offset!");
static_assert(offsetof(USpawnMenu_TDMer_Island_C, Button) == 0x0002A0, "Member 'USpawnMenu_TDMer_Island_C::Button' has a wrong offset!");
static_assert(offsetof(USpawnMenu_TDMer_Island_C, Button_0) == 0x0002A8, "Member 'USpawnMenu_TDMer_Island_C::Button_0' has a wrong offset!");
static_assert(offsetof(USpawnMenu_TDMer_Island_C, ChangeCosmeticButton) == 0x0002B0, "Member 'USpawnMenu_TDMer_Island_C::ChangeCosmeticButton' has a wrong offset!");
static_assert(offsetof(USpawnMenu_TDMer_Island_C, CircularThrobber_0) == 0x0002B8, "Member 'USpawnMenu_TDMer_Island_C::CircularThrobber_0' has a wrong offset!");
static_assert(offsetof(USpawnMenu_TDMer_Island_C, RandomSpawnButton) == 0x0002C0, "Member 'USpawnMenu_TDMer_Island_C::RandomSpawnButton' has a wrong offset!");
static_assert(offsetof(USpawnMenu_TDMer_Island_C, TextBlock_0) == 0x0002C8, "Member 'USpawnMenu_TDMer_Island_C::TextBlock_0' has a wrong offset!");
static_assert(offsetof(USpawnMenu_TDMer_Island_C, TextBlock_1) == 0x0002D0, "Member 'USpawnMenu_TDMer_Island_C::TextBlock_1' has a wrong offset!");
static_assert(offsetof(USpawnMenu_TDMer_Island_C, Weapon_1) == 0x0002D8, "Member 'USpawnMenu_TDMer_Island_C::Weapon_1' has a wrong offset!");
static_assert(offsetof(USpawnMenu_TDMer_Island_C, Weapon_2) == 0x0002DC, "Member 'USpawnMenu_TDMer_Island_C::Weapon_2' has a wrong offset!");
static_assert(offsetof(USpawnMenu_TDMer_Island_C, SaveItems) == 0x0002E0, "Member 'USpawnMenu_TDMer_Island_C::SaveItems' has a wrong offset!");
static_assert(offsetof(USpawnMenu_TDMer_Island_C, Title_Number) == 0x0002E8, "Member 'USpawnMenu_TDMer_Island_C::Title_Number' has a wrong offset!");
static_assert(offsetof(USpawnMenu_TDMer_Island_C, HatNumber) == 0x0002EC, "Member 'USpawnMenu_TDMer_Island_C::HatNumber' has a wrong offset!");
static_assert(offsetof(USpawnMenu_TDMer_Island_C, Skin_Number) == 0x0002F0, "Member 'USpawnMenu_TDMer_Island_C::Skin_Number' has a wrong offset!");
static_assert(offsetof(USpawnMenu_TDMer_Island_C, Authority) == 0x0002F4, "Member 'USpawnMenu_TDMer_Island_C::Authority' has a wrong offset!");

}

