#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Spectate_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Spectate_BP.Spectate_BP_C.InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_0
// 0x0018 (0x0018 - 0x0000)
struct Spectate_BP_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(Spectate_BP_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_0) == 0x000008, "Wrong alignment on Spectate_BP_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_0");
static_assert(sizeof(Spectate_BP_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_0) == 0x000018, "Wrong size on Spectate_BP_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_0");
static_assert(offsetof(Spectate_BP_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_0, Key) == 0x000000, "Member 'Spectate_BP_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_0::Key' has a wrong offset!");

// Function Spectate_BP.Spectate_BP_C.InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_1
// 0x0018 (0x0018 - 0x0000)
struct Spectate_BP_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(Spectate_BP_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_1) == 0x000008, "Wrong alignment on Spectate_BP_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_1");
static_assert(sizeof(Spectate_BP_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_1) == 0x000018, "Wrong size on Spectate_BP_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_1");
static_assert(offsetof(Spectate_BP_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_1, Key) == 0x000000, "Member 'Spectate_BP_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_1::Key' has a wrong offset!");

// Function Spectate_BP.Spectate_BP_C.ExecuteUbergraph_Spectate_BP
// 0x02F0 (0x02F0 - 0x0000)
struct Spectate_BP_C_ExecuteUbergraph_Spectate_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0060)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveOptions_C*                         K2Node_DynamicCast_AsSave_Options;                 // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACloseTheDamnWinde_C*                   CallFunc_FinishSpawningActor_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_1;                        // 0x0090(0x0018)(HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x00C0(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue;            // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue;             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x00F0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<class AMenugus_C*>                     CallFunc_GetAllActorsOfClass_OutActors;            // 0x01D8(0x0010)(ReferenceParm)
	uint8                                         Pad_1E8[0x8];                                      // 0x01E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x01F0(0x0060)(IsPlainOldData, NoDestructor)
	class AMenugus_C*                             CallFunc_Array_Get_Item;                           // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMenugus_C*                             K2Node_DynamicCast_AsMenugus;                      // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWidgetHelperWindowDoer_C*              CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AMenugus_C*>                     CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x0278(0x0010)(ReferenceParm)
	class AMenugus_C*                             CallFunc_Array_Get_Item_1;                         // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMenugus_C*                             K2Node_DynamicCast_AsMenugus_1;                    // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A2[0x6];                                      // 0x02A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AScrollableWantedPosterBoard_C*> CallFunc_GetAllActorsOfClass_OutActors_2;          // 0x02A8(0x0010)(ReferenceParm)
	TArray<class AScrollableWantedPosterBoard_C*> CallFunc_GetAllActorsOfClass_OutActors_3;          // 0x02B8(0x0010)(ReferenceParm)
	class AScrollableWantedPosterBoard_C*         CallFunc_Array_Get_Item_2;                         // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AScrollableWantedPosterBoard_C*         CallFunc_Array_Get_Item_3;                         // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x02D8(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(Spectate_BP_C_ExecuteUbergraph_Spectate_BP) == 0x000010, "Wrong alignment on Spectate_BP_C_ExecuteUbergraph_Spectate_BP");
static_assert(sizeof(Spectate_BP_C_ExecuteUbergraph_Spectate_BP) == 0x0002F0, "Wrong size on Spectate_BP_C_ExecuteUbergraph_Spectate_BP");
static_assert(offsetof(Spectate_BP_C_ExecuteUbergraph_Spectate_BP, EntryPoint) == 0x000000, "Member 'Spectate_BP_C_ExecuteUbergraph_Spectate_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Spectate_BP_C_ExecuteUbergraph_Spectate_BP, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'Spectate_BP_C_ExecuteUbergraph_Spectate_BP::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spectate_BP_C_ExecuteUbergraph_Spectate_BP, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000070, "Member 'Spectate_BP_C_ExecuteUbergraph_Spectate_BP::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spectate_BP_C_ExecuteUbergraph_Spectate_BP, K2Node_DynamicCast_AsSave_Options) == 0x000078, "Member 'Spectate_BP_C_ExecuteUbergraph_Spectate_BP::K2Node_DynamicCast_AsSave_Options' has a wrong offset!");
static_assert(offsetof(Spectate_BP_C_ExecuteUbergraph_Spectate_BP, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'Spectate_BP_C_ExecuteUbergraph_Spectate_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Spectate_BP_C_ExecuteUbergraph_Spectate_BP, CallFunc_FinishSpawningActor_ReturnValue) == 0x000088, "Member 'Spectate_BP_C_ExecuteUbergraph_Spectate_BP::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spectate_BP_C_ExecuteUbergraph_Spectate_BP, K2Node_InputKeyEvent_Key_1) == 0x000090, "Member 'Spectate_BP_C_ExecuteUbergraph_Spectate_BP::K2Node_InputKeyEvent_Key_1' has a wrong offset!");
static_assert(offsetof(Spectate_BP_C_ExecuteUbergraph_Spectate_BP, CallFunc_VLerp_ReturnValue) == 0x0000A8, "Member 'Spectate_BP_C_ExecuteUbergraph_Spectate_BP::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spectate_BP_C_ExecuteUbergraph_Spectate_BP, K2Node_InputKeyEvent_Key) == 0x0000C0, "Member 'Spectate_BP_C_ExecuteUbergraph_Spectate_BP::K2Node_InputKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(Spectate_BP_C_ExecuteUbergraph_Spectate_BP, CallFunc_DoesSaveGameExist_ReturnValue) == 0x0000D8, "Member 'Spectate_BP_C_ExecuteUbergraph_Spectate_BP::CallFunc_DoesSaveGameExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spectate_BP_C_ExecuteUbergraph_Spectate_BP, CallFunc_LoadGameFromSlot_ReturnValue) == 0x0000E0, "Member 'Spectate_BP_C_ExecuteUbergraph_Spectate_BP::CallFunc_LoadGameFromSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spectate_BP_C_ExecuteUbergraph_Spectate_BP, Temp_bool_Variable) == 0x0000E8, "Member 'Spectate_BP_C_ExecuteUbergraph_Spectate_BP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Spectate_BP_C_ExecuteUbergraph_Spectate_BP, CallFunc_Not_PreBool_ReturnValue) == 0x0000E9, "Member 'Spectate_BP_C_ExecuteUbergraph_Spectate_BP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spectate_BP_C_ExecuteUbergraph_Spectate_BP, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0000F0, "Member 'Spectate_BP_C_ExecuteUbergraph_Spectate_BP::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Spectate_BP_C_ExecuteUbergraph_Spectate_BP, CallFunc_GetAllActorsOfClass_OutActors) == 0x0001D8, "Member 'Spectate_BP_C_ExecuteUbergraph_Spectate_BP::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(Spectate_BP_C_ExecuteUbergraph_Spectate_BP, CallFunc_MakeTransform_ReturnValue_1) == 0x0001F0, "Member 'Spectate_BP_C_ExecuteUbergraph_Spectate_BP::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Spectate_BP_C_ExecuteUbergraph_Spectate_BP, CallFunc_Array_Get_Item) == 0x000250, "Member 'Spectate_BP_C_ExecuteUbergraph_Spectate_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Spectate_BP_C_ExecuteUbergraph_Spectate_BP, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000258, "Member 'Spectate_BP_C_ExecuteUbergraph_Spectate_BP::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Spectate_BP_C_ExecuteUbergraph_Spectate_BP, K2Node_DynamicCast_AsMenugus) == 0x000260, "Member 'Spectate_BP_C_ExecuteUbergraph_Spectate_BP::K2Node_DynamicCast_AsMenugus' has a wrong offset!");
static_assert(offsetof(Spectate_BP_C_ExecuteUbergraph_Spectate_BP, K2Node_DynamicCast_bSuccess_1) == 0x000268, "Member 'Spectate_BP_C_ExecuteUbergraph_Spectate_BP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Spectate_BP_C_ExecuteUbergraph_Spectate_BP, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000270, "Member 'Spectate_BP_C_ExecuteUbergraph_Spectate_BP::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Spectate_BP_C_ExecuteUbergraph_Spectate_BP, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x000278, "Member 'Spectate_BP_C_ExecuteUbergraph_Spectate_BP::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(Spectate_BP_C_ExecuteUbergraph_Spectate_BP, CallFunc_Array_Get_Item_1) == 0x000288, "Member 'Spectate_BP_C_ExecuteUbergraph_Spectate_BP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Spectate_BP_C_ExecuteUbergraph_Spectate_BP, Temp_bool_Variable_1) == 0x000290, "Member 'Spectate_BP_C_ExecuteUbergraph_Spectate_BP::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Spectate_BP_C_ExecuteUbergraph_Spectate_BP, K2Node_DynamicCast_AsMenugus_1) == 0x000298, "Member 'Spectate_BP_C_ExecuteUbergraph_Spectate_BP::K2Node_DynamicCast_AsMenugus_1' has a wrong offset!");
static_assert(offsetof(Spectate_BP_C_ExecuteUbergraph_Spectate_BP, K2Node_DynamicCast_bSuccess_2) == 0x0002A0, "Member 'Spectate_BP_C_ExecuteUbergraph_Spectate_BP::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Spectate_BP_C_ExecuteUbergraph_Spectate_BP, CallFunc_Not_PreBool_ReturnValue_1) == 0x0002A1, "Member 'Spectate_BP_C_ExecuteUbergraph_Spectate_BP::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Spectate_BP_C_ExecuteUbergraph_Spectate_BP, CallFunc_GetAllActorsOfClass_OutActors_2) == 0x0002A8, "Member 'Spectate_BP_C_ExecuteUbergraph_Spectate_BP::CallFunc_GetAllActorsOfClass_OutActors_2' has a wrong offset!");
static_assert(offsetof(Spectate_BP_C_ExecuteUbergraph_Spectate_BP, CallFunc_GetAllActorsOfClass_OutActors_3) == 0x0002B8, "Member 'Spectate_BP_C_ExecuteUbergraph_Spectate_BP::CallFunc_GetAllActorsOfClass_OutActors_3' has a wrong offset!");
static_assert(offsetof(Spectate_BP_C_ExecuteUbergraph_Spectate_BP, CallFunc_Array_Get_Item_2) == 0x0002C8, "Member 'Spectate_BP_C_ExecuteUbergraph_Spectate_BP::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Spectate_BP_C_ExecuteUbergraph_Spectate_BP, CallFunc_Array_Get_Item_3) == 0x0002D0, "Member 'Spectate_BP_C_ExecuteUbergraph_Spectate_BP::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(Spectate_BP_C_ExecuteUbergraph_Spectate_BP, K2Node_CreateDelegate_OutputDelegate) == 0x0002D8, "Member 'Spectate_BP_C_ExecuteUbergraph_Spectate_BP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

}

