#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TauntMenuWidget

#include "Basic.hpp"

#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function TauntMenuWidget.TauntMenuWidget_C.InpActEvt_Two_K2Node_InputKeyEvent_0
// 0x0018 (0x0018 - 0x0000)
struct TauntMenuWidget_C_InpActEvt_Two_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(TauntMenuWidget_C_InpActEvt_Two_K2Node_InputKeyEvent_0) == 0x000008, "Wrong alignment on TauntMenuWidget_C_InpActEvt_Two_K2Node_InputKeyEvent_0");
static_assert(sizeof(TauntMenuWidget_C_InpActEvt_Two_K2Node_InputKeyEvent_0) == 0x000018, "Wrong size on TauntMenuWidget_C_InpActEvt_Two_K2Node_InputKeyEvent_0");
static_assert(offsetof(TauntMenuWidget_C_InpActEvt_Two_K2Node_InputKeyEvent_0, Key) == 0x000000, "Member 'TauntMenuWidget_C_InpActEvt_Two_K2Node_InputKeyEvent_0::Key' has a wrong offset!");

// Function TauntMenuWidget.TauntMenuWidget_C.InpActEvt_One_K2Node_InputKeyEvent_2
// 0x0018 (0x0018 - 0x0000)
struct TauntMenuWidget_C_InpActEvt_One_K2Node_InputKeyEvent_2 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(TauntMenuWidget_C_InpActEvt_One_K2Node_InputKeyEvent_2) == 0x000008, "Wrong alignment on TauntMenuWidget_C_InpActEvt_One_K2Node_InputKeyEvent_2");
static_assert(sizeof(TauntMenuWidget_C_InpActEvt_One_K2Node_InputKeyEvent_2) == 0x000018, "Wrong size on TauntMenuWidget_C_InpActEvt_One_K2Node_InputKeyEvent_2");
static_assert(offsetof(TauntMenuWidget_C_InpActEvt_One_K2Node_InputKeyEvent_2, Key) == 0x000000, "Member 'TauntMenuWidget_C_InpActEvt_One_K2Node_InputKeyEvent_2::Key' has a wrong offset!");

// Function TauntMenuWidget.TauntMenuWidget_C.InpActEvt_G_K2Node_InputKeyEvent_1
// 0x0018 (0x0018 - 0x0000)
struct TauntMenuWidget_C_InpActEvt_G_K2Node_InputKeyEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(TauntMenuWidget_C_InpActEvt_G_K2Node_InputKeyEvent_1) == 0x000008, "Wrong alignment on TauntMenuWidget_C_InpActEvt_G_K2Node_InputKeyEvent_1");
static_assert(sizeof(TauntMenuWidget_C_InpActEvt_G_K2Node_InputKeyEvent_1) == 0x000018, "Wrong size on TauntMenuWidget_C_InpActEvt_G_K2Node_InputKeyEvent_1");
static_assert(offsetof(TauntMenuWidget_C_InpActEvt_G_K2Node_InputKeyEvent_1, Key) == 0x000000, "Member 'TauntMenuWidget_C_InpActEvt_G_K2Node_InputKeyEvent_1::Key' has a wrong offset!");

// Function TauntMenuWidget.TauntMenuWidget_C.ExecuteUbergraph_TauntMenuWidget
// 0x0098 (0x0098 - 0x0000)
struct TauntMenuWidget_C_ExecuteUbergraph_TauntMenuWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_1;                        // 0x0020(0x0018)(HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player_1;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0050(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_2;                        // 0x0068(0x0018)(HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_2;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player_2;           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TauntMenuWidget_C_ExecuteUbergraph_TauntMenuWidget) == 0x000008, "Wrong alignment on TauntMenuWidget_C_ExecuteUbergraph_TauntMenuWidget");
static_assert(sizeof(TauntMenuWidget_C_ExecuteUbergraph_TauntMenuWidget) == 0x000098, "Wrong size on TauntMenuWidget_C_ExecuteUbergraph_TauntMenuWidget");
static_assert(offsetof(TauntMenuWidget_C_ExecuteUbergraph_TauntMenuWidget, EntryPoint) == 0x000000, "Member 'TauntMenuWidget_C_ExecuteUbergraph_TauntMenuWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(TauntMenuWidget_C_ExecuteUbergraph_TauntMenuWidget, CallFunc_GetPlayerPawn_ReturnValue) == 0x000008, "Member 'TauntMenuWidget_C_ExecuteUbergraph_TauntMenuWidget::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(TauntMenuWidget_C_ExecuteUbergraph_TauntMenuWidget, K2Node_DynamicCast_AsTrain_Gus_Player) == 0x000010, "Member 'TauntMenuWidget_C_ExecuteUbergraph_TauntMenuWidget::K2Node_DynamicCast_AsTrain_Gus_Player' has a wrong offset!");
static_assert(offsetof(TauntMenuWidget_C_ExecuteUbergraph_TauntMenuWidget, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'TauntMenuWidget_C_ExecuteUbergraph_TauntMenuWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TauntMenuWidget_C_ExecuteUbergraph_TauntMenuWidget, K2Node_InputKeyEvent_Key_1) == 0x000020, "Member 'TauntMenuWidget_C_ExecuteUbergraph_TauntMenuWidget::K2Node_InputKeyEvent_Key_1' has a wrong offset!");
static_assert(offsetof(TauntMenuWidget_C_ExecuteUbergraph_TauntMenuWidget, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x000038, "Member 'TauntMenuWidget_C_ExecuteUbergraph_TauntMenuWidget::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TauntMenuWidget_C_ExecuteUbergraph_TauntMenuWidget, K2Node_DynamicCast_AsTrain_Gus_Player_1) == 0x000040, "Member 'TauntMenuWidget_C_ExecuteUbergraph_TauntMenuWidget::K2Node_DynamicCast_AsTrain_Gus_Player_1' has a wrong offset!");
static_assert(offsetof(TauntMenuWidget_C_ExecuteUbergraph_TauntMenuWidget, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'TauntMenuWidget_C_ExecuteUbergraph_TauntMenuWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(TauntMenuWidget_C_ExecuteUbergraph_TauntMenuWidget, K2Node_InputKeyEvent_Key) == 0x000050, "Member 'TauntMenuWidget_C_ExecuteUbergraph_TauntMenuWidget::K2Node_InputKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(TauntMenuWidget_C_ExecuteUbergraph_TauntMenuWidget, K2Node_InputKeyEvent_Key_2) == 0x000068, "Member 'TauntMenuWidget_C_ExecuteUbergraph_TauntMenuWidget::K2Node_InputKeyEvent_Key_2' has a wrong offset!");
static_assert(offsetof(TauntMenuWidget_C_ExecuteUbergraph_TauntMenuWidget, CallFunc_GetPlayerPawn_ReturnValue_2) == 0x000080, "Member 'TauntMenuWidget_C_ExecuteUbergraph_TauntMenuWidget::CallFunc_GetPlayerPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TauntMenuWidget_C_ExecuteUbergraph_TauntMenuWidget, K2Node_DynamicCast_AsTrain_Gus_Player_2) == 0x000088, "Member 'TauntMenuWidget_C_ExecuteUbergraph_TauntMenuWidget::K2Node_DynamicCast_AsTrain_Gus_Player_2' has a wrong offset!");
static_assert(offsetof(TauntMenuWidget_C_ExecuteUbergraph_TauntMenuWidget, K2Node_DynamicCast_bSuccess_2) == 0x000090, "Member 'TauntMenuWidget_C_ExecuteUbergraph_TauntMenuWidget::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

}

