#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TauntMenuWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TauntMenuWidget.TauntMenuWidget_C
// 0x0020 (0x02B0 - 0x0290)
class UTauntMenuWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image;                                             // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void InpActEvt_Two_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void InpActEvt_One_K2Node_InputKeyEvent_2(const struct FKey& Key);
	void InpActEvt_G_K2Node_InputKeyEvent_1(const struct FKey& Key);
	void ExecuteUbergraph_TauntMenuWidget(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TauntMenuWidget_C">();
	}
	static class UTauntMenuWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTauntMenuWidget_C>();
	}
};
static_assert(alignof(UTauntMenuWidget_C) == 0x000008, "Wrong alignment on UTauntMenuWidget_C");
static_assert(sizeof(UTauntMenuWidget_C) == 0x0002B0, "Wrong size on UTauntMenuWidget_C");
static_assert(offsetof(UTauntMenuWidget_C, UberGraphFrame) == 0x000290, "Member 'UTauntMenuWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTauntMenuWidget_C, Image) == 0x000298, "Member 'UTauntMenuWidget_C::Image' has a wrong offset!");
static_assert(offsetof(UTauntMenuWidget_C, Image_0) == 0x0002A0, "Member 'UTauntMenuWidget_C::Image_0' has a wrong offset!");
static_assert(offsetof(UTauntMenuWidget_C, Image_1) == 0x0002A8, "Member 'UTauntMenuWidget_C::Image_1' has a wrong offset!");

}

