#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TDM_UI

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function TDM_UI.TDM_UI_C.Set Text Red Score
// 0x0030 (0x0030 - 0x0000)
struct TDM_UI_C_Set_Text_Red_Score final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0018)()
};
static_assert(alignof(TDM_UI_C_Set_Text_Red_Score) == 0x000008, "Wrong alignment on TDM_UI_C_Set_Text_Red_Score");
static_assert(sizeof(TDM_UI_C_Set_Text_Red_Score) == 0x000030, "Wrong size on TDM_UI_C_Set_Text_Red_Score");
static_assert(offsetof(TDM_UI_C_Set_Text_Red_Score, ReturnValue) == 0x000000, "Member 'TDM_UI_C_Set_Text_Red_Score::ReturnValue' has a wrong offset!");
static_assert(offsetof(TDM_UI_C_Set_Text_Red_Score, CallFunc_Conv_IntToText_ReturnValue) == 0x000018, "Member 'TDM_UI_C_Set_Text_Red_Score::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function TDM_UI.TDM_UI_C.Set Text Blue Score
// 0x0030 (0x0030 - 0x0000)
struct TDM_UI_C_Set_Text_Blue_Score final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0018)()
};
static_assert(alignof(TDM_UI_C_Set_Text_Blue_Score) == 0x000008, "Wrong alignment on TDM_UI_C_Set_Text_Blue_Score");
static_assert(sizeof(TDM_UI_C_Set_Text_Blue_Score) == 0x000030, "Wrong size on TDM_UI_C_Set_Text_Blue_Score");
static_assert(offsetof(TDM_UI_C_Set_Text_Blue_Score, ReturnValue) == 0x000000, "Member 'TDM_UI_C_Set_Text_Blue_Score::ReturnValue' has a wrong offset!");
static_assert(offsetof(TDM_UI_C_Set_Text_Blue_Score, CallFunc_Conv_IntToText_ReturnValue) == 0x000018, "Member 'TDM_UI_C_Set_Text_Blue_Score::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function TDM_UI.TDM_UI_C.Red Progress Bar
// 0x0020 (0x0020 - 0x0000)
struct TDM_UI_C_Red_Progress_Bar final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_NarrowingCast;   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_WideningCast;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TDM_UI_C_Red_Progress_Bar) == 0x000008, "Wrong alignment on TDM_UI_C_Red_Progress_Bar");
static_assert(sizeof(TDM_UI_C_Red_Progress_Bar) == 0x000020, "Wrong size on TDM_UI_C_Red_Progress_Bar");
static_assert(offsetof(TDM_UI_C_Red_Progress_Bar, ReturnValue) == 0x000000, "Member 'TDM_UI_C_Red_Progress_Bar::ReturnValue' has a wrong offset!");
static_assert(offsetof(TDM_UI_C_Red_Progress_Bar, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000004, "Member 'TDM_UI_C_Red_Progress_Bar::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDM_UI_C_Red_Progress_Bar, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000008, "Member 'TDM_UI_C_Red_Progress_Bar::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDM_UI_C_Red_Progress_Bar, K2Node_FunctionResult_ReturnValue_NarrowingCast) == 0x000010, "Member 'TDM_UI_C_Red_Progress_Bar::K2Node_FunctionResult_ReturnValue_NarrowingCast' has a wrong offset!");
static_assert(offsetof(TDM_UI_C_Red_Progress_Bar, CallFunc_Divide_DoubleDouble_A_WideningCast) == 0x000018, "Member 'TDM_UI_C_Red_Progress_Bar::CallFunc_Divide_DoubleDouble_A_WideningCast' has a wrong offset!");

// Function TDM_UI.TDM_UI_C.Get_SkullImage_Brush_0
// 0x00D0 (0x00D0 - 0x0000)
struct TDM_UI_C_Get_SkullImage_Brush_0 final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x00D0)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(TDM_UI_C_Get_SkullImage_Brush_0) == 0x000010, "Wrong alignment on TDM_UI_C_Get_SkullImage_Brush_0");
static_assert(sizeof(TDM_UI_C_Get_SkullImage_Brush_0) == 0x0000D0, "Wrong size on TDM_UI_C_Get_SkullImage_Brush_0");
static_assert(offsetof(TDM_UI_C_Get_SkullImage_Brush_0, ReturnValue) == 0x000000, "Member 'TDM_UI_C_Get_SkullImage_Brush_0::ReturnValue' has a wrong offset!");

// Function TDM_UI.TDM_UI_C.ExecuteUbergraph_TDM_UI
// 0x0380 (0x0380 - 0x0000)
struct TDM_UI_C_ExecuteUbergraph_TDM_UI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBP_C*                         K2Node_DynamicCast_AsGame_State_BP;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0xD];                                       // 0x0023(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0030(0x00D0)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x0100(0x00D0)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_2;                    // 0x01D0(0x00D0)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_3;                    // 0x02A0(0x00D0)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0372(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TDM_UI_C_ExecuteUbergraph_TDM_UI) == 0x000010, "Wrong alignment on TDM_UI_C_ExecuteUbergraph_TDM_UI");
static_assert(sizeof(TDM_UI_C_ExecuteUbergraph_TDM_UI) == 0x000380, "Wrong size on TDM_UI_C_ExecuteUbergraph_TDM_UI");
static_assert(offsetof(TDM_UI_C_ExecuteUbergraph_TDM_UI, EntryPoint) == 0x000000, "Member 'TDM_UI_C_ExecuteUbergraph_TDM_UI::EntryPoint' has a wrong offset!");
static_assert(offsetof(TDM_UI_C_ExecuteUbergraph_TDM_UI, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'TDM_UI_C_ExecuteUbergraph_TDM_UI::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDM_UI_C_ExecuteUbergraph_TDM_UI, CallFunc_GetGameState_ReturnValue) == 0x000010, "Member 'TDM_UI_C_ExecuteUbergraph_TDM_UI::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDM_UI_C_ExecuteUbergraph_TDM_UI, K2Node_DynamicCast_AsGame_State_BP) == 0x000018, "Member 'TDM_UI_C_ExecuteUbergraph_TDM_UI::K2Node_DynamicCast_AsGame_State_BP' has a wrong offset!");
static_assert(offsetof(TDM_UI_C_ExecuteUbergraph_TDM_UI, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'TDM_UI_C_ExecuteUbergraph_TDM_UI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TDM_UI_C_ExecuteUbergraph_TDM_UI, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000021, "Member 'TDM_UI_C_ExecuteUbergraph_TDM_UI::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDM_UI_C_ExecuteUbergraph_TDM_UI, CallFunc_Greater_IntInt_ReturnValue) == 0x000022, "Member 'TDM_UI_C_ExecuteUbergraph_TDM_UI::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDM_UI_C_ExecuteUbergraph_TDM_UI, K2Node_MakeStruct_SlateBrush) == 0x000030, "Member 'TDM_UI_C_ExecuteUbergraph_TDM_UI::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(TDM_UI_C_ExecuteUbergraph_TDM_UI, K2Node_MakeStruct_SlateBrush_1) == 0x000100, "Member 'TDM_UI_C_ExecuteUbergraph_TDM_UI::K2Node_MakeStruct_SlateBrush_1' has a wrong offset!");
static_assert(offsetof(TDM_UI_C_ExecuteUbergraph_TDM_UI, K2Node_MakeStruct_SlateBrush_2) == 0x0001D0, "Member 'TDM_UI_C_ExecuteUbergraph_TDM_UI::K2Node_MakeStruct_SlateBrush_2' has a wrong offset!");
static_assert(offsetof(TDM_UI_C_ExecuteUbergraph_TDM_UI, K2Node_MakeStruct_SlateBrush_3) == 0x0002A0, "Member 'TDM_UI_C_ExecuteUbergraph_TDM_UI::K2Node_MakeStruct_SlateBrush_3' has a wrong offset!");
static_assert(offsetof(TDM_UI_C_ExecuteUbergraph_TDM_UI, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000370, "Member 'TDM_UI_C_ExecuteUbergraph_TDM_UI::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TDM_UI_C_ExecuteUbergraph_TDM_UI, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000371, "Member 'TDM_UI_C_ExecuteUbergraph_TDM_UI::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TDM_UI_C_ExecuteUbergraph_TDM_UI, CallFunc_BooleanAND_ReturnValue) == 0x000372, "Member 'TDM_UI_C_ExecuteUbergraph_TDM_UI::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function TDM_UI.TDM_UI_C.Blue Progress Bar
// 0x0020 (0x0020 - 0x0000)
struct TDM_UI_C_Blue_Progress_Bar final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_NarrowingCast;   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_WideningCast;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TDM_UI_C_Blue_Progress_Bar) == 0x000008, "Wrong alignment on TDM_UI_C_Blue_Progress_Bar");
static_assert(sizeof(TDM_UI_C_Blue_Progress_Bar) == 0x000020, "Wrong size on TDM_UI_C_Blue_Progress_Bar");
static_assert(offsetof(TDM_UI_C_Blue_Progress_Bar, ReturnValue) == 0x000000, "Member 'TDM_UI_C_Blue_Progress_Bar::ReturnValue' has a wrong offset!");
static_assert(offsetof(TDM_UI_C_Blue_Progress_Bar, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000004, "Member 'TDM_UI_C_Blue_Progress_Bar::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDM_UI_C_Blue_Progress_Bar, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000008, "Member 'TDM_UI_C_Blue_Progress_Bar::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDM_UI_C_Blue_Progress_Bar, K2Node_FunctionResult_ReturnValue_NarrowingCast) == 0x000010, "Member 'TDM_UI_C_Blue_Progress_Bar::K2Node_FunctionResult_ReturnValue_NarrowingCast' has a wrong offset!");
static_assert(offsetof(TDM_UI_C_Blue_Progress_Bar, CallFunc_Divide_DoubleDouble_A_WideningCast) == 0x000018, "Member 'TDM_UI_C_Blue_Progress_Bar::CallFunc_Divide_DoubleDouble_A_WideningCast' has a wrong offset!");

}

