#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TitlesMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TitlesMenu.TitlesMenu_C
// 0x00F8 (0x0388 - 0x0290)
class UTitlesMenu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             DevText;                                           // 0x0298(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DevText_1;                                         // 0x02A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DevText_2;                                         // 0x02A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DevText_3;                                         // 0x02B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                MasterOfSwordsButton;                              // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         MasterOfSwordsNeeder;                              // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                NoneButton;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Nonetext;                                          // 0x02E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                PirateButton;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                TopScallywagButton;                                // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TopScallywagNeeder;                                // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                TroubledoerButton;                                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TroubleDoerNeeder;                                 // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                GusRefrence;                                       // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Attach_mekshat;                                    // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   Pirate;                                            // 0x0330(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USaveGame*                              SaveItems;                                         // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Item_Changed;                                      // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         Title_Number;                                      // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HatNumber;                                         // 0x0364(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Skin_Number;                                       // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Weapon_1;                                          // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Weapon_2;                                          // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Pant_Type;                                         // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	bool Trouble_Doer_Enabled_();
	bool Top_Scallywag_Enabled_();
	void Save_Items(int32 Title, int32 HatNumber_0, int32 Skin_Number_0, const class FString& PantType);
	bool Pirate_Enabled_();
	void OnSuccess_8933F26348DA077ED97B1ABE6473E2B6();
	void OnSuccess_830DA6AB48E4596B09EC258E96DB43C4();
	void OnSuccess_02AD4F0341AA9B0FA169F2A2B3E31664();
	void OnFailure_8933F26348DA077ED97B1ABE6473E2B6();
	void OnFailure_830DA6AB48E4596B09EC258E96DB43C4();
	void OnFailure_02AD4F0341AA9B0FA169F2A2B3E31664();
	bool None_Button_Enabled_();
	bool Master_of_Swords_Enabled_();
	void Load_Items(int32* Titles, int32* Hats);
	void ExecuteUbergraph_TitlesMenu(int32 EntryPoint);
	void Construct();
	void BndEvt__TitlesMenu_TroubledoerButton_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__TitlesMenu_TopScallywagButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__TitlesMenu_PirateButton_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__TitlesMenu_NoneButton_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__TitlesMenu_MasterOfSwordsButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TitlesMenu_C">();
	}
	static class UTitlesMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTitlesMenu_C>();
	}
};
static_assert(alignof(UTitlesMenu_C) == 0x000008, "Wrong alignment on UTitlesMenu_C");
static_assert(sizeof(UTitlesMenu_C) == 0x000388, "Wrong size on UTitlesMenu_C");
static_assert(offsetof(UTitlesMenu_C, UberGraphFrame) == 0x000290, "Member 'UTitlesMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTitlesMenu_C, DevText) == 0x000298, "Member 'UTitlesMenu_C::DevText' has a wrong offset!");
static_assert(offsetof(UTitlesMenu_C, DevText_1) == 0x0002A0, "Member 'UTitlesMenu_C::DevText_1' has a wrong offset!");
static_assert(offsetof(UTitlesMenu_C, DevText_2) == 0x0002A8, "Member 'UTitlesMenu_C::DevText_2' has a wrong offset!");
static_assert(offsetof(UTitlesMenu_C, DevText_3) == 0x0002B0, "Member 'UTitlesMenu_C::DevText_3' has a wrong offset!");
static_assert(offsetof(UTitlesMenu_C, Image) == 0x0002B8, "Member 'UTitlesMenu_C::Image' has a wrong offset!");
static_assert(offsetof(UTitlesMenu_C, Image_0) == 0x0002C0, "Member 'UTitlesMenu_C::Image_0' has a wrong offset!");
static_assert(offsetof(UTitlesMenu_C, Image_1) == 0x0002C8, "Member 'UTitlesMenu_C::Image_1' has a wrong offset!");
static_assert(offsetof(UTitlesMenu_C, MasterOfSwordsButton) == 0x0002D0, "Member 'UTitlesMenu_C::MasterOfSwordsButton' has a wrong offset!");
static_assert(offsetof(UTitlesMenu_C, MasterOfSwordsNeeder) == 0x0002D8, "Member 'UTitlesMenu_C::MasterOfSwordsNeeder' has a wrong offset!");
static_assert(offsetof(UTitlesMenu_C, NoneButton) == 0x0002E0, "Member 'UTitlesMenu_C::NoneButton' has a wrong offset!");
static_assert(offsetof(UTitlesMenu_C, Nonetext) == 0x0002E8, "Member 'UTitlesMenu_C::Nonetext' has a wrong offset!");
static_assert(offsetof(UTitlesMenu_C, PirateButton) == 0x0002F0, "Member 'UTitlesMenu_C::PirateButton' has a wrong offset!");
static_assert(offsetof(UTitlesMenu_C, TopScallywagButton) == 0x0002F8, "Member 'UTitlesMenu_C::TopScallywagButton' has a wrong offset!");
static_assert(offsetof(UTitlesMenu_C, TopScallywagNeeder) == 0x000300, "Member 'UTitlesMenu_C::TopScallywagNeeder' has a wrong offset!");
static_assert(offsetof(UTitlesMenu_C, TroubledoerButton) == 0x000308, "Member 'UTitlesMenu_C::TroubledoerButton' has a wrong offset!");
static_assert(offsetof(UTitlesMenu_C, TroubleDoerNeeder) == 0x000310, "Member 'UTitlesMenu_C::TroubleDoerNeeder' has a wrong offset!");
static_assert(offsetof(UTitlesMenu_C, GusRefrence) == 0x000318, "Member 'UTitlesMenu_C::GusRefrence' has a wrong offset!");
static_assert(offsetof(UTitlesMenu_C, Attach_mekshat) == 0x000320, "Member 'UTitlesMenu_C::Attach_mekshat' has a wrong offset!");
static_assert(offsetof(UTitlesMenu_C, Pirate) == 0x000330, "Member 'UTitlesMenu_C::Pirate' has a wrong offset!");
static_assert(offsetof(UTitlesMenu_C, SaveItems) == 0x000348, "Member 'UTitlesMenu_C::SaveItems' has a wrong offset!");
static_assert(offsetof(UTitlesMenu_C, Item_Changed) == 0x000350, "Member 'UTitlesMenu_C::Item_Changed' has a wrong offset!");
static_assert(offsetof(UTitlesMenu_C, Title_Number) == 0x000360, "Member 'UTitlesMenu_C::Title_Number' has a wrong offset!");
static_assert(offsetof(UTitlesMenu_C, HatNumber) == 0x000364, "Member 'UTitlesMenu_C::HatNumber' has a wrong offset!");
static_assert(offsetof(UTitlesMenu_C, Skin_Number) == 0x000368, "Member 'UTitlesMenu_C::Skin_Number' has a wrong offset!");
static_assert(offsetof(UTitlesMenu_C, Weapon_1) == 0x00036C, "Member 'UTitlesMenu_C::Weapon_1' has a wrong offset!");
static_assert(offsetof(UTitlesMenu_C, Weapon_2) == 0x000370, "Member 'UTitlesMenu_C::Weapon_2' has a wrong offset!");
static_assert(offsetof(UTitlesMenu_C, Pant_Type) == 0x000378, "Member 'UTitlesMenu_C::Pant_Type' has a wrong offset!");

}

