#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TitlesMenu

#include "Basic.hpp"


namespace SDK::Params
{

// Function TitlesMenu.TitlesMenu_C.Trouble Doer Enabled?
// 0x0020 (0x0020 - 0x0000)
struct TitlesMenu_C_Trouble_Doer_Enabled_ final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TitlesMenu_C_Trouble_Doer_Enabled_) == 0x000008, "Wrong alignment on TitlesMenu_C_Trouble_Doer_Enabled_");
static_assert(sizeof(TitlesMenu_C_Trouble_Doer_Enabled_) == 0x000020, "Wrong size on TitlesMenu_C_Trouble_Doer_Enabled_");
static_assert(offsetof(TitlesMenu_C_Trouble_Doer_Enabled_, ReturnValue) == 0x000000, "Member 'TitlesMenu_C_Trouble_Doer_Enabled_::ReturnValue' has a wrong offset!");
static_assert(offsetof(TitlesMenu_C_Trouble_Doer_Enabled_, CallFunc_GetPlayerState_ReturnValue) == 0x000008, "Member 'TitlesMenu_C_Trouble_Doer_Enabled_::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(TitlesMenu_C_Trouble_Doer_Enabled_, K2Node_DynamicCast_AsPlayer_State_BP) == 0x000010, "Member 'TitlesMenu_C_Trouble_Doer_Enabled_::K2Node_DynamicCast_AsPlayer_State_BP' has a wrong offset!");
static_assert(offsetof(TitlesMenu_C_Trouble_Doer_Enabled_, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'TitlesMenu_C_Trouble_Doer_Enabled_::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TitlesMenu_C_Trouble_Doer_Enabled_, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000019, "Member 'TitlesMenu_C_Trouble_Doer_Enabled_::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function TitlesMenu.TitlesMenu_C.Top Scallywag Enabled?
// 0x0020 (0x0020 - 0x0000)
struct TitlesMenu_C_Top_Scallywag_Enabled_ final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TitlesMenu_C_Top_Scallywag_Enabled_) == 0x000008, "Wrong alignment on TitlesMenu_C_Top_Scallywag_Enabled_");
static_assert(sizeof(TitlesMenu_C_Top_Scallywag_Enabled_) == 0x000020, "Wrong size on TitlesMenu_C_Top_Scallywag_Enabled_");
static_assert(offsetof(TitlesMenu_C_Top_Scallywag_Enabled_, ReturnValue) == 0x000000, "Member 'TitlesMenu_C_Top_Scallywag_Enabled_::ReturnValue' has a wrong offset!");
static_assert(offsetof(TitlesMenu_C_Top_Scallywag_Enabled_, CallFunc_GetPlayerState_ReturnValue) == 0x000008, "Member 'TitlesMenu_C_Top_Scallywag_Enabled_::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(TitlesMenu_C_Top_Scallywag_Enabled_, K2Node_DynamicCast_AsPlayer_State_BP) == 0x000010, "Member 'TitlesMenu_C_Top_Scallywag_Enabled_::K2Node_DynamicCast_AsPlayer_State_BP' has a wrong offset!");
static_assert(offsetof(TitlesMenu_C_Top_Scallywag_Enabled_, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'TitlesMenu_C_Top_Scallywag_Enabled_::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TitlesMenu_C_Top_Scallywag_Enabled_, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000019, "Member 'TitlesMenu_C_Top_Scallywag_Enabled_::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function TitlesMenu.TitlesMenu_C.Save Items
// 0x0030 (0x0030 - 0x0000)
struct TitlesMenu_C_Save_Items final
{
public:
	int32                                         Title;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HatNumber_0;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Skin_Number_0;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PantType;                                          // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class USaveItems_C*                           CallFunc_CreateSaveGameObject_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TitlesMenu_C_Save_Items) == 0x000008, "Wrong alignment on TitlesMenu_C_Save_Items");
static_assert(sizeof(TitlesMenu_C_Save_Items) == 0x000030, "Wrong size on TitlesMenu_C_Save_Items");
static_assert(offsetof(TitlesMenu_C_Save_Items, Title) == 0x000000, "Member 'TitlesMenu_C_Save_Items::Title' has a wrong offset!");
static_assert(offsetof(TitlesMenu_C_Save_Items, HatNumber_0) == 0x000004, "Member 'TitlesMenu_C_Save_Items::HatNumber_0' has a wrong offset!");
static_assert(offsetof(TitlesMenu_C_Save_Items, Skin_Number_0) == 0x000008, "Member 'TitlesMenu_C_Save_Items::Skin_Number_0' has a wrong offset!");
static_assert(offsetof(TitlesMenu_C_Save_Items, PantType) == 0x000010, "Member 'TitlesMenu_C_Save_Items::PantType' has a wrong offset!");
static_assert(offsetof(TitlesMenu_C_Save_Items, CallFunc_CreateSaveGameObject_ReturnValue) == 0x000020, "Member 'TitlesMenu_C_Save_Items::CallFunc_CreateSaveGameObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(TitlesMenu_C_Save_Items, CallFunc_SaveGameToSlot_ReturnValue) == 0x000028, "Member 'TitlesMenu_C_Save_Items::CallFunc_SaveGameToSlot_ReturnValue' has a wrong offset!");

// Function TitlesMenu.TitlesMenu_C.Pirate Enabled?
// 0x0020 (0x0020 - 0x0000)
struct TitlesMenu_C_Pirate_Enabled_ final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TitlesMenu_C_Pirate_Enabled_) == 0x000008, "Wrong alignment on TitlesMenu_C_Pirate_Enabled_");
static_assert(sizeof(TitlesMenu_C_Pirate_Enabled_) == 0x000020, "Wrong size on TitlesMenu_C_Pirate_Enabled_");
static_assert(offsetof(TitlesMenu_C_Pirate_Enabled_, ReturnValue) == 0x000000, "Member 'TitlesMenu_C_Pirate_Enabled_::ReturnValue' has a wrong offset!");
static_assert(offsetof(TitlesMenu_C_Pirate_Enabled_, CallFunc_GetPlayerState_ReturnValue) == 0x000008, "Member 'TitlesMenu_C_Pirate_Enabled_::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(TitlesMenu_C_Pirate_Enabled_, K2Node_DynamicCast_AsPlayer_State_BP) == 0x000010, "Member 'TitlesMenu_C_Pirate_Enabled_::K2Node_DynamicCast_AsPlayer_State_BP' has a wrong offset!");
static_assert(offsetof(TitlesMenu_C_Pirate_Enabled_, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'TitlesMenu_C_Pirate_Enabled_::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TitlesMenu_C_Pirate_Enabled_, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000019, "Member 'TitlesMenu_C_Pirate_Enabled_::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function TitlesMenu.TitlesMenu_C.None Button Enabled?
// 0x0020 (0x0020 - 0x0000)
struct TitlesMenu_C_None_Button_Enabled_ final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TitlesMenu_C_None_Button_Enabled_) == 0x000008, "Wrong alignment on TitlesMenu_C_None_Button_Enabled_");
static_assert(sizeof(TitlesMenu_C_None_Button_Enabled_) == 0x000020, "Wrong size on TitlesMenu_C_None_Button_Enabled_");
static_assert(offsetof(TitlesMenu_C_None_Button_Enabled_, ReturnValue) == 0x000000, "Member 'TitlesMenu_C_None_Button_Enabled_::ReturnValue' has a wrong offset!");
static_assert(offsetof(TitlesMenu_C_None_Button_Enabled_, CallFunc_GetPlayerState_ReturnValue) == 0x000008, "Member 'TitlesMenu_C_None_Button_Enabled_::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(TitlesMenu_C_None_Button_Enabled_, K2Node_DynamicCast_AsPlayer_State_BP) == 0x000010, "Member 'TitlesMenu_C_None_Button_Enabled_::K2Node_DynamicCast_AsPlayer_State_BP' has a wrong offset!");
static_assert(offsetof(TitlesMenu_C_None_Button_Enabled_, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'TitlesMenu_C_None_Button_Enabled_::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TitlesMenu_C_None_Button_Enabled_, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000019, "Member 'TitlesMenu_C_None_Button_Enabled_::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function TitlesMenu.TitlesMenu_C.Master of Swords Enabled?
// 0x0020 (0x0020 - 0x0000)
struct TitlesMenu_C_Master_of_Swords_Enabled_ final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TitlesMenu_C_Master_of_Swords_Enabled_) == 0x000008, "Wrong alignment on TitlesMenu_C_Master_of_Swords_Enabled_");
static_assert(sizeof(TitlesMenu_C_Master_of_Swords_Enabled_) == 0x000020, "Wrong size on TitlesMenu_C_Master_of_Swords_Enabled_");
static_assert(offsetof(TitlesMenu_C_Master_of_Swords_Enabled_, ReturnValue) == 0x000000, "Member 'TitlesMenu_C_Master_of_Swords_Enabled_::ReturnValue' has a wrong offset!");
static_assert(offsetof(TitlesMenu_C_Master_of_Swords_Enabled_, CallFunc_GetPlayerState_ReturnValue) == 0x000008, "Member 'TitlesMenu_C_Master_of_Swords_Enabled_::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(TitlesMenu_C_Master_of_Swords_Enabled_, K2Node_DynamicCast_AsPlayer_State_BP) == 0x000010, "Member 'TitlesMenu_C_Master_of_Swords_Enabled_::K2Node_DynamicCast_AsPlayer_State_BP' has a wrong offset!");
static_assert(offsetof(TitlesMenu_C_Master_of_Swords_Enabled_, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'TitlesMenu_C_Master_of_Swords_Enabled_::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TitlesMenu_C_Master_of_Swords_Enabled_, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000019, "Member 'TitlesMenu_C_Master_of_Swords_Enabled_::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function TitlesMenu.TitlesMenu_C.Load Items
// 0x0020 (0x0020 - 0x0000)
struct TitlesMenu_C_Load_Items final
{
public:
	int32                                         Titles;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Hats;                                              // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveItems_C*                           K2Node_DynamicCast_AsSave_Items;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TitlesMenu_C_Load_Items) == 0x000008, "Wrong alignment on TitlesMenu_C_Load_Items");
static_assert(sizeof(TitlesMenu_C_Load_Items) == 0x000020, "Wrong size on TitlesMenu_C_Load_Items");
static_assert(offsetof(TitlesMenu_C_Load_Items, Titles) == 0x000000, "Member 'TitlesMenu_C_Load_Items::Titles' has a wrong offset!");
static_assert(offsetof(TitlesMenu_C_Load_Items, Hats) == 0x000004, "Member 'TitlesMenu_C_Load_Items::Hats' has a wrong offset!");
static_assert(offsetof(TitlesMenu_C_Load_Items, CallFunc_LoadGameFromSlot_ReturnValue) == 0x000008, "Member 'TitlesMenu_C_Load_Items::CallFunc_LoadGameFromSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(TitlesMenu_C_Load_Items, K2Node_DynamicCast_AsSave_Items) == 0x000010, "Member 'TitlesMenu_C_Load_Items::K2Node_DynamicCast_AsSave_Items' has a wrong offset!");
static_assert(offsetof(TitlesMenu_C_Load_Items, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'TitlesMenu_C_Load_Items::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TitlesMenu_C_Load_Items, CallFunc_DoesSaveGameExist_ReturnValue) == 0x000019, "Member 'TitlesMenu_C_Load_Items::CallFunc_DoesSaveGameExist_ReturnValue' has a wrong offset!");

// Function TitlesMenu.TitlesMenu_C.ExecuteUbergraph_TitlesMenu
// 0x0148 (0x0148 - 0x0000)
struct TitlesMenu_C_ExecuteUbergraph_TitlesMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStateBP_C*                       K2Node_DynamicCast_AsPlayer_State_BP;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAchievementQueryCallbackProxy*         CallFunc_CacheAchievements_ReturnValue;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCachedAchievementProgress_bFoundID;    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCachedAchievementProgress_Progress;    // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0094(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAchievementQueryCallbackProxy*         CallFunc_CacheAchievements_ReturnValue_1;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCachedAchievementProgress_bFoundID_1;  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCachedAchievementProgress_Progress_1;  // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAchievementQueryCallbackProxy*         CallFunc_CacheAchievements_ReturnValue_2;          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x00D8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCachedAchievementProgress_bFoundID_2;  // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x2];                                       // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCachedAchievementProgress_Progress_2;  // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2;  // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue;            // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue;             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue_1;          // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveItems_C*                           K2Node_DynamicCast_AsSave_Items;                   // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue_1;           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveItems_C*                           K2Node_DynamicCast_AsSave_Items_1;                 // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_WideningCast; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_WideningCast_1; // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_WideningCast_2; // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TitlesMenu_C_ExecuteUbergraph_TitlesMenu) == 0x000008, "Wrong alignment on TitlesMenu_C_ExecuteUbergraph_TitlesMenu");
static_assert(sizeof(TitlesMenu_C_ExecuteUbergraph_TitlesMenu) == 0x000148, "Wrong size on TitlesMenu_C_ExecuteUbergraph_TitlesMenu");
static_assert(offsetof(TitlesMenu_C_ExecuteUbergraph_TitlesMenu, EntryPoint) == 0x000000, "Member 'TitlesMenu_C_ExecuteUbergraph_TitlesMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(TitlesMenu_C_ExecuteUbergraph_TitlesMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'TitlesMenu_C_ExecuteUbergraph_TitlesMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
