#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_KillFeedElement

#include "Basic.hpp"

#include "BP_WidgetAligmentStruct_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UI_KillFeedElement.UI_KillFeedElement_C.OpenAnimation
// 0x0030 (0x0030 - 0x0000)
struct UI_KillFeedElement_C_OpenAnimation final
{
public:
	double                                        AnimationLength;                                   // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBP_WidgetAligmentStruct                      Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_FunctionResult_AnimationLength_WideningCast; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_KillFeedElement_C_OpenAnimation) == 0x000008, "Wrong alignment on UI_KillFeedElement_C_OpenAnimation");
static_assert(sizeof(UI_KillFeedElement_C_OpenAnimation) == 0x000030, "Wrong size on UI_KillFeedElement_C_OpenAnimation");
static_assert(offsetof(UI_KillFeedElement_C_OpenAnimation, AnimationLength) == 0x000000, "Member 'UI_KillFeedElement_C_OpenAnimation::AnimationLength' has a wrong offset!");
static_assert(offsetof(UI_KillFeedElement_C_OpenAnimation, Temp_byte_Variable) == 0x000008, "Member 'UI_KillFeedElement_C_OpenAnimation::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_KillFeedElement_C_OpenAnimation, K2Node_Select_Default) == 0x000010, "Member 'UI_KillFeedElement_C_OpenAnimation::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_KillFeedElement_C_OpenAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'UI_KillFeedElement_C_OpenAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillFeedElement_C_OpenAnimation, CallFunc_GetEndTime_ReturnValue) == 0x000020, "Member 'UI_KillFeedElement_C_OpenAnimation::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillFeedElement_C_OpenAnimation, K2Node_FunctionResult_AnimationLength_WideningCast) == 0x000028, "Member 'UI_KillFeedElement_C_OpenAnimation::K2Node_FunctionResult_AnimationLength_WideningCast' has a wrong offset!");

// Function UI_KillFeedElement.UI_KillFeedElement_C.Init
// 0x0080 (0x0080 - 0x0000)
struct UI_KillFeedElement_C_Init final
{
public:
	class FText                                   KillerName_0;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FSlateColor                            KillerNameColor;                                   // 0x0018(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   VictimName_0;                                      // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FSlateColor                            VictimNameColor;                                   // 0x0048(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Icon;                                              // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            IconColor_0;                                       // 0x0068(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(UI_KillFeedElement_C_Init) == 0x000008, "Wrong alignment on UI_KillFeedElement_C_Init");
static_assert(sizeof(UI_KillFeedElement_C_Init) == 0x000080, "Wrong size on UI_KillFeedElement_C_Init");
static_assert(offsetof(UI_KillFeedElement_C_Init, KillerName_0) == 0x000000, "Member 'UI_KillFeedElement_C_Init::KillerName_0' has a wrong offset!");
static_assert(offsetof(UI_KillFeedElement_C_Init, KillerNameColor) == 0x000018, "Member 'UI_KillFeedElement_C_Init::KillerNameColor' has a wrong offset!");
static_assert(offsetof(UI_KillFeedElement_C_Init, VictimName_0) == 0x000030, "Member 'UI_KillFeedElement_C_Init::VictimName_0' has a wrong offset!");
static_assert(offsetof(UI_KillFeedElement_C_Init, VictimNameColor) == 0x000048, "Member 'UI_KillFeedElement_C_Init::VictimNameColor' has a wrong offset!");
static_assert(offsetof(UI_KillFeedElement_C_Init, Icon) == 0x000060, "Member 'UI_KillFeedElement_C_Init::Icon' has a wrong offset!");
static_assert(offsetof(UI_KillFeedElement_C_Init, IconColor_0) == 0x000068, "Member 'UI_KillFeedElement_C_Init::IconColor_0' has a wrong offset!");

// Function UI_KillFeedElement.UI_KillFeedElement_C.ExecuteUbergraph_UI_KillFeedElement
// 0x0190 (0x0190 - 0x0000)
struct UI_KillFeedElement_C_ExecuteUbergraph_UI_KillFeedElement final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_CloseAnimation_AnimationLength;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_OpenAnimation_AnimationLength;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_KillerName;                     // 0x0028(0x0018)()
	struct FSlateColor                            K2Node_CustomEvent_KillerNameColor;                // 0x0040(0x0014)()
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_VictimName;                     // 0x0058(0x0018)()
	struct FSlateColor                            K2Node_CustomEvent_VictimNameColor;                // 0x0070(0x0014)()
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_CustomEvent_Icon;                           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_CustomEvent_IconColor;                      // 0x0090(0x0014)()
	uint8                                         Pad_A4[0xC];                                       // 0x00A4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x00B0(0x00D0)()
	float                                         CallFunc_Delay_Duration_NarrowingCast;             // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_NarrowingCast_1;           // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_KillFeedElement_C_ExecuteUbergraph_UI_KillFeedElement) == 0x000010, "Wrong alignment on UI_KillFeedElement_C_ExecuteUbergraph_UI_KillFeedElement");
static_assert(sizeof(UI_KillFeedElement_C_ExecuteUbergraph_UI_KillFeedElement) == 0x000190, "Wrong size on UI_KillFeedElement_C_ExecuteUbergraph_UI_KillFeedElement");
static_assert(offsetof(UI_KillFeedElement_C_ExecuteUbergraph_UI_KillFeedElement, EntryPoint) == 0x000000, "Member 'UI_KillFeedElement_C_ExecuteUbergraph_UI_KillFeedElement::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_KillFeedElement_C_ExecuteUbergraph_UI_KillFeedElement, CallFunc_CloseAnimation_AnimationLength) == 0x000008, "Member 'UI_KillFeedElement_C_ExecuteUbergraph_UI_KillFeedElement::CallFunc_CloseAnimation_AnimationLength' has a wrong offset!");
static_assert(offsetof(UI_KillFeedElement_C_ExecuteUbergraph_UI_KillFeedElement, CallFunc_OpenAnimation_AnimationLength) == 0x000010, "Member 'UI_KillFeedElement_C_ExecuteUbergraph_UI_KillFeedElement::CallFunc_OpenAnimation_AnimationLength' has a wrong offset!");
static_assert(offsetof(UI_KillFeedElement_C_ExecuteUbergraph_UI_KillFeedElement, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000018, "Member 'UI_KillFeedElement_C_ExecuteUbergraph_UI_KillFeedElement::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillFeedElement_C_ExecuteUbergraph_UI_KillFeedElement, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000020, "Member 'UI_KillFeedElement_C_ExecuteUbergraph_UI_KillFeedElement::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_KillFeedElement_C_ExecuteUbergraph_UI_KillFeedElement, K2Node_CustomEvent_KillerName) == 0x000028, "Member 'UI_KillFeedElement_C_ExecuteUbergraph_UI_KillFeedElement::K2Node_CustomEvent_KillerName' has a wrong offset!");
static_assert(offsetof(UI_KillFeedElement_C_ExecuteUbergraph_UI_KillFeedElement, K2Node_CustomEvent_KillerNameColor) == 0x000040, "Member 'UI_KillFeedElement_C_ExecuteUbergraph_UI_KillFeedElement::K2Node_CustomEvent_KillerNameColor' has a wrong offset!");
static_assert(offsetof(UI_KillFeedElement_C_ExecuteUbergraph_UI_KillFeedElement, K2Node_CustomEvent_VictimName) == 0x000058, "Member 'UI_KillFeedElement_C_ExecuteUbergraph_UI_KillFeedElement::K2Node_CustomEvent_VictimName' has a wrong offset!");
static_assert(offsetof(UI_KillFeedElement_C_ExecuteUbergraph_UI_KillFeedElement, K2Node_CustomEvent_VictimNameColor) == 0x000070, "Member 'UI_KillFeedElement_C_ExecuteUbergraph_UI_KillFeedElement::K2Node_CustomEvent_VictimNameColor' has a wrong offset!");
static_assert(offsetof(UI_KillFeedElement_C_ExecuteUbergraph_UI_KillFeedElement, K2Node_CustomEvent_Icon) == 0x000088, "Member 'UI_KillFeedElement_C_ExecuteUbergraph_UI_KillFeedElement::K2Node_CustomEvent_Icon' has a wrong offset!");
static_assert(offsetof(UI_KillFeedElement_C_ExecuteUbergraph_UI_KillFeedElement, K2Node_CustomEvent_IconColor) == 0x000090, "Member 'UI_KillFeedElement_C_ExecuteUbergraph_UI_KillFeedElement::K2Node_CustomEvent_IconColor' has a wrong offset!");
static_assert(offsetof(UI_KillFeedElement_C_ExecuteUbergraph_UI_KillFeedElement, K2Node_MakeStruct_SlateBrush) == 0x0000B0, "Member 'UI_KillFeedElement_C_ExecuteUbergraph_UI_KillFeedElement::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(UI_KillFeedElement_C_ExecuteUbergraph_UI_KillFeedElement, CallFunc_Delay_Duration_NarrowingCast) == 0x000180, "Member 'UI_KillFeedElement_C_ExecuteUbergraph_UI_KillFeedElement::CallFunc_Delay_Duration_NarrowingCast' has a wrong offset!");
static_assert(offsetof(UI_KillFeedElement_C_ExecuteUbergraph_UI_KillFeedElement, CallFunc_Delay_Duration_NarrowingCast_1) == 0x000184, "Member 'UI_KillFeedElement_C_ExecuteUbergraph_UI_KillFeedElement::CallFunc_Delay_Duration_NarrowingCast_1' has a wrong offset!");

// Function UI_KillFeedElement.UI_KillFeedElement_C.CloseAnimation
// 0x0020 (0x0020 - 0x0000)
struct UI_KillFeedElement_C_CloseAnimation final
{
public:
	double                                        AnimationLength;                                   // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_FunctionResult_AnimationLength_WideningCast; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_KillFeedElement_C_CloseAnimation) == 0x000008, "Wrong alignment on UI_KillFeedElement_C_CloseAnimation");
static_assert(sizeof(UI_KillFeedElement_C_CloseAnimation) == 0x000020, "Wrong size on UI_KillFeedElement_C_CloseAnimation");
static_assert(offsetof(UI_KillFeedElement_C_CloseAnimation, AnimationLength) == 0x000000, "Member 'UI_KillFeedElement_C_CloseAnimation::AnimationLength' has a wrong offset!");
static_assert(offsetof(UI_KillFeedElement_C_CloseAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'UI_KillFeedElement_C_CloseAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillFeedElement_C_CloseAnimation, CallFunc_GetEndTime_ReturnValue) == 0x000010, "Member 'UI_KillFeedElement_C_CloseAnimation::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillFeedElement_C_CloseAnimation, K2Node_FunctionResult_AnimationLength_WideningCast) == 0x000018, "Member 'UI_KillFeedElement_C_CloseAnimation::K2Node_FunctionResult_AnimationLength_WideningCast' has a wrong offset!");

}

