#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Wanted_Poster

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function Wanted_Poster.Wanted_Poster_C.GetText_1
// 0x0018 (0x0018 - 0x0000)
struct Wanted_Poster_C_GetText_1 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(Wanted_Poster_C_GetText_1) == 0x000008, "Wrong alignment on Wanted_Poster_C_GetText_1");
static_assert(sizeof(Wanted_Poster_C_GetText_1) == 0x000018, "Wrong size on Wanted_Poster_C_GetText_1");
static_assert(offsetof(Wanted_Poster_C_GetText_1, ReturnValue) == 0x000000, "Member 'Wanted_Poster_C_GetText_1::ReturnValue' has a wrong offset!");

// Function Wanted_Poster.Wanted_Poster_C.GetText_0
// 0x0018 (0x0018 - 0x0000)
struct Wanted_Poster_C_GetText_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(Wanted_Poster_C_GetText_0) == 0x000008, "Wrong alignment on Wanted_Poster_C_GetText_0");
static_assert(sizeof(Wanted_Poster_C_GetText_0) == 0x000018, "Wrong size on Wanted_Poster_C_GetText_0");
static_assert(offsetof(Wanted_Poster_C_GetText_0, ReturnValue) == 0x000000, "Member 'Wanted_Poster_C_GetText_0::ReturnValue' has a wrong offset!");

// Function Wanted_Poster.Wanted_Poster_C.ExecuteUbergraph_Wanted_Poster
// 0x0430 (0x0430 - 0x0000)
struct Wanted_Poster_C_ExecuteUbergraph_Wanted_Poster final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0010(0x00D0)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x00E0(0x00D0)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_2;                    // 0x01B0(0x00D0)()
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0xF];                                      // 0x0281(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_3;                    // 0x0290(0x00D0)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_4;                    // 0x0360(0x00D0)()
};
static_assert(alignof(Wanted_Poster_C_ExecuteUbergraph_Wanted_Poster) == 0x000010, "Wrong alignment on Wanted_Poster_C_ExecuteUbergraph_Wanted_Poster");
static_assert(sizeof(Wanted_Poster_C_ExecuteUbergraph_Wanted_Poster) == 0x000430, "Wrong size on Wanted_Poster_C_ExecuteUbergraph_Wanted_Poster");
static_assert(offsetof(Wanted_Poster_C_ExecuteUbergraph_Wanted_Poster, EntryPoint) == 0x000000, "Member 'Wanted_Poster_C_ExecuteUbergraph_Wanted_Poster::EntryPoint' has a wrong offset!");
static_assert(offsetof(Wanted_Poster_C_ExecuteUbergraph_Wanted_Poster, K2Node_MakeStruct_SlateBrush) == 0x000010, "Member 'Wanted_Poster_C_ExecuteUbergraph_Wanted_Poster::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(Wanted_Poster_C_ExecuteUbergraph_Wanted_Poster, K2Node_MakeStruct_SlateBrush_1) == 0x0000E0, "Member 'Wanted_Poster_C_ExecuteUbergraph_Wanted_Poster::K2Node_MakeStruct_SlateBrush_1' has a wrong offset!");
static_assert(offsetof(Wanted_Poster_C_ExecuteUbergraph_Wanted_Poster, K2Node_MakeStruct_SlateBrush_2) == 0x0001B0, "Member 'Wanted_Poster_C_ExecuteUbergraph_Wanted_Poster::K2Node_MakeStruct_SlateBrush_2' has a wrong offset!");
static_assert(offsetof(Wanted_Poster_C_ExecuteUbergraph_Wanted_Poster, K2Node_SwitchString_CmpSuccess) == 0x000280, "Member 'Wanted_Poster_C_ExecuteUbergraph_Wanted_Poster::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Wanted_Poster_C_ExecuteUbergraph_Wanted_Poster, K2Node_MakeStruct_SlateBrush_3) == 0x000290, "Member 'Wanted_Poster_C_ExecuteUbergraph_Wanted_Poster::K2Node_MakeStruct_SlateBrush_3' has a wrong offset!");
static_assert(offsetof(Wanted_Poster_C_ExecuteUbergraph_Wanted_Poster, K2Node_MakeStruct_SlateBrush_4) == 0x000360, "Member 'Wanted_Poster_C_ExecuteUbergraph_Wanted_Poster::K2Node_MakeStruct_SlateBrush_4' has a wrong offset!");

}

