#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Wanted_Poster

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Wanted_Poster.Wanted_Poster_C
// 0x0080 (0x0310 - 0x0290)
class UWanted_Poster_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 GusImage;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x02A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_0;                                       // 0x02B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Name_0;                                            // 0x02B8(0x0018)(Edit, BlueprintVisible)
	class FText                                   Kills;                                             // 0x02D0(0x0018)(Edit, BlueprintVisible)
	class FString                                 Hat;                                               // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   SecondaryText;                                     // 0x02F8(0x0018)(Edit, BlueprintVisible)

public:
	void GetText_2();
	class FText GetText_1();
	class FText GetText_0();
	void ExecuteUbergraph_Wanted_Poster(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Wanted_Poster_C">();
	}
	static class UWanted_Poster_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWanted_Poster_C>();
	}
};
static_assert(alignof(UWanted_Poster_C) == 0x000008, "Wrong alignment on UWanted_Poster_C");
static_assert(sizeof(UWanted_Poster_C) == 0x000310, "Wrong size on UWanted_Poster_C");
static_assert(offsetof(UWanted_Poster_C, UberGraphFrame) == 0x000290, "Member 'UWanted_Poster_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWanted_Poster_C, GusImage) == 0x000298, "Member 'UWanted_Poster_C::GusImage' has a wrong offset!");
static_assert(offsetof(UWanted_Poster_C, Image_0) == 0x0002A0, "Member 'UWanted_Poster_C::Image_0' has a wrong offset!");
static_assert(offsetof(UWanted_Poster_C, TextBlock) == 0x0002A8, "Member 'UWanted_Poster_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UWanted_Poster_C, TextBlock_0) == 0x0002B0, "Member 'UWanted_Poster_C::TextBlock_0' has a wrong offset!");
static_assert(offsetof(UWanted_Poster_C, Name_0) == 0x0002B8, "Member 'UWanted_Poster_C::Name_0' has a wrong offset!");
static_assert(offsetof(UWanted_Poster_C, Kills) == 0x0002D0, "Member 'UWanted_Poster_C::Kills' has a wrong offset!");
static_assert(offsetof(UWanted_Poster_C, Hat) == 0x0002E8, "Member 'UWanted_Poster_C::Hat' has a wrong offset!");
static_assert(offsetof(UWanted_Poster_C, SecondaryText) == 0x0002F8, "Member 'UWanted_Poster_C::SecondaryText' has a wrong offset!");

}

