#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WaterLaunching

#include "Basic.hpp"


namespace SDK::Params
{

// Function WaterLaunching.WaterLaunching_C.ReceiveActorEndOverlap
// 0x0008 (0x0008 - 0x0000)
struct WaterLaunching_C_ReceiveActorEndOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WaterLaunching_C_ReceiveActorEndOverlap) == 0x000008, "Wrong alignment on WaterLaunching_C_ReceiveActorEndOverlap");
static_assert(sizeof(WaterLaunching_C_ReceiveActorEndOverlap) == 0x000008, "Wrong size on WaterLaunching_C_ReceiveActorEndOverlap");
static_assert(offsetof(WaterLaunching_C_ReceiveActorEndOverlap, OtherActor) == 0x000000, "Member 'WaterLaunching_C_ReceiveActorEndOverlap::OtherActor' has a wrong offset!");

// Function WaterLaunching.WaterLaunching_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct WaterLaunching_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WaterLaunching_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on WaterLaunching_C_ReceiveActorBeginOverlap");
static_assert(sizeof(WaterLaunching_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on WaterLaunching_C_ReceiveActorBeginOverlap");
static_assert(offsetof(WaterLaunching_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'WaterLaunching_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function WaterLaunching.WaterLaunching_C.ExecuteUbergraph_WaterLaunching
// 0x0068 (0x0068 - 0x0000)
struct WaterLaunching_C_ExecuteUbergraph_WaterLaunching final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor_1;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACTF_Flag_Red_C*                        K2Node_DynamicCast_AsCTF_Flag_Red;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACTF_Flag_Blue_C*                       K2Node_DynamicCast_AsCTF_Flag_Blue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player_1;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player_2;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WaterLaunching_C_ExecuteUbergraph_WaterLaunching) == 0x000008, "Wrong alignment on WaterLaunching_C_ExecuteUbergraph_WaterLaunching");
static_assert(sizeof(WaterLaunching_C_ExecuteUbergraph_WaterLaunching) == 0x000068, "Wrong size on WaterLaunching_C_ExecuteUbergraph_WaterLaunching");
static_assert(offsetof(WaterLaunching_C_ExecuteUbergraph_WaterLaunching, EntryPoint) == 0x000000, "Member 'WaterLaunching_C_ExecuteUbergraph_WaterLaunching::EntryPoint' has a wrong offset!");
static_assert(offsetof(WaterLaunching_C_ExecuteUbergraph_WaterLaunching, K2Node_Event_OtherActor) == 0x000008, "Member 'WaterLaunching_C_ExecuteUbergraph_WaterLaunching::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(WaterLaunching_C_ExecuteUbergraph_WaterLaunching, K2Node_DynamicCast_AsTrain_Gus_Player) == 0x000010, "Member 'WaterLaunching_C_ExecuteUbergraph_WaterLaunching::K2Node_DynamicCast_AsTrain_Gus_Player' has a wrong offset!");
static_assert(offsetof(WaterLaunching_C_ExecuteUbergraph_WaterLaunching, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WaterLaunching_C_ExecuteUbergraph_WaterLaunching::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WaterLaunching_C_ExecuteUbergraph_WaterLaunching, K2Node_Event_OtherActor_1) == 0x000020, "Member 'WaterLaunching_C_ExecuteUbergraph_WaterLaunching::K2Node_Event_OtherActor_1' has a wrong offset!");
static_assert(offsetof(WaterLaunching_C_ExecuteUbergraph_WaterLaunching, K2Node_DynamicCast_AsCTF_Flag_Red) == 0x000028, "Member 'WaterLaunching_C_ExecuteUbergraph_WaterLaunching::K2Node_DynamicCast_AsCTF_Flag_Red' has a wrong offset!");
static_assert(offsetof(WaterLaunching_C_ExecuteUbergraph_WaterLaunching, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'WaterLaunching_C_ExecuteUbergraph_WaterLaunching::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WaterLaunching_C_ExecuteUbergraph_WaterLaunching, K2Node_DynamicCast_AsCTF_Flag_Blue) == 0x000038, "Member 'WaterLaunching_C_ExecuteUbergraph_WaterLaunching::K2Node_DynamicCast_AsCTF_Flag_Blue' has a wrong offset!");
static_assert(offsetof(WaterLaunching_C_ExecuteUbergraph_WaterLaunching, K2Node_DynamicCast_bSuccess_2) == 0x000040, "Member 'WaterLaunching_C_ExecuteUbergraph_WaterLaunching::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WaterLaunching_C_ExecuteUbergraph_WaterLaunching, K2Node_DynamicCast_AsTrain_Gus_Player_1) == 0x000048, "Member 'WaterLaunching_C_ExecuteUbergraph_WaterLaunching::K2Node_DynamicCast_AsTrain_Gus_Player_1' has a wrong offset!");
static_assert(offsetof(WaterLaunching_C_ExecuteUbergraph_WaterLaunching, K2Node_DynamicCast_bSuccess_3) == 0x000050, "Member 'WaterLaunching_C_ExecuteUbergraph_WaterLaunching::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WaterLaunching_C_ExecuteUbergraph_WaterLaunching, K2Node_DynamicCast_AsTrain_Gus_Player_2) == 0x000058, "Member 'WaterLaunching_C_ExecuteUbergraph_WaterLaunching::K2Node_DynamicCast_AsTrain_Gus_Player_2' has a wrong offset!");
static_assert(offsetof(WaterLaunching_C_ExecuteUbergraph_WaterLaunching, K2Node_DynamicCast_bSuccess_4) == 0x000060, "Member 'WaterLaunching_C_ExecuteUbergraph_WaterLaunching::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");

}

