#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WaterDampener

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WaterDampener.WaterDampener_C
// 0x0028 (0x02A0 - 0x0278)
class AWaterDampener_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Intensity_6EE279B24C862D2FAA32B3A433ED8116; // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_6EE279B24C862D2FAA32B3A433ED8116; // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_295[0x3];                                      // 0x0295(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void ReceiveActorEndOverlap(class AActor* OtherActor);
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ExecuteUbergraph_WaterDampener(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WaterDampener_C">();
	}
	static class AWaterDampener_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWaterDampener_C>();
	}
};
static_assert(alignof(AWaterDampener_C) == 0x000008, "Wrong alignment on AWaterDampener_C");
static_assert(sizeof(AWaterDampener_C) == 0x0002A0, "Wrong size on AWaterDampener_C");
static_assert(offsetof(AWaterDampener_C, UberGraphFrame) == 0x000278, "Member 'AWaterDampener_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AWaterDampener_C, Box) == 0x000280, "Member 'AWaterDampener_C::Box' has a wrong offset!");
static_assert(offsetof(AWaterDampener_C, DefaultSceneRoot) == 0x000288, "Member 'AWaterDampener_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AWaterDampener_C, Timeline_0_Intensity_6EE279B24C862D2FAA32B3A433ED8116) == 0x000290, "Member 'AWaterDampener_C::Timeline_0_Intensity_6EE279B24C862D2FAA32B3A433ED8116' has a wrong offset!");
static_assert(offsetof(AWaterDampener_C, Timeline_0__Direction_6EE279B24C862D2FAA32B3A433ED8116) == 0x000294, "Member 'AWaterDampener_C::Timeline_0__Direction_6EE279B24C862D2FAA32B3A433ED8116' has a wrong offset!");
static_assert(offsetof(AWaterDampener_C, Timeline_0) == 0x000298, "Member 'AWaterDampener_C::Timeline_0' has a wrong offset!");

}

