#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponStowed

#include "Basic.hpp"


namespace SDK::Params
{

// Function WeaponStowed.WeaponStowed_C.ExecuteUbergraph_WeaponStowed
// 0x0038 (0x0038 - 0x0000)
struct WeaponStowed_C_ExecuteUbergraph_WeaponStowed final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrainGusPlayer_C*                      K2Node_DynamicCast_AsTrain_Gus_Player_1;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponStowed_C_ExecuteUbergraph_WeaponStowed) == 0x000008, "Wrong alignment on WeaponStowed_C_ExecuteUbergraph_WeaponStowed");
static_assert(sizeof(WeaponStowed_C_ExecuteUbergraph_WeaponStowed) == 0x000038, "Wrong size on WeaponStowed_C_ExecuteUbergraph_WeaponStowed");
static_assert(offsetof(WeaponStowed_C_ExecuteUbergraph_WeaponStowed, EntryPoint) == 0x000000, "Member 'WeaponStowed_C_ExecuteUbergraph_WeaponStowed::EntryPoint' has a wrong offset!");
static_assert(offsetof(WeaponStowed_C_ExecuteUbergraph_WeaponStowed, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000008, "Member 'WeaponStowed_C_ExecuteUbergraph_WeaponStowed::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponStowed_C_ExecuteUbergraph_WeaponStowed, K2Node_DynamicCast_AsTrain_Gus_Player) == 0x000010, "Member 'WeaponStowed_C_ExecuteUbergraph_WeaponStowed::K2Node_DynamicCast_AsTrain_Gus_Player' has a wrong offset!");
static_assert(offsetof(WeaponStowed_C_ExecuteUbergraph_WeaponStowed, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WeaponStowed_C_ExecuteUbergraph_WeaponStowed::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WeaponStowed_C_ExecuteUbergraph_WeaponStowed, CallFunc_GetPlayerCharacter_ReturnValue_1) == 0x000020, "Member 'WeaponStowed_C_ExecuteUbergraph_WeaponStowed::CallFunc_GetPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponStowed_C_ExecuteUbergraph_WeaponStowed, K2Node_DynamicCast_AsTrain_Gus_Player_1) == 0x000028, "Member 'WeaponStowed_C_ExecuteUbergraph_WeaponStowed::K2Node_DynamicCast_AsTrain_Gus_Player_1' has a wrong offset!");
static_assert(offsetof(WeaponStowed_C_ExecuteUbergraph_WeaponStowed, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'WeaponStowed_C_ExecuteUbergraph_WeaponStowed::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

