#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponSkins

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WeaponSkins.WeaponSkins_C
// 0x00E8 (0x0378 - 0x0290)
class UWeaponSkins_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         One0KillsBox;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Three0KillsBox;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Four0KillsBox;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Five0KillsBox;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_6;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_7;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                LeavesButton;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ManyullynButton;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                NoSkinButton;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                TheBricksSkin;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                TheSunSkin;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                GusRefrence;                                       // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Attach_mekshat;                                    // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         Local_Skin_Number;                                 // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Player_Kills;                                      // 0x0344(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveGame*                              SaveOptions;                                       // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Title_Number;                                      // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HatNumber;                                         // 0x0354(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Skin_Number;                                       // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Weapon_1;                                          // 0x035C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Weapon_2;                                          // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Pant_Type;                                         // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void Save_Item(int32 Title, int32 Hat, int32 Skin, const class FString& PantType);
	void PreConstruct(bool IsDesignTime);
	void Load_Stats();
	void ExecuteUbergraph_WeaponSkins(int32 EntryPoint);
	bool EnableTheSun();
	bool EnableNoSkin();
	bool EnableManyullyn();
	bool EnableLeaves();
	bool EnableBricks();
	void Construct();
	void BndEvt__WeaponSkins_TheSunSkin_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WeaponSkins_TheBricksSkin_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WeaponSkins_LeavesButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__HatMenu_HatNoneButton_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__HatMenu_Hat1_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WeaponSkins_C">();
	}
	static class UWeaponSkins_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWeaponSkins_C>();
	}
};
static_assert(alignof(UWeaponSkins_C) == 0x000008, "Wrong alignment on UWeaponSkins_C");
static_assert(sizeof(UWeaponSkins_C) == 0x000378, "Wrong size on UWeaponSkins_C");
static_assert(offsetof(UWeaponSkins_C, UberGraphFrame) == 0x000290, "Member 'UWeaponSkins_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWeaponSkins_C, One0KillsBox) == 0x000298, "Member 'UWeaponSkins_C::One0KillsBox' has a wrong offset!");
static_assert(offsetof(UWeaponSkins_C, Three0KillsBox) == 0x0002A0, "Member 'UWeaponSkins_C::Three0KillsBox' has a wrong offset!");
static_assert(offsetof(UWeaponSkins_C, Four0KillsBox) == 0x0002A8, "Member 'UWeaponSkins_C::Four0KillsBox' has a wrong offset!");
static_assert(offsetof(UWeaponSkins_C, Five0KillsBox) == 0x0002B0, "Member 'UWeaponSkins_C::Five0KillsBox' has a wrong offset!");
static_assert(offsetof(UWeaponSkins_C, Image) == 0x0002B8, "Member 'UWeaponSkins_C::Image' has a wrong offset!");
static_assert(offsetof(UWeaponSkins_C, Image_0) == 0x0002C0, "Member 'UWeaponSkins_C::Image_0' has a wrong offset!");
static_assert(offsetof(UWeaponSkins_C, Image_1) == 0x0002C8, "Member 'UWeaponSkins_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWeaponSkins_C, Image_2) == 0x0002D0, "Member 'UWeaponSkins_C::Image_2' has a wrong offset!");
static_assert(offsetof(UWeaponSkins_C, Image_3) == 0x0002D8, "Member 'UWeaponSkins_C::Image_3' has a wrong offset!");
static_assert(offsetof(UWeaponSkins_C, Image_4) == 0x0002E0, "Member 'UWeaponSkins_C::Image_4' has a wrong offset!");
static_assert(offsetof(UWeaponSkins_C, Image_5) == 0x0002E8, "Member 'UWeaponSkins_C::Image_5' has a wrong offset!");
static_assert(offsetof(UWeaponSkins_C, Image_6) == 0x0002F0, "Member 'UWeaponSkins_C::Image_6' has a wrong offset!");
static_assert(offsetof(UWeaponSkins_C, Image_7) == 0x0002F8, "Member 'UWeaponSkins_C::Image_7' has a wrong offset!");
static_assert(offsetof(UWeaponSkins_C, LeavesButton) == 0x000300, "Member 'UWeaponSkins_C::LeavesButton' has a wrong offset!");
static_assert(offsetof(UWeaponSkins_C, ManyullynButton) == 0x000308, "Member 'UWeaponSkins_C::ManyullynButton' has a wrong offset!");
static_assert(offsetof(UWeaponSkins_C, NoSkinButton) == 0x000310, "Member 'UWeaponSkins_C::NoSkinButton' has a wrong offset!");
static_assert(offsetof(UWeaponSkins_C, TheBricksSkin) == 0x000318, "Member 'UWeaponSkins_C::TheBricksSkin' has a wrong offset!");
static_assert(offsetof(UWeaponSkins_C, TheSunSkin) == 0x000320, "Member 'UWeaponSkins_C::TheSunSkin' has a wrong offset!");
static_assert(offsetof(UWeaponSkins_C, GusRefrence) == 0x000328, "Member 'UWeaponSkins_C::GusRefrence' has a wrong offset!");
static_assert(offsetof(UWeaponSkins_C, Attach_mekshat) == 0x000330, "Member 'UWeaponSkins_C::Attach_mekshat' has a wrong offset!");
static_assert(offsetof(UWeaponSkins_C, Local_Skin_Number) == 0x000340, "Member 'UWeaponSkins_C::Local_Skin_Number' has a wrong offset!");
static_assert(offsetof(UWeaponSkins_C, Player_Kills) == 0x000344, "Member 'UWeaponSkins_C::Player_Kills' has a wrong offset!");
static_assert(offsetof(UWeaponSkins_C, SaveOptions) == 0x000348, "Member 'UWeaponSkins_C::SaveOptions' has a wrong offset!");
static_assert(offsetof(UWeaponSkins_C, Title_Number) == 0x000350, "Member 'UWeaponSkins_C::Title_Number' has a wrong offset!");
static_assert(offsetof(UWeaponSkins_C, HatNumber) == 0x000354, "Member 'UWeaponSkins_C::HatNumber' has a wrong offset!");
static_assert(offsetof(UWeaponSkins_C, Skin_Number) == 0x000358, "Member 'UWeaponSkins_C::Skin_Number' has a wrong offset!");
static_assert(offsetof(UWeaponSkins_C, Weapon_1) == 0x00035C, "Member 'UWeaponSkins_C::Weapon_1' has a wrong offset!");
static_assert(offsetof(UWeaponSkins_C, Weapon_2) == 0x000360, "Member 'UWeaponSkins_C::Weapon_2' has a wrong offset!");
static_assert(offsetof(UWeaponSkins_C, Pant_Type) == 0x000368, "Member 'UWeaponSkins_C::Pant_Type' has a wrong offset!");

}

