#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Weapon_choosing_1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "AdvancedSessions_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Weapon_choosing_1.Weapon_choosing_1_C
// 0x00E0 (0x0370 - 0x0290)
class UWeapon_choosing_1_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Blunderbuss1;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Blunderbuss1_1;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border;                                            // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_0;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_0;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_1;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                CloseWindow;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                EyeOfReach1;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                EyeOfReach1_1;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Flintlock1;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Flintlock1_2;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GunEquipedImage1;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GunEquipedImage2;                                  // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Hatwindow;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_0;                                   // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                GusRefrence;                                       // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Attach_mekshat;                                    // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         Weapon_2_memory;                                   // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Weapon_1_memory;                                   // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Save_Items(int32 Weapon_1, int32 Weapon_2);
	bool GetbIsEnabled_2();
	bool GetbIsEnabled_1();
	bool GetbIsEnabled_0();
	bool Get_Sword2_bIsEnabled_0();
	bool Get_Sword1_bIsEnabled_0();
	struct FSlateBrush Get_GunEquipedImage2_Brush_0();
	bool Get_Flintlock1_bIsEnabled_0();
	ESlateVisibility Get_Flintlock1_2_Visibility_0();
	bool Get_Flintlock1_2_bIsEnabled_0();
	bool Get_EyeOfReach1_bIsEnabled_0();
	bool Get_EyeOfReach1_1_bIsEnabled_0();
	ESlateVisibility Get_CloseWindow_Visibility_0();
	struct FSlateBrush Get_BlunderbussSlot1_Brush_0();
	bool Get_Blunderbuss1_bIsEnabled_0();
	bool Get_Blunderbuss1_1_bIsEnabled_0();
	void ExecuteUbergraph_Weapon_choosing_1(int32 EntryPoint);
	void Construct();
	void BndEvt__Weapon_choosing_Flintlock1_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Weapon_choosing_EyeOfReach1_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Weapon_choosing_Blunderbuss1_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Weapon_choosing_1_Flintlock1_2_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Weapon_choosing_1_EyeOfReach1_1_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Weapon_choosing_1_CloseWindow_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Weapon_choosing_1_Button_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Weapon_choosing_1_Button_1_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Weapon_choosing_1_Button_0_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Weapon_choosing_1_Blunderbuss1_1_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Weapon_choosing_1_C">();
	}
	static class UWeapon_choosing_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWeapon_choosing_1_C>();
	}
};
static_assert(alignof(UWeapon_choosing_1_C) == 0x000008, "Wrong alignment on UWeapon_choosing_1_C");
static_assert(sizeof(UWeapon_choosing_1_C) == 0x000370, "Wrong size on UWeapon_choosing_1_C");
static_assert(offsetof(UWeapon_choosing_1_C, UberGraphFrame) == 0x000290, "Member 'UWeapon_choosing_1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWeapon_choosing_1_C, Blunderbuss1) == 0x000298, "Member 'UWeapon_choosing_1_C::Blunderbuss1' has a wrong offset!");
static_assert(offsetof(UWeapon_choosing_1_C, Blunderbuss1_1) == 0x0002A0, "Member 'UWeapon_choosing_1_C::Blunderbuss1_1' has a wrong offset!");
static_assert(offsetof(UWeapon_choosing_1_C, Border) == 0x0002A8, "Member 'UWeapon_choosing_1_C::Border' has a wrong offset!");
static_assert(offsetof(UWeapon_choosing_1_C, Border_0) == 0x0002B0, "Member 'UWeapon_choosing_1_C::Border_0' has a wrong offset!");
static_assert(offsetof(UWeapon_choosing_1_C, Button) == 0x0002B8, "Member 'UWeapon_choosing_1_C::Button' has a wrong offset!");
static_assert(offsetof(UWeapon_choosing_1_C, Button_0) == 0x0002C0, "Member 'UWeapon_choosing_1_C::Button_0' has a wrong offset!");
static_assert(offsetof(UWeapon_choosing_1_C, Button_1) == 0x0002C8, "Member 'UWeapon_choosing_1_C::Button_1' has a wrong offset!");
static_assert(offsetof(UWeapon_choosing_1_C, CloseWindow) == 0x0002D0, "Member 'UWeapon_choosing_1_C::CloseWindow' has a wrong offset!");
static_assert(offsetof(UWeapon_choosing_1_C, EyeOfReach1) == 0x0002D8, "Member 'UWeapon_choosing_1_C::EyeOfReach1' has a wrong offset!");
static_assert(offsetof(UWeapon_choosing_1_C, EyeOfReach1_1) == 0x0002E0, "Member 'UWeapon_choosing_1_C::EyeOfReach1_1' has a wrong offset!");
static_assert(offsetof(UWeapon_choosing_1_C, Flintlock1) == 0x0002E8, "Member 'UWeapon_choosing_1_C::Flintlock1' has a wrong offset!");
static_assert(offsetof(UWeapon_choosing_1_C, Flintlock1_2) == 0x0002F0, "Member 'UWeapon_choosing_1_C::Flintlock1_2' has a wrong offset!");
static_assert(offsetof(UWeapon_choosing_1_C, GunEquipedImage1) == 0x0002F8, "Member 'UWeapon_choosing_1_C::GunEquipedImage1' has a wrong offset!");
static_assert(offsetof(UWeapon_choosing_1_C, GunEquipedImage2) == 0x000300, "Member 'UWeapon_choosing_1_C::GunEquipedImage2' has a wrong offset!");
static_assert(offsetof(UWeapon_choosing_1_C, Hatwindow) == 0x000308, "Member 'UWeapon_choosing_1_C::Hatwindow' has a wrong offset!");
static_assert(offsetof(UWeapon_choosing_1_C, HorizontalBox) == 0x000310, "Member 'UWeapon_choosing_1_C::HorizontalBox' has a wrong offset!");
static_assert(offsetof(UWeapon_choosing_1_C, HorizontalBox_0) == 0x000318, "Member 'UWeapon_choosing_1_C::HorizontalBox_0' has a wrong offset!");
static_assert(offsetof(UWeapon_choosing_1_C, Image_0) == 0x000320, "Member 'UWeapon_choosing_1_C::Image_0' has a wrong offset!");
static_assert(offsetof(UWeapon_choosing_1_C, Image_1) == 0x000328, "Member 'UWeapon_choosing_1_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWeapon_choosing_1_C, Image_2) == 0x000330, "Member 'UWeapon_choosing_1_C::Image_2' has a wrong offset!");
static_assert(offsetof(UWeapon_choosing_1_C, Image_3) == 0x000338, "Member 'UWeapon_choosing_1_C::Image_3' has a wrong offset!");
static_assert(offsetof(UWeapon_choosing_1_C, Image_4) == 0x000340, "Member 'UWeapon_choosing_1_C::Image_4' has a wrong offset!");
static_assert(offsetof(UWeapon_choosing_1_C, Image_5) == 0x000348, "Member 'UWeapon_choosing_1_C::Image_5' has a wrong offset!");
static_assert(offsetof(UWeapon_choosing_1_C, GusRefrence) == 0x000350, "Member 'UWeapon_choosing_1_C::GusRefrence' has a wrong offset!");
static_assert(offsetof(UWeapon_choosing_1_C, Attach_mekshat) == 0x000358, "Member 'UWeapon_choosing_1_C::Attach_mekshat' has a wrong offset!");
static_assert(offsetof(UWeapon_choosing_1_C, Weapon_2_memory) == 0x000368, "Member 'UWeapon_choosing_1_C::Weapon_2_memory' has a wrong offset!");
static_assert(offsetof(UWeapon_choosing_1_C, Weapon_1_memory) == 0x00036C, "Member 'UWeapon_choosing_1_C::Weapon_1_memory' has a wrong offset!");

}

