#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeatherSystem_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WeatherSystem_BP.WeatherSystem_BP_C
// 0x0018 (0x0290 - 0x0278)
class AWeatherSystem_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      SnowVFX;                                           // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ExecuteUbergraph_WeatherSystem_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WeatherSystem_BP_C">();
	}
	static class AWeatherSystem_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWeatherSystem_BP_C>();
	}
};
static_assert(alignof(AWeatherSystem_BP_C) == 0x000008, "Wrong alignment on AWeatherSystem_BP_C");
static_assert(sizeof(AWeatherSystem_BP_C) == 0x000290, "Wrong size on AWeatherSystem_BP_C");
static_assert(offsetof(AWeatherSystem_BP_C, UberGraphFrame) == 0x000278, "Member 'AWeatherSystem_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AWeatherSystem_BP_C, SnowVFX) == 0x000280, "Member 'AWeatherSystem_BP_C::SnowVFX' has a wrong offset!");
static_assert(offsetof(AWeatherSystem_BP_C, DefaultSceneRoot) == 0x000288, "Member 'AWeatherSystem_BP_C::DefaultSceneRoot' has a wrong offset!");

}

