#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: YouAreOnTeam

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function YouAreOnTeam.YouAreOnTeam_C.GetText_0
// 0x0030 (0x0030 - 0x0000)
struct YouAreOnTeam_C_GetText_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerControllerBP_C*                  K2Node_DynamicCast_AsPlayer_Controller_BP;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(YouAreOnTeam_C_GetText_0) == 0x000008, "Wrong alignment on YouAreOnTeam_C_GetText_0");
static_assert(sizeof(YouAreOnTeam_C_GetText_0) == 0x000030, "Wrong size on YouAreOnTeam_C_GetText_0");
static_assert(offsetof(YouAreOnTeam_C_GetText_0, ReturnValue) == 0x000000, "Member 'YouAreOnTeam_C_GetText_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(YouAreOnTeam_C_GetText_0, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'YouAreOnTeam_C_GetText_0::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(YouAreOnTeam_C_GetText_0, K2Node_DynamicCast_AsPlayer_Controller_BP) == 0x000020, "Member 'YouAreOnTeam_C_GetText_0::K2Node_DynamicCast_AsPlayer_Controller_BP' has a wrong offset!");
static_assert(offsetof(YouAreOnTeam_C_GetText_0, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'YouAreOnTeam_C_GetText_0::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(YouAreOnTeam_C_GetText_0, K2Node_SwitchInteger_CmpSuccess) == 0x000029, "Member 'YouAreOnTeam_C_GetText_0::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function YouAreOnTeam.YouAreOnTeam_C.GetColorAndOpacity_1
// 0x00D0 (0x00D0 - 0x0000)
struct YouAreOnTeam_C_GetColorAndOpacity_1 final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0014)(Parm, OutParm, ReturnParm)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0014(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0028(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x003C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0050(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x0064(0x0014)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerControllerBP_C*                  K2Node_DynamicCast_AsPlayer_Controller_BP;         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_5;                    // 0x008C(0x0014)()
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_6;                    // 0x00A4(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_7;                    // 0x00B8(0x0014)()
};
static_assert(alignof(YouAreOnTeam_C_GetColorAndOpacity_1) == 0x000008, "Wrong alignment on YouAreOnTeam_C_GetColorAndOpacity_1");
static_assert(sizeof(YouAreOnTeam_C_GetColorAndOpacity_1) == 0x0000D0, "Wrong size on YouAreOnTeam_C_GetColorAndOpacity_1");
static_assert(offsetof(YouAreOnTeam_C_GetColorAndOpacity_1, ReturnValue) == 0x000000, "Member 'YouAreOnTeam_C_GetColorAndOpacity_1::ReturnValue' has a wrong offset!");
static_assert(offsetof(YouAreOnTeam_C_GetColorAndOpacity_1, K2Node_MakeStruct_SlateColor) == 0x000014, "Member 'YouAreOnTeam_C_GetColorAndOpacity_1::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(YouAreOnTeam_C_GetColorAndOpacity_1, K2Node_MakeStruct_SlateColor_1) == 0x000028, "Member 'YouAreOnTeam_C_GetColorAndOpacity_1::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(YouAreOnTeam_C_GetColorAndOpacity_1, K2Node_MakeStruct_SlateColor_2) == 0x00003C, "Member 'YouAreOnTeam_C_GetColorAndOpacity_1::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(YouAreOnTeam_C_GetColorAndOpacity_1, K2Node_MakeStruct_SlateColor_3) == 0x000050, "Member 'YouAreOnTeam_C_GetColorAndOpacity_1::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(YouAreOnTeam_C_GetColorAndOpacity_1, K2Node_MakeStruct_SlateColor_4) == 0x000064, "Member 'YouAreOnTeam_C_GetColorAndOpacity_1::K2Node_MakeStruct_SlateColor_4' has a wrong offset!");
static_assert(offsetof(YouAreOnTeam_C_GetColorAndOpacity_1, CallFunc_GetPlayerController_ReturnValue) == 0x000078, "Member 'YouAreOnTeam_C_GetColorAndOpacity_1::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(YouAreOnTeam_C_GetColorAndOpacity_1, K2Node_DynamicCast_AsPlayer_Controller_BP) == 0x000080, "Member 'YouAreOnTeam_C_GetColorAndOpacity_1::K2Node_DynamicCast_AsPlayer_Controller_BP' has a wrong offset!");
static_assert(offsetof(YouAreOnTeam_C_GetColorAndOpacity_1, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'YouAreOnTeam_C_GetColorAndOpacity_1::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(YouAreOnTeam_C_GetColorAndOpacity_1, K2Node_MakeStruct_SlateColor_5) == 0x00008C, "Member 'YouAreOnTeam_C_GetColorAndOpacity_1::K2Node_MakeStruct_SlateColor_5' has a wrong offset!");
static_assert(offsetof(YouAreOnTeam_C_GetColorAndOpacity_1, K2Node_SwitchInteger_CmpSuccess) == 0x0000A0, "Member 'YouAreOnTeam_C_GetColorAndOpacity_1::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(YouAreOnTeam_C_GetColorAndOpacity_1, K2Node_MakeStruct_SlateColor_6) == 0x0000A4, "Member 'YouAreOnTeam_C_GetColorAndOpacity_1::K2Node_MakeStruct_SlateColor_6' has a wrong offset!");
static_assert(offsetof(YouAreOnTeam_C_GetColorAndOpacity_1, K2Node_MakeStruct_SlateColor_7) == 0x0000B8, "Member 'YouAreOnTeam_C_GetColorAndOpacity_1::K2Node_MakeStruct_SlateColor_7' has a wrong offset!");

// Function YouAreOnTeam.YouAreOnTeam_C.GetColorAndOpacity_0
// 0x00D0 (0x00D0 - 0x0000)
struct YouAreOnTeam_C_GetColorAndOpacity_0 final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0014)(Parm, OutParm, ReturnParm)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0014(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0028(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x003C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0050(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x0064(0x0014)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerControllerBP_C*                  K2Node_DynamicCast_AsPlayer_Controller_BP;         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_5;                    // 0x008C(0x0014)()
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_6;                    // 0x00A4(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_7;                    // 0x00B8(0x0014)()
};
static_assert(alignof(YouAreOnTeam_C_GetColorAndOpacity_0) == 0x000008, "Wrong alignment on YouAreOnTeam_C_GetColorAndOpacity_0");
static_assert(sizeof(YouAreOnTeam_C_GetColorAndOpacity_0) == 0x0000D0, "Wrong size on YouAreOnTeam_C_GetColorAndOpacity_0");
static_assert(offsetof(YouAreOnTeam_C_GetColorAndOpacity_0, ReturnValue) == 0x000000, "Member 'YouAreOnTeam_C_GetColorAndOpacity_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(YouAreOnTeam_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateColor) == 0x000014, "Member 'YouAreOnTeam_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(YouAreOnTeam_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateColor_1) == 0x000028, "Member 'YouAreOnTeam_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(YouAreOnTeam_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateColor_2) == 0x00003C, "Member 'YouAreOnTeam_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(YouAreOnTeam_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateColor_3) == 0x000050, "Member 'YouAreOnTeam_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(YouAreOnTeam_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateColor_4) == 0x000064, "Member 'YouAreOnTeam_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateColor_4' has a wrong offset!");
static_assert(offsetof(YouAreOnTeam_C_GetColorAndOpacity_0, CallFunc_GetPlayerController_ReturnValue) == 0x000078, "Member 'YouAreOnTeam_C_GetColorAndOpacity_0::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(YouAreOnTeam_C_GetColorAndOpacity_0, K2Node_DynamicCast_AsPlayer_Controller_BP) == 0x000080, "Member 'YouAreOnTeam_C_GetColorAndOpacity_0::K2Node_DynamicCast_AsPlayer_Controller_BP' has a wrong offset!");
static_assert(offsetof(YouAreOnTeam_C_GetColorAndOpacity_0, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'YouAreOnTeam_C_GetColorAndOpacity_0::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(YouAreOnTeam_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateColor_5) == 0x00008C, "Member 'YouAreOnTeam_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateColor_5' has a wrong offset!");
static_assert(offsetof(YouAreOnTeam_C_GetColorAndOpacity_0, K2Node_SwitchInteger_CmpSuccess) == 0x0000A0, "Member 'YouAreOnTeam_C_GetColorAndOpacity_0::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(YouAreOnTeam_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateColor_6) == 0x0000A4, "Member 'YouAreOnTeam_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateColor_6' has a wrong offset!");
static_assert(offsetof(YouAreOnTeam_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateColor_7) == 0x0000B8, "Member 'YouAreOnTeam_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateColor_7' has a wrong offset!");

// Function YouAreOnTeam.YouAreOnTeam_C.ExecuteUbergraph_YouAreOnTeam
// 0x0010 (0x0010 - 0x0000)
struct YouAreOnTeam_C_ExecuteUbergraph_YouAreOnTeam final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(YouAreOnTeam_C_ExecuteUbergraph_YouAreOnTeam) == 0x000008, "Wrong alignment on YouAreOnTeam_C_ExecuteUbergraph_YouAreOnTeam");
static_assert(sizeof(YouAreOnTeam_C_ExecuteUbergraph_YouAreOnTeam) == 0x000010, "Wrong size on YouAreOnTeam_C_ExecuteUbergraph_YouAreOnTeam");
static_assert(offsetof(YouAreOnTeam_C_ExecuteUbergraph_YouAreOnTeam, EntryPoint) == 0x000000, "Member 'YouAreOnTeam_C_ExecuteUbergraph_YouAreOnTeam::EntryPoint' has a wrong offset!");
static_assert(offsetof(YouAreOnTeam_C_ExecuteUbergraph_YouAreOnTeam, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'YouAreOnTeam_C_ExecuteUbergraph_YouAreOnTeam::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

